[
  {
    "id": "jdkvz99",
    "date": "2023-03-25 03:19:58",
    "content": "It’s kinda crazy how the Russians pissed all the modern shit down the drain, and resorted back to caveman",
    "username": "Mzulft-Mzinchaleft",
    "score": 40,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdkzrfv",
    "date": "2023-03-25 03:54:26",
    "content": "Muscovites resemble addicts, scrounging among discarded cigarette butts and booze bottles desperately looking for an outside fix. Their true solution lay within, but they are too cowardly and stupid to acknowledge and instead bemoan the harsh medicine administered by others.\n\nFor all the hypocritical diatribes, Muscovites refuse to pluck out their own offending ‘eye’ and cut off the unruly ‘hand’ taking them off the righteous path. So instead they will wander further into the woods toward final ruin. There is still time to preserve some measure of dignity, to know that right can still be found, but as these cobbled old junkers show, that is in short supply. The end comes for the ‘federation’.",
    "username": "Kan4lZ0n3",
    "score": 23,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdlepcj",
    "date": "2023-03-25 06:47:58",
    "content": "I’m still perplexed how the US took the capitol of Iraq in a matter of months, starting from a different country, against the 4th largest army at the time, and how Ukraine is able to hold back Russias advance within, what, a hundred miles from their border? I always believed the army had some rot since the end of the USSR, but goddamn, this war is fucking comical from a strategic view.",
    "username": "TheBagman07",
    "score": 21,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdl4sz0",
    "date": "2023-03-25 04:44:56",
    "content": "Soon they will put their crews onto the blow up decoy tanks and send those into action.",
    "username": "JoeDirtsMullet00",
    "score": 12,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdlv9wy",
    "date": "2023-03-25 10:50:18",
    "content": "Never downplay an enemy - the Russians are still and always will be a great danger to the rest of the free world. They are not finished yet.",
    "username": "1-800-fat-chicks",
    "score": 4,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdkzkti",
    "date": "2023-03-25 03:52:43",
    "content": "I think the statement that the tanks are heading to Ukraine is premature.\n\nIf I remember correctly, they were spotted and video on the train. But without geolocation or confirmation of their destination.\n\nI think we're all expecting them to get sent to Ukraine, but let's be accurate here. That's just a logical conclusion, but still an assumption without evidence.\n\n\nUsually follow this channel, but I feel should have accurate info.",
    "username": "Culverin",
    "score": 12,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdl2fii",
    "date": "2023-03-25 04:20:28",
    "content": "Finland could invade Russia tmrw cuz they got nada left it seems",
    "username": "Fresh_wasabi_joos",
    "score": 4,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdl2a9m",
    "date": "2023-03-25 04:18:59",
    "content": "With the t54/55 russia defeats Ukraine, Nato, Skeletor and Darth Vader...",
    "username": "shiversc",
    "score": 4,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdl2xsu",
    "date": "2023-03-25 04:25:31",
    "content": "What about the T-14's?",
    "username": "alwaysDL",
    "score": 4,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdlmue8",
    "date": "2023-03-25 08:48:02",
    "content": "I saw somewhere that the T-54/55's are most likely going to be used as mobile artillery while the SPG's are getting their barrel's repaired and replaced.",
    "username": "BooYeah_8484",
    "score": 2,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdld8f1",
    "date": "2023-03-25 06:27:37",
    "content": "It reminds me of when I was younger and I bought my first car because I was a little envious of my comrades. It was a third hand car. After a few months it began to break in various places. I sent it to scrapyard.",
    "username": "greeneditman",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdl5sx5",
    "date": "2023-03-25 04:55:29",
    "content": "Russia has not unleashed the crazy shit in their arsenal.",
    "username": "LuckyOtter288",
    "score": -13,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdlekl2",
    "date": "2023-03-25 06:46:10",
    "content": "The T-54A is 1950s, not WWII, vintage. It was well armored and well-armed for its time, with its Western contemporaries being the British Centurion and American M47 and M48.",
    "username": "Purple-flash-drive",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdlksd4",
    "date": "2023-03-25 08:16:55",
    "content": "Little putin is going to fuck around so hard and find out moscow might just get turned into East Kyiv at this rate.",
    "username": "DadaDoDat",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdlmo1q",
    "date": "2023-03-25 08:45:24",
    "content": "Who'd would've thought that the orcs would have wanted to do a tank clearance cleaning this year?  All tanks, bmps and trucks must go !",
    "username": "Parking_Resolution63",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdltbbd",
    "date": "2023-03-25 10:22:58",
    "content": "Isn’t China supplying Russia now?",
    "username": "_JackSpears_",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdlxexh",
    "date": "2023-03-25 11:17:36",
    "content": "Somebody have a link to the video of the tank assault he is talking about??",
    "username": "roevoe",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdm39tu",
    "date": "2023-03-25 12:23:18",
    "content": "Real. I heard over at r/combatfootage that Russians are down to just using shovels",
    "username": "unibomber24",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t3_1218v26"
  },
  {
    "id": "jdldn15",
    "date": "2023-03-25 06:33:15",
    "content": "And their 'modern' stuff is actually 90s NATO level. Imagine US coming in with stuff like drone swarm 🙈",
    "username": "coukou76",
    "score": 19,
    "post_id": "1218v26",
    "parent_id": "t1_jdkvz99"
  },
  {
    "id": "jdl962n",
    "date": "2023-03-25 05:34:53",
    "content": "The Bible says russia will be attacking Israel with swords, bucklers, and shields. Ezekiel 38.\n\nOh man...",
    "username": "MaxmaxExtreme",
    "score": 9,
    "post_id": "1218v26",
    "parent_id": "t1_jdkvz99"
  },
  {
    "id": "jdljk1s",
    "date": "2023-03-25 07:58:19",
    "content": "Ukraine have something to fight for. The Russians dont.  There is no goal apart from grabbing land for Putin's purse.  Would you die because of some vague, ever changing narrative from a group of billionaires?\n\nCorruption is absolutely rife in Russia.  None of the kit is looked after, or only exists on a spreadsheet. Where is their vaunted air power for example? Hiding/non-functional...\n\nThe Russians believed their own lies from day 1. They still believe their own lies because to admit the truth is effectively suicide in Putin land.  You can tell yourselves that Ukraine is full of Nazis and the people will welcome you with open arms all you want.  This doesn't help Ivan who is freezing to death in a trench or being incinerated in a poorly protected vehicle.\n\nTheir disregard for human life leaves them using early 20th century tactics / poor training.  The Ukrainians were already modernising and this is being fast tracked by the West.",
    "username": "custard_doughnuts",
    "score": 17,
    "post_id": "1218v26",
    "parent_id": "t1_jdlepcj"
  },
  {
    "id": "jdlxjjn",
    "date": "2023-03-25 11:19:12",
    "content": "Two years ago, nobody would have believed their (lack of) performance on the battlefield",
    "username": "slartibartfast2320",
    "score": 3,
    "post_id": "1218v26",
    "parent_id": "t1_jdlepcj"
  },
  {
    "id": "jdlvhh6",
    "date": "2023-03-25 10:53:03",
    "content": "Wasn't just the US. Our NATO allies put in some serious work too.",
    "username": "Clean-Meeting-2927",
    "score": 2,
    "post_id": "1218v26",
    "parent_id": "t1_jdlepcj"
  },
  {
    "id": "jdle9t0",
    "date": "2023-03-25 06:42:00",
    "content": "All of their tanks are blow up tanks.",
    "username": "FredDagg001",
    "score": 10,
    "post_id": "1218v26",
    "parent_id": "t1_jdl4sz0"
  },
  {
    "id": "jdl4lni",
    "date": "2023-03-25 04:42:49",
    "content": "Do you think they put those old tanks from storage and the troops onboard on a train for a joy ride around Russia?",
    "username": "JoeDirtsMullet00",
    "score": 17,
    "post_id": "1218v26",
    "parent_id": "t1_jdkzkti"
  },
  {
    "id": "jdldrw7",
    "date": "2023-03-25 06:35:07",
    "content": "I agree with you here but I saw [this \"analysis\"](https://youtube.com/shorts/oneS52OxJFQ?feature=share) (for lack of a better term) yesterday. It's a youtube short but basically he thinks the older tanks are being brought to Ukraine to act as mobile artillery units and not meant to act as a modern day tank would, (ie undertaking tasks on the front lines) like Reporting from Ukraine claims here.\n\nI'm not a military analyst so for me, either RFU or Ryan McBeth could be right or neither of them could be and I wouldn't be able to tell. I'm Just giving a different assessment from another source",
    "username": "rProgs",
    "score": 4,
    "post_id": "1218v26",
    "parent_id": "t1_jdkzkti"
  },
  {
    "id": "jdl75vy",
    "date": "2023-03-25 05:10:44",
    "content": "Yes, I also thought the tanks could be sent to somewhere as organ donors. But as JoeDirtsMullet00 pointed out, there is also a cargo wagon with people at the open door.",
    "username": "Listelmacher",
    "score": 2,
    "post_id": "1218v26",
    "parent_id": "t1_jdkzkti"
  },
  {
    "id": "jdlvzal",
    "date": "2023-03-25 10:59:35",
    "content": "> Usually follow this channel, but I feel should have accurate info.\n\nThe predictions in this channel are often questionable. He does report on stuff that happened way quicker than anyone else. It feels like he mentions things a day in advance.\n\nOn this subject, it feels like yet another prediction. This made using questionable logic. Just because they're preparing really old tanks doesn't follow that they ran out of other tanks. They might or might not have. Further, it was one video of really old tanks, there's hardly anything to conclude from that.\n\nThis entire bit should be ignored. It feels like the reporting on Russia fighting with shovels. That was stupid and not true. The source was someone completely misinterpreting a report and loads of media repeating that again.",
    "username": "bkor",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdkzkti"
  },
  {
    "id": "jdliok3",
    "date": "2023-03-25 07:45:07",
    "content": "No one wants to invade Russia. Be like inheriting a house but it's full of asbestos and radon",
    "username": "custard_doughnuts",
    "score": 9,
    "post_id": "1218v26",
    "parent_id": "t1_jdl2fii"
  },
  {
    "id": "jdlh5ek",
    "date": "2023-03-25 07:22:23",
    "content": "We have absolutely no desire to invade any part of that miserable hell hole!",
    "username": "mic_kas",
    "score": 8,
    "post_id": "1218v26",
    "parent_id": "t1_jdl2fii"
  },
  {
    "id": "jdlmf9r",
    "date": "2023-03-25 08:41:37",
    "content": "More realistically, Chechnya can start another cessation war tomorrow, and Russia won’t be able to prevent them from leaving because they got nada left it seems. \n\nAnd another 80 or so republics, oblasts, okrugs and krays not far behind.",
    "username": "oripash",
    "score": 2,
    "post_id": "1218v26",
    "parent_id": "t1_jdl2fii"
  },
  {
    "id": "jdlb6r8",
    "date": "2023-03-25 06:00:18",
    "content": "The T-14 is a white elephant. They have had a lot of delays with the project due to technical problems and going over budget. The sanctions have only made it worse as the tank is useless without modern tech such as microchips. Even before the war, the project was going to fail, which is why Russia was focused on upgrading T-90s, T-80s, and T-72s. Now it’s all but assured. Russia will not use every last T-90, T-80, or T-72 in Ukraine as they will need a substantial tank force in case of war with NATO or China. Yes, I said China bc a Chinese invasion of Eastern Russia is far more realistic than an invasion by NATO due to the vast amount of resources there that a country like China will desperately need as most of their access to oil can be cut off in the Indian Ocean by a naval blockade. The West just wants Russia out of Europe.",
    "username": "wittypop",
    "score": 6,
    "post_id": "1218v26",
    "parent_id": "t1_jdl2xsu"
  },
  {
    "id": "jdl7anm",
    "date": "2023-03-25 05:12:17",
    "content": "They don't work, because the engine that they're built around is junk. They need to switch them to using the same basic engine that the T72 uses - but that won't fit - and nobody wants to go back to the drawing board with it.",
    "username": "ocelot_piss",
    "score": 5,
    "post_id": "1218v26",
    "parent_id": "t1_jdl2xsu"
  },
  {
    "id": "jdl91x6",
    "date": "2023-03-25 05:33:25",
    "content": "Thanks for asking. The T-14 is a nice project. Like communism or cold fusion. There are some minor problems in realization.  \nRecently there was a report about the minor problems to be fixed from topwar.ru:  \nhttps://www.reddit.com/r/RussiaUkraineWar2022/comments/101nway/devastating_for_russia_report_on_why_the_armata/  \nYou will see it is mostly minor problems with the engine. Maybe the T-14 could be paired with a MT-LB for moving around. If MT-LB's are still available. :)",
    "username": "Listelmacher",
    "score": 4,
    "post_id": "1218v26",
    "parent_id": "t1_jdl2xsu"
  },
  {
    "id": "jdl8aq7",
    "date": "2023-03-25 05:24:06",
    "content": "the 2 or 3 that actually kind, might  work? what difference will it make?",
    "username": "egabriel2001",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdl2xsu"
  },
  {
    "id": "jdl6s5a",
    "date": "2023-03-25 05:06:28",
    "content": "Maybe because it doesn't actually do what they claim it does. Bluffing only works when you don't have to back it up with action.",
    "username": "bazonthereddit",
    "score": 11,
    "post_id": "1218v26",
    "parent_id": "t1_jdl5sx5"
  },
  {
    "id": "jdl85bv",
    "date": "2023-03-25 05:22:17",
    "content": "Please tell me more.",
    "username": "TheGisbon",
    "score": 2,
    "post_id": "1218v26",
    "parent_id": "t1_jdl5sx5"
  },
  {
    "id": "jdl9mlm",
    "date": "2023-03-25 05:40:26",
    "content": "Bloviating hyperbole is the definition of the russian military. Many here have been paying extremely close attention to the devolution of armor and troops over the last year, we're not making anything up.\n\nYes, Russia has nukes but apparently I don't care and neither does any other western countries. Proxy wars by russia or the west, we all do it so the game continues.",
    "username": "MaxmaxExtreme",
    "score": 2,
    "post_id": "1218v26",
    "parent_id": "t1_jdl5sx5"
  },
  {
    "id": "jdliv6m",
    "date": "2023-03-25 07:47:56",
    "content": "Wagner and Kadrov seem pretty crazy\n\nYou mean equipment?  Well, unless they decide to suicide themselves and go Nuclear, what else have they left to send",
    "username": "custard_doughnuts",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdl5sx5"
  },
  {
    "id": "jdlvg09",
    "date": "2023-03-25 10:52:33",
    "content": "That remark has been going around for more than a year. It's pretty much most its meaning at least half a year ago.",
    "username": "bkor",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdl5sx5"
  },
  {
    "id": "jdlixhq",
    "date": "2023-03-25 07:48:53",
    "content": "Better call up Bovington then.  They probably have a working Centurion.",
    "username": "custard_doughnuts",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdlekl2"
  },
  {
    "id": "jdlxdf2",
    "date": "2023-03-25 11:17:07",
    "content": "Well they still have a nuclear arsenal",
    "username": "confuzzledpug",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdldn15"
  },
  {
    "id": "jdllff4",
    "date": "2023-03-25 08:26:29",
    "content": "Always remember that cheesy, but quite apt line from Robin Hood Prince of Thieves: One man defending his home is worth ten hired soldiers.",
    "username": "Launch_The_Cat",
    "score": 10,
    "post_id": "1218v26",
    "parent_id": "t1_jdljk1s"
  },
  {
    "id": "jdm07on",
    "date": "2023-03-25 11:50:36",
    "content": "Was looking at some stats last night and i think the british chally 1 tank had something like 390 kills to 0 losses in the first gulf war",
    "username": "MrGlayden",
    "score": 3,
    "post_id": "1218v26",
    "parent_id": "t1_jdlvhh6"
  },
  {
    "id": "jdmdz0r",
    "date": "2023-03-25 14:00:03",
    "content": "Definitely. Honestly I think this adds to the confusion as our allies set a standard for what I think “near peer” actually means. I (wrongly) thought the Russians would have the roughly same success as the British did in their army. Apparently, the Russians did too.",
    "username": "TheBagman07",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdlvhh6"
  },
  {
    "id": "jdlyfau",
    "date": "2023-03-25 11:29:52",
    "content": "Aye ooooo!!!",
    "username": "Admirable-Sir9716",
    "score": 3,
    "post_id": "1218v26",
    "parent_id": "t1_jdle9t0"
  },
  {
    "id": "jdlua3s",
    "date": "2023-03-25 10:36:33",
    "content": "Helium does not burn",
    "username": "idsltd",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdl71qk"
  },
  {
    "id": "jdl6hpy",
    "date": "2023-03-25 05:03:09",
    "content": "Exactly, they're not going to start moving these tanks for no reason",
    "username": "loneshoter",
    "score": 8,
    "post_id": "1218v26",
    "parent_id": "t1_jdl4lni"
  },
  {
    "id": "jdlilgb",
    "date": "2023-03-25 07:43:48",
    "content": "It doesn't mean they will be front line though.\n\nI mean, they probably will get sent forward 1 by 1 with officers scratching their heads wondering why their attacks never work and the tanks never come back\n\nBut it doesn't MEAN that",
    "username": "custard_doughnuts",
    "score": 5,
    "post_id": "1218v26",
    "parent_id": "t1_jdl4lni"
  },
  {
    "id": "jdl9vid",
    "date": "2023-03-25 05:43:28",
    "content": "Of course they're doing something with them.  But we should all recognize that a video of some tanks on a train does not automatically mean they are going to Ukraine.\n\nThey could be for training, they could also be used to relieve some newer tanks elsewhere to send those to Ukraine.\n\nJust because we all want to have a good laugh at Russia doesn't mean we should ignore the basics that zero verifiable data was provided.",
    "username": "Culverin",
    "score": 14,
    "post_id": "1218v26",
    "parent_id": "t1_jdl4lni"
  },
  {
    "id": "jdl7vfb",
    "date": "2023-03-25 05:19:02",
    "content": "Good observation. The cargo wagon with the people at the door makes the difference. Maybe the Ukrainian forces will start to use their latest Wunderwaffe. The name starts with \"RPG\" and has a number less than 29.",
    "username": "Listelmacher",
    "score": 3,
    "post_id": "1218v26",
    "parent_id": "t1_jdl4lni"
  },
  {
    "id": "jdlmaxg",
    "date": "2023-03-25 08:39:43",
    "content": "He may be right. We’ll know once we start seeing where they got sent and used - to the front lines or further backs where they can be used as short range artillery.",
    "username": "oripash",
    "score": 2,
    "post_id": "1218v26",
    "parent_id": "t1_jdldrw7"
  },
  {
    "id": "jdltkuf",
    "date": "2023-03-25 10:26:37",
    "content": "And russians.",
    "username": "ArrogantEngland",
    "score": 2,
    "post_id": "1218v26",
    "parent_id": "t1_jdliok3"
  },
  {
    "id": "jdliqx5",
    "date": "2023-03-25 07:46:07",
    "content": "NATO doesn't invade anyone.  Its a defensive pact.  Russia under threat from NATO is purely their lies",
    "username": "custard_doughnuts",
    "score": 6,
    "post_id": "1218v26",
    "parent_id": "t1_jdlb6r8"
  },
  {
    "id": "jdlrdds",
    "date": "2023-03-25 09:55:08",
    "content": "10 years ago China was conducting a land grab by stealth into Russia. They flooded the border towns in Russia with Chinese people and businesses, and simply took over. \n\nIn response, Russia sent a load of troops to the region to tell them to fuck off. \n\nReinforcements were sent in 2020 too. \n\nAt the same time, both countries were talking about their great friendship and cooperation.",
    "username": "AzubiUK",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdlb6r8"
  },
  {
    "id": "jdlitvn",
    "date": "2023-03-25 07:47:22",
    "content": "[Lazerpig did a typically entertaining video about the T-14 just a few days ago](https://www.youtube.com/watch?v=-opSlCGLGQ4).\n\nThe engine's the major problem, but there's a lot of other junk in their design as well. It sounds like the whole project was a stupid idea from the ground up.",
    "username": "FaceDeer",
    "score": 3,
    "post_id": "1218v26",
    "parent_id": "t1_jdl7anm"
  },
  {
    "id": "jdlavrf",
    "date": "2023-03-25 05:56:18",
    "content": "Or they expect a larger war to start in the near future and will need its proper soldiers and equipment to defend against that.\n\nThere is alot of strategy and logistics that goes into war. Sending expendables to fight a weaker target is a valid strategy. Especially when you dont want to reveal the true tactics and technology to their enemies. There is no war on russian soil. Everything they lose, has probably been sent with a expectation it's probably not coming back.\n\nOne can hope russia is actually just incompetent and weak though.",
    "username": "AIlien7",
    "score": -8,
    "post_id": "1218v26",
    "parent_id": "t1_jdl6s5a"
  },
  {
    "id": "jdm4193",
    "date": "2023-03-25 12:31:07",
    "content": "Apparently they do",
    "username": "gdaytugga",
    "score": 3,
    "post_id": "1218v26",
    "parent_id": "t1_jdlxdf2"
  },
  {
    "id": "jdm5125",
    "date": "2023-03-25 12:40:50",
    "content": "I'm starting to wonder if the majority of those are even in any condition to launch.",
    "username": "PizzaRepairman",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdlxdf2"
  },
  {
    "id": "jdmgifa",
    "date": "2023-03-25 14:20:09",
    "content": "I mean if we believe the nukes were the one piece of military technology they haven't lied about. My guess is they don't have shit that is a threat to the U.S. maybe Europe but not with all of the U.S. missile defense sites in EU",
    "username": "Funcouple0525",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdlxdf2"
  },
  {
    "id": "jdlxb80",
    "date": "2023-03-25 11:16:23",
    "content": "And one america whose convinced someone is \"bad\" is worth death I guess 🤔",
    "username": "DrMaybeDead",
    "score": 0,
    "post_id": "1218v26",
    "parent_id": "t1_jdllff4"
  },
  {
    "id": "jdlwi9e",
    "date": "2023-03-25 11:06:23",
    "content": "But what would that reason be? There is no way of knowing",
    "username": "SebboNL",
    "score": 0,
    "post_id": "1218v26",
    "parent_id": "t1_jdl6hpy"
  },
  {
    "id": "jdlq2wj",
    "date": "2023-03-25 09:36:15",
    "content": "One military youtuber I saw suggested that they may use the T-54/55s as mobile artillery while they pull back a bunch of their conventional artillery to replace shot-out barrels and such. Supposedly Russia has a massive stockpile of the 100mm shells the T-54/55 uses, since a lot of their older field arty used it too. But most of that ammo has been sitting in storage for 50-60 years by now, so it's anyone's guess how much of it is still good.",
    "username": "Honor_Among_Crows",
    "score": 7,
    "post_id": "1218v26",
    "parent_id": "t1_jdl9vid"
  },
  {
    "id": "jdlg4g0",
    "date": "2023-03-25 07:07:32",
    "content": "You train with 1945 tanks in 2023? Brilliant logic you have there.",
    "username": "-Battlestar-",
    "score": -6,
    "post_id": "1218v26",
    "parent_id": "t1_jdl9vid"
  },
  {
    "id": "jdlk5yd",
    "date": "2023-03-25 08:07:30",
    "content": "Yes, I’m aware of that. That’s what the last sentence is for. The point is, Russia is trying to make a pact with another country that will turn on them when the moment presents itself. Wonder when we have seen this before?",
    "username": "wittypop",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdliqx5"
  },
  {
    "id": "jdlhabp",
    "date": "2023-03-25 07:24:24",
    "content": "In my opinion the \"Russia is withholding its good stuff\" theory has some flaws.\n\nThe Ukraine war has been a humiliating desaster for Russia so far. They have suffered some stunning defeats and none of the deadlines (capture Donezk oblast by 15 September 2022) have been met. \nPolitically this war was also extremely costly as the failure to achieve a quick victory effectively reduced Russia from the status of a great power to a regional power with nukes, but with perhaps 10% of the political leverage Russia had before the war.\nThe war has turned into an existential crisis for Russia. And each day that passes without victory for Russia further deteriorates their position. \n\nAll of this could have been avoided if Russia had secured a quick victory - which they were unable to. The \"Russia withholds it's good stuff\" theory implies that they could have won the war quickly but didn't want to, which makes little sense given the enormous military, political, and economical cost of their military blunders.\nPortraying themselves as the strongest military in Europe had always been the central part of russian defense strategy. Other people thinking that Russia was an invincible behemoth of the battlefield war always the most valuable deterrence Russia had. Their catastrophic failure in Ukraine destroyed that image.\n\nNo.\nWhat we're seeing is peak Russia. \n\nThere are no warehouses with thousands of modern, well maintained tanks. There are no swarms of thousands of secret wonder weapons waiting to be unleashed. There are no secret ammo stockpiles which they reserve for a future conflict that is extremely unlikely to happen within the next 100 years.\n\nThat isn't to say that they sent all the best stuff to Ukraine either. Of course they're keeping reserves. But these reserves are not \"the real army\", Hidden for a \"real\" conflict.\n\nThis war is the real conflict. Russia cannot afford to lose it now (they could do so in march or April last year). So presuming that they withhold large quantities of better quality weapons while losing a war against a (presumed) non-peer military in the lime-light if the world stage does not make sense.",
    "username": "SnooTangerines6811",
    "score": 4,
    "post_id": "1218v26",
    "parent_id": "t1_jdlavrf"
  },
  {
    "id": "jdm8kp8",
    "date": "2023-03-25 13:13:52",
    "content": "allegedly",
    "username": "BWWFC",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdm4193"
  },
  {
    "id": "jdmh4xh",
    "date": "2023-03-25 14:24:59",
    "content": "They only need to be able to drop a dozen to finish the job out of the hundreds they have stockpiled",
    "username": "confuzzledpug",
    "score": 1,
    "post_id": "1218v26",
    "parent_id": "t1_jdmgifa"
  },
  {
    "id": "jdl1iqp",
    "date": "2023-03-25 04:11:24",
    "content": "Guilty, I’ve learned so much about Ukraine in the last year. So much history, culture, industry, and technology from a country I knew so little about. I feel guilty about it, but all one can do is support the heroes and tell everyone you know to support the incredible people that live there.  I still remember falling down the Antonov rabbit hole after they destroyed such a big beautiful aircraft early on in the war.  So bittersweet finding out about something so epic, only after russia destroyed it.  I just remind myself that they will once again be capable of creating incredible feats of engineering when this stupid fucking war ends.",
    "username": "BlakHearted",
    "score": 53,
    "post_id": "121965t",
    "parent_id": "t3_121965t"
  },
  {
    "id": "jdlcm61",
    "date": "2023-03-25 06:19:22",
    "content": "\"We are cool, we were always cool.\" Slava Ukraini!",
    "username": "TicketCareless",
    "score": 19,
    "post_id": "121965t",
    "parent_id": "t3_121965t"
  },
  {
    "id": "jdlbi64",
    "date": "2023-03-25 06:04:27",
    "content": "I knew nothing about Ukraine before the war, apart from good boxers from them -- Klitschkos, Lomachenko, Usyk, Kotelnik etc.\n\n&#x200B;\n\nAnd Andriyi Shevchenko.",
    "username": "Nuthetes",
    "score": 7,
    "post_id": "121965t",
    "parent_id": "t3_121965t"
  },
  {
    "id": "jdlfydr",
    "date": "2023-03-25 07:05:08",
    "content": "it took a while to realize it because we had the trumplican putin nuthuggers trying to undermine the country.",
    "username": "yamers",
    "score": 11,
    "post_id": "121965t",
    "parent_id": "t3_121965t"
  },
  {
    "id": "jdlk58k",
    "date": "2023-03-25 08:07:13",
    "content": "That has to be one of the coolest soundbites ever!\n\nAnd so true too - Slava Ukraini!",
    "username": "kinleyd",
    "score": 3,
    "post_id": "121965t",
    "parent_id": "t3_121965t"
  },
  {
    "id": "jdl4cfn",
    "date": "2023-03-25 04:40:05",
    "content": "[https://www.reddit.com/r/ukraine/comments/11u7wcg/an\\_interesting\\_soundbite\\_from\\_the\\_minister\\_of/](https://www.reddit.com/r/ukraine/comments/11u7wcg/an_interesting_soundbite_from_the_minister_of/)",
    "username": "X-T3PO",
    "score": 3,
    "post_id": "121965t",
    "parent_id": "t3_121965t"
  },
  {
    "id": "jdlov5m",
    "date": "2023-03-25 09:18:32",
    "content": "Legendary.",
    "username": "Commercial_Bear331",
    "score": 3,
    "post_id": "121965t",
    "parent_id": "t3_121965t"
  },
  {
    "id": "jdm4dy7",
    "date": "2023-03-25 12:34:38",
    "content": "I also must confess I only had a shallow familiarity with Ukraine before the war. I had an acquaintance who was a first generation immigrant from there whom I respected very much, but that was it.\n\nThen when the invasion happened and I saw Zelensky’s famous quote about needing ammo not a ride, and then I saw a picture of him in military green sharing a meal and laughing with soldiers on one of the first few nights, I became emotionally invested in Ukraine’s fight, and have since learned just how cool the Ukrainians are.",
    "username": "Pupumonke",
    "score": 1,
    "post_id": "121965t",
    "parent_id": "t3_121965t"
  },
  {
    "id": "jdmhxgh",
    "date": "2023-03-25 14:31:10",
    "content": "I knew that Ukraine always carried the bulk of USSR army in the WW2 and much of the science. Also that Russians were always looking for ways and excuses to genocide Ukrainian people but it always fired back, unfortunately at a great cost to the Ukrainian people. I'm looking forward to see the day when Ukraine gets rid of its psychopathic neighbor and can live their lives to the fullest.\nSlava Ukraini!",
    "username": "DontJudgeMeImNaked",
    "score": 1,
    "post_id": "121965t",
    "parent_id": "t3_121965t"
  },
  {
    "id": "jdl4s71",
    "date": "2023-03-25 04:44:42",
    "content": "Ukrainian here. On one hand I enjoy it very much that so many people learned about my county culture.. heck I once spoke with some  Canadian friends and they know some small villages locations in Ulraine because of war. Some even started learning basic Ukrainian so they could visit after war. On other hand I would prefer my country go unnoticed and not invaded by a \"brotherly\" self proclaimed neighboor in the name of self-fullfilled russophobia prophecy. This wont be forgotten nor forgiven for generations. Support we received from TRUE friends that came to our help wont be forgotten. Thank you.",
    "username": "Yvels",
    "score": 68,
    "post_id": "121965t",
    "parent_id": "t1_jdl1iqp"
  },
  {
    "id": "jdldmty",
    "date": "2023-03-25 06:33:10",
    "content": "Guilty too. I knew of Ukraine, but didn't know about Ukraine. Thebsame can be said for many people and countries.\n\nThis has changed. Sadly, the catalyst for the change is this damned war. Fuck you Moscovia.",
    "username": "super__hoser",
    "score": 12,
    "post_id": "121965t",
    "parent_id": "t1_jdl1iqp"
  },
  {
    "id": "jdlllth",
    "date": "2023-03-25 08:29:14",
    "content": "Bizarrely the Trump fifth-columnist is likely to be nominated leader of the Republican party.  If he is nominated, this will be an act of willful self destruction by the Republican party,",
    "username": "One_Cream_6888",
    "score": 3,
    "post_id": "121965t",
    "parent_id": "t1_jdlfydr"
  },
  {
    "id": "jdl59c0",
    "date": "2023-03-25 04:49:47",
    "content": "Yes, but now your new friends (and not the \"brotherly\" type you are currently dealing with)  will have a better understanding and knowledge, and as relations and mutually beneficial opportunities grow, Ukraine will now be remembered and considered when times for new partners need to be suggested.",
    "username": "OldStray79",
    "score": 20,
    "post_id": "121965t",
    "parent_id": "t1_jdl4s71"
  },
  {
    "id": "jdl7hzl",
    "date": "2023-03-25 05:14:38",
    "content": "Ukraine is a Phoenix.\n\nI didn't know anything about Ukrainians except a \"funny accent\".  I don't mean this disrespectfully. As an American, we are insulated due to various reasons. Our society is immature in respects to understanding other cultures. We are on a big island (NA/CA/SA). We are only fed our interests through media and agendas.\n\nI always said that every American should spend 6 months in another country to appreciate humanity. I've traveled the world and that experience has given me a certain insight to realize it's not about me but about us. \n\nThe world now knows Ukraine.  Unfortunately it took a horrific war and bloodshed for the world to know who Ukrainians are.  \n\nI stand with Ukraine. I've donated and will continue to.  The world is standing under the towering giant named Ukraine.\n\nSlava Ukrainini! Slava Heroyum!",
    "username": "Stoopitnoob",
    "score": 20,
    "post_id": "121965t",
    "parent_id": "t1_jdl4s71"
  },
  {
    "id": "jdl9s6h",
    "date": "2023-03-25 05:42:19",
    "content": "I'm curious. Whom do you consider to be a true friend now?",
    "username": "dogil_saram",
    "score": 8,
    "post_id": "121965t",
    "parent_id": "t1_jdl4s71"
  },
  {
    "id": "jdm6936",
    "date": "2023-03-25 12:52:29",
    "content": ">May you live through historic times.\n\nA Chinese insult",
    "username": "Klasseh_Khornate",
    "score": 2,
    "post_id": "121965t",
    "parent_id": "t1_jdl4s71"
  },
  {
    "id": "jdmi6xs",
    "date": "2023-03-25 14:33:09",
    "content": "One can only hope…",
    "username": "W_Anderson",
    "score": 1,
    "post_id": "121965t",
    "parent_id": "t1_jdlllth"
  },
  {
    "id": "jdll96t",
    "date": "2023-03-25 08:23:56",
    "content": "The \"brotherly\" love of big brother loves you where war is peace, freedom is slavery, ignorance is strength.\n\nAnd thousands of kids are kidnapped.",
    "username": "One_Cream_6888",
    "score": 7,
    "post_id": "121965t",
    "parent_id": "t1_jdl59c0"
  },
  {
    "id": "jdm4i6c",
    "date": "2023-03-25 12:35:49",
    "content": "Poland is the closest now I would say. Just because they know and experienced Rusky Mir the way Ulraine does now and how many of our mothers, fathers, wives and kids they welcomed. Our neighboring countries for same reasons; they dont need convincing in urgency of this situation. UK, because it got initiative. Finland, guess the reason? USA. Obvious reasons. For them everything aligned right and even got the rightful war they really needed after Iraq and Afghanistan. Literally cutting russias legs, for peanuts, without a single coffin flying home. Germany definitely, happy to see them wake up and working on their army again. German tanks are rolling in Ukraine again and we cheer it now. EU: definitely. Ukraine will enter EU in time and EU do good. God.. I went throught so many news of help that came our way I could spent whole day just pointing this and that. So many volunteers. So many joined and died defending my country Im incredibly humbled by. When war is over we will know even more stuff that went silent but helped tremendously.",
    "username": "Yvels",
    "score": 5,
    "post_id": "121965t",
    "parent_id": "t1_jdl9s6h"
  },
  {
    "id": "jdmi3c2",
    "date": "2023-03-25 14:32:24",
    "content": "From an American who is in love with Ukraine now, you’re welcome! I have cried and cussed at the news I read daily about this war.\n\nI can’t wait to visit Ukraine when this is over and spend all of my dollars in your beautiful country to help your economy and people thrive again!!!",
    "username": "W_Anderson",
    "score": 1,
    "post_id": "121965t",
    "parent_id": "t1_jdm4i6c"
  },
  {
    "id": "jdl58z7",
    "date": "2023-03-25 04:49:41",
    "content": "Neo-conservative",
    "username": "Soc_Dar",
    "score": 2,
    "post_id": "1219fio",
    "parent_id": "t3_1219fio"
  },
  {
    "id": "jdlhylj",
    "date": "2023-03-25 07:34:25",
    "content": "Mix of progressive conservatism and neoconservatism, mainly the latter. Like a slightly more progressive Bush junior.",
    "username": "casus_bibi",
    "score": 1,
    "post_id": "1219fio",
    "parent_id": "t3_1219fio"
  },
  {
    "id": "jdll6xp",
    "date": "2023-03-25 08:23:00",
    "content": "Neocon indeed\n\n>The government should not cut funding or raise the retirement age for social security. It should only do those things if they have to save the program, like in France.\n\nThat's pure govt propaganda btw.",
    "username": "a_v_o_r",
    "score": 1,
    "post_id": "1219fio",
    "parent_id": "t3_1219fio"
  },
  {
    "id": "jdl5j65",
    "date": "2023-03-25 04:52:39",
    "content": "end it. She has zero respect for an you, and every Ukrainian citizen.",
    "username": "Affectionate-Ask6323",
    "score": 1,
    "post_id": "121a2ch",
    "parent_id": "t3_121a2ch"
  },
  {
    "id": "jdl19a6",
    "date": "2023-03-25 04:08:53",
    "content": "Haha..\n\nIt is like watching a cartoon. I suppose the talking heads who wants him elected got to him. Because, while in today's GOP it is canon to worship Putin (I mean, your boi Orange eats out of Putin's hand), it is not exactly smart to be casually pro-Putin while toying with the idea of running for the White House.",
    "username": "newcomer_l",
    "score": 5,
    "post_id": "1219wlh",
    "parent_id": "t3_1219wlh"
  },
  {
    "id": "jdl2tud",
    "date": "2023-03-25 04:24:27",
    "content": "Oh look: alt-right DeZaster is playing to the hollowed-out \"Center.\" Wonder if there's anyone left to listen?",
    "username": "ThornsofTristan",
    "score": 2,
    "post_id": "1219wlh",
    "parent_id": "t3_1219wlh"
  },
  {
    "id": "jdltr5p",
    "date": "2023-03-25 10:29:12",
    "content": "I didn't know \"Clarifying\" meant \"completely changing the direction, sentiment and meaning behind\".",
    "username": "the_original_Retro",
    "score": 2,
    "post_id": "1219wlh",
    "parent_id": "t3_1219wlh"
  },
  {
    "id": "jdl8iaz",
    "date": "2023-03-25 05:26:35",
    "content": "Puddin Ron: Putin is a war criminal… which is why I love him",
    "username": "Bean-Swellington",
    "score": 1,
    "post_id": "1219wlh",
    "parent_id": "t3_1219wlh"
  },
  {
    "id": "jdl2pve",
    "date": "2023-03-25 04:23:21",
    "content": "The Kremlin wages not just a war on the present. It wages a war to forget and rewrite the past as well as corrupt the future. Heinous and vile do not adequately capture Putin’s actions which aim to bend and break the human soul.\n\nAs he and his ghouls are broken, let them find their own path back, if they seek redemption. But let us fight, with every remaining thread of resistance, in the hope to set right and make right what the Kremlin has corrupted.",
    "username": "Kan4lZ0n3",
    "score": 14,
    "post_id": "1219wk1",
    "parent_id": "t3_1219wk1"
  },
  {
    "id": "jdl5s9i",
    "date": "2023-03-25 04:55:18",
    "content": "Hey, something for Skautfolds games, Cats and other lives, Little Orpheus, Pilgrims?  \n[https://www.steamtrades.com/trade/8eXbq/h-games-w-them-and-us-tf2-keys-paypal](https://www.steamtrades.com/trade/8eXbq/h-games-w-them-and-us-tf2-keys-paypal)",
    "username": "mourinhos86",
    "score": 1,
    "post_id": "121apad",
    "parent_id": "t3_121apad"
  },
  {
    "id": "jdl6e2b",
    "date": "2023-03-25 05:02:01",
    "content": ">yeah don't see anything",
    "username": "cbander",
    "score": 1,
    "post_id": "121apad",
    "parent_id": "t1_jdl5s9i"
  },
  {
    "id": "jdl7b2j",
    "date": "2023-03-25 05:12:24",
    "content": "> We murdered millions of Iraqi civilians\n\nJesus Christ, you don't need to make shit up to be anti-Iraq war. Out of all the wars out there, you don't need hyperbole to describe how egregious the Iraq war was; the reality was extreme enough. Fuck, it's always so irritating to see \"alternative\" pundits mock media outlets for sensationalized reporting -- and then engage in the exact same behaviour themselves.",
    "username": "Splemndid",
    "score": 19,
    "post_id": "121b1nm",
    "parent_id": "t3_121b1nm"
  },
  {
    "id": "jdl84ah",
    "date": "2023-03-25 05:21:58",
    "content": "People will say the death toll is something like 1 million, but that’s from 91’ on, and includes people who have died due to sanctions, or were even killed by Saddam himself. Then all the resulting deaths after 2003 which were caught in the middle of the civil war, or the ethnic cleaning operations by ISIS or other Sunni or Shia militias. The death toll was never about how many the US directly killed due to bombings or whatever, it was everyone who died as a result of the war. \n\nI spent two years in Iraq, mainly in the greater Baghdad area. As far as shock and awe goes, dumb people like Hasan literally think the US was like dumping bombs all over Baghdad like Dresden or some shit. In reality all shock and awe was taking out both military and government targets. I saw entire Iraqi Army military bases reduced to rubble. I also stayed in buildings taken out by “smart bombs” - the building itself was half destroyed. But every building around it was mainly untouched minus windows blown out. \n\nAgain, these were mainly military targets. But there were missiles that hit civilian buildings, but that wasn’t widespread. Usually a bad missile, mis-ID’d target, etc. \n\nAll I’m saying is, Shock and Awe wasn’t some civilian bloodbath like Hasan claims. \n\nCivilians were killed in shock and awe, but most civilians were killed in the resulting civil war after the initial invasion. That’s where things got ugly and brutal. \n\nIt was like everyone was fighting everyone else, and alot of civilians got caught in the middle. US military against a Shia militia, Shia militia fighting Shia militia. Sunni militia fighting Shia militia. US against Sunni Militia. The Al Qaeda affiliated groups against everyone. Everyone was getting killed. \n\nThen there was the ISIS take over of Mosul and north Iraq. That killed a lot of civilians. And that’s part of the overall civilian death count. \n\nAnyway, my main point is, Hasan has no clue what the fuck he’s talking about, and his claim that Russia is somehow not as bad as the US is absurd. Russia is literally destroying entire cities. Cities of 200,000 people. 80,000 people, intentionally wiped out. It’s their entire war strategy to just erase entire cities off the map. Also their genocidal rhetoric kinda goes along with their genocidal actions. \n\nThe 2003 Iraq war is extremely depressing. It makes me sick that it ever happened. No civilian should have been killed. But Hasan is a dumbfuck.",
    "username": "slipknot_official",
    "score": 11,
    "post_id": "121b1nm",
    "parent_id": "t3_121b1nm"
  },
  {
    "id": "jdlw0zf",
    "date": "2023-03-25 11:00:13",
    "content": "You know what? Before Ukraine I hated the Iraq War.\n\nNow? One less crazy dictator, fuck it.",
    "username": "ScorpionofArgos",
    "score": 3,
    "post_id": "121b1nm",
    "parent_id": "t3_121b1nm"
  },
  {
    "id": "jdl62zo",
    "date": "2023-03-25 04:58:32",
    "content": "Like I hate even making this post but what’s up with just looking at civilian deaths in Ukraine which are literally unknown and completely ignoring the tens of thousand of military deaths ? Somehow if a Ukranian soldie dies it’s not the same ? From what I understand Civiian death in eastern Ukraine can be over 50k at this point who knows\n\nAnd I’m sick of whataboutism so let’s use some of our own. He should bring up Chechnya a tiny little blip with a population of 1.6 million people where Russia killed like 15% of the population .  It’s funny how much he Minimized Maos and Stalins atrocities, if your pissed off about the 3 million dead in Vietnam you should be just as pissed off at the 20 million dead in the Great Leap Forward the Far more people have been killed in total in the first year of this war than in Iraq and I hate to even say that. He just needs to score points where ever he thinks he needs too.",
    "username": "Dabbing_Squid",
    "score": 4,
    "post_id": "121b1nm",
    "parent_id": "t3_121b1nm"
  },
  {
    "id": "jdl5zul",
    "date": "2023-03-25 04:57:34",
    "content": "For Iraq, one measure says 7,500 civilians, one measure says 3,200.  The Ukraine War has 8,321 as of March 12th. These numbers don't include thousands of Ukrainian children being kidnapped and sent to Russia.",
    "username": "KronoriumExcerptC",
    "score": 4,
    "post_id": "121b1nm",
    "parent_id": "t3_121b1nm"
  },
  {
    "id": "jdlitlh",
    "date": "2023-03-25 07:47:15",
    "content": "Hassan doesn’t know anything, news at 11. \n\nAs for your second, likely tens of thousands to hundreds of thousands.",
    "username": "TheNubianNoob",
    "score": 0,
    "post_id": "121b1nm",
    "parent_id": "t3_121b1nm"
  },
  {
    "id": "jdlx315",
    "date": "2023-03-25 11:13:35",
    "content": "How many excess deaths do you believe occurred in Iraq as a result of the US invasion?",
    "username": "DCOMNoobies",
    "score": 1,
    "post_id": "121b1nm",
    "parent_id": "t1_jdl7b2j"
  },
  {
    "id": "jdl985a",
    "date": "2023-03-25 05:35:35",
    "content": "What blows my mind with him is the mental gymnastic he uses to get to those numbers and I feel like he’s so confident in saying this because trying to argue against that he can just accuse anybody of minimizing death. \n\nWhat’s even weirder is  to make this case that America is worst he seems to be bringing up the  Iran Iraq war I guess to get to those extreme numbers. While yeah I’ll agree with America funding these assholes means we helped people die but is he really blaming all those deaths on the U.S? And what’s even weirder was the Soviets aka Russia were also Arming Iraq to the teeth which makes his entire point of Russia being softer on civilians completely redundant and then making comparisons by suggesting since theirs less civilian death in Ukraine than Iraq America is worst. It’s a truly fucking bizarre take from him. He can’t just criticize the war using the real numbers he’s has to sensationalize everything.",
    "username": "Dabbing_Squid",
    "score": 5,
    "post_id": "121b1nm",
    "parent_id": "t1_jdl84ah"
  },
  {
    "id": "jdl66dp",
    "date": "2023-03-25 04:59:35",
    "content": "Yeah the initially invasion the higest estimate I can find was Around 10 thousand and civilian death in Ukriane have dropped significantly when Russia ran out of missles and stated being pushed back everywhere.",
    "username": "Dabbing_Squid",
    "score": 3,
    "post_id": "121b1nm",
    "parent_id": "t1_jdl5zul"
  },
  {
    "id": "jdla5mb",
    "date": "2023-03-25 05:47:02",
    "content": "Well he thinks Russia just wants peace in Ukraine and the U.S. is blocking all \"peace\" negotiations. He doesn't believe any state smaller than the U.S. has agency. Everyone is a puppet of the U.S - even Russia apparently, because he always finds ways to blame the U.S. for Russians actions. \n\nI hate him so much because he's so confidently wrong on so much shit.",
    "username": "slipknot_official",
    "score": 3,
    "post_id": "121b1nm",
    "parent_id": "t1_jdl985a"
  },
  {
    "id": "jdldts0",
    "date": "2023-03-25 06:35:50",
    "content": "Ukraine was moving away from russia and toward the west. In 2014, Russia attacked and took crimea and supported the breakaway folks in the east. All of the current issues have just been a continuation of the struggle between those who wanted to move away from russia and those who still had an affinity towards russia. \n\nDon't put to much stock in the vote that most people in Crimea wanted to be annexed. That vote was take after occupation. That doesn't mean that lots of people in Crimea were not in favor of Russia. The eastern part of Ukraine was always more pro-russian and Crimea actually belonged to russia prior to them giving it to Ukraine in 1954. There has been a long history between the two countries and lots of russians living in ukraine. \n\nPrior to the current conflict, Ukraine stated they were a long way from joining NATO, if ever. In peace talks in the first month of the war Ukraine offered to never join NATO. It was certainly not an immediate possibility that required an invasion and Russia didn't take them up on the offer.\n\nIronically, the war has greatly shifted many ukrainians from being mixed between russia and the west to being solidly pro-west and would certainly now welcome being in NATO for future safety reasons. They can not join NATO now because you can't be a nation in conflict as one of the requirements for joining, however, depending on how the war ends, its probably increased the chances that whatever part of ukraine is not negotiated away will join NATO in the future.\n\nI would say the situation with Japan was not exactly the same situation but somewhat similar. US wasn't sanctioning russia prior to the war and were sanctioning japan because they were actively attacking china and others in an attempt to form an empire. One major difference is that former soviet republics wanted to join NATO for protection against Russia. The similarities would be that in both cases the US would be to thwart an expansion of empire and in both cases the other country decided to act to counter the US actions. The impact on Japan was more of an immediate threat to their expansion while the issues for Russia were way less immediate. Having NATO on their doorstep obviously would not be desirable for Russia but wasn't nearly as imperative as cutting japan off from the natural resources they needed.",
    "username": "XRay2212xray",
    "score": 2,
    "post_id": "121babb",
    "parent_id": "t3_121babb"
  },
  {
    "id": "jdl7y0x",
    "date": "2023-03-25 05:19:54",
    "content": "My understanding is that the invasion of ukraine beyond crimea had been in the gameplan for years prior to the invasion. It wasn't anything about nato in particular, but more about a general positive shift in ukraines relations with the west. I don't recall Ukrainian officials commenting on nato membership until a year or two ago.",
    "username": "Hefty-Set5236",
    "score": 1,
    "post_id": "121babb",
    "parent_id": "t3_121babb"
  },
  {
    "id": "jdl6la9",
    "date": "2023-03-25 05:04:17",
    "content": "ukraine shifting closer to western sphere of influence is one reason, but not the only reason\n\n&#x200B;\n\na land dispute automatically disqualifies one from joining nato, something I'm sure russia knew and part of the reason they took crimea in the first place",
    "username": "BSye-34",
    "score": 1,
    "post_id": "121babb",
    "parent_id": "t3_121babb"
  },
  {
    "id": "jdl9ghc",
    "date": "2023-03-25 05:38:21",
    "content": "Part of my dad’s argument is that, among other things, it is not unreasonable for Russia to see the west getting cozy with Ukraine and potentially offering NATO membership, for Russia to say “no the fuck you don’t”.\n\nBy his logic, it’s the same reasoning we used for the Cuban missile crisis. Russia tries to put missiles 20 miles from the US shore, and we say “no the fuck you don’t”. I can’t really argue against Russia from that perspective. If Russia set up military bases in Mexico we’d be having a situation not unlike the one we’re in now, although idk if America would go so far as to invade Mexico. They certainly would’ve prior to the fall of USSR.",
    "username": "Danielnrg",
    "score": 1,
    "post_id": "121babb",
    "parent_id": "t1_jdl6la9"
  },
  {
    "id": "jdlcq7r",
    "date": "2023-03-25 06:20:54",
    "content": "> Part of my dad’s argument is that, among other things, it is not unreasonable for Russia to see the west getting cozy with Ukraine and potentially offering NATO membership, for Russia to say “no the fuck you don’t”.\n\nRussia had already completely blocked any chance Ukraine had to get into NATO though, in 2014 when they invaded and occupied Crimea, Donetsk, and Luhansk.  NATO will not allow any country to join that is involved in an outstanding territorial dispute, and since there was never any realistic chance Ukraine would formally accept those territorial losses, they were not eligible to join.\n \nIf the Russians agreed right this second to end the current war and withdraw to the 2015 borders, Ukraine would still not be eligible to join NATO.  Your father has, unfortunately, swallowed Russian propaganda talking points.  At least he's not claiming Ukraine is run by Nazis.",
    "username": "doc_daneeka",
    "score": 1,
    "post_id": "121babb",
    "parent_id": "t1_jdl9ghc"
  },
  {
    "id": "jdlcvd9",
    "date": "2023-03-25 06:22:46",
    "content": ">Russia tries to put missiles 20 miles from the US shore\n\nOr, Cuba could foresee an imminent invasion by the USA and begged Russia to send missiles.",
    "username": "Cerda_Sunyer",
    "score": 1,
    "post_id": "121babb",
    "parent_id": "t1_jdl9ghc"
  },
  {
    "id": "jdld4w8",
    "date": "2023-03-25 06:26:17",
    "content": "Ok. That gives me some interesting context for further discussions. \n\nIt’s not Russian propaganda to say that Ukraine is corrupt as shit though, right? I’ve seen many studies claiming they’re the 2nd most corrupt European nation, behind only Russia. Those studies are less visible since the war, but they are there. As recently as 2021. Interestingly, many of the outlets who reported regularly on how corrupt Ukraine is have stopped reporting regularly on how corrupt Ukraine is. \n\nI find it interesting that the entire western media has pivoted to “support Ukraine against Russia” like Ukraine are heroes or something. This isnt Britain holding out against the nazis here, Ukraine isn’t this bastion of freedom and democracy that were being led to believe. And I have a hard time arguing where Russia’s war against Ukraine fits into the national security interests of the United States.",
    "username": "Danielnrg",
    "score": 1,
    "post_id": "121babb",
    "parent_id": "t1_jdlcq7r"
  },
  {
    "id": "jdldnif",
    "date": "2023-03-25 06:33:26",
    "content": "> It’s not Russian propaganda to say that Ukraine is corrupt as shit though, right?\n\nOh, there's definitely a fuckton of corruption there, no doubt about that.  That's in no sense a justification for a war of aggression designed to annex a country and wipe it out as an ethnocultural entity though.  And make no mistake about it, as far as the Russian government and Putin's personal views on the subject go, Ukrainians don't exist, and they're just people too stubborn to admit they're actually Russians. Immediately after the war started, there was even a shockingly open editorial in RIA Novosti frankly explaining that this is what the technical definition of nazism is for this purpose, and that 'denazification' of Ukraine is effectively just re-educating the people there to understand that they are Russians. \n\nSo it doesn't matter that Ukraine is not some sort of beacon of democracy.  It's closer to that ideal that it used to be, and it's fighting for its national existence against a war of naked aggression, something that we literally hanged people for a Nuremberg.",
    "username": "doc_daneeka",
    "score": 1,
    "post_id": "121babb",
    "parent_id": "t1_jdld4w8"
  },
  {
    "id": "jdlj7hl",
    "date": "2023-03-25 07:53:02",
    "content": "To what extent should this be a US concern though? \n\nI know this is quite outside the extent of the question I asked, but this post doesn’t have a ton of comments and you seem pretty learned on the subject. \n\nI think most Americans, if you go by polling data, are starting to wonder the exact same thing i am. Why does this matter to us?",
    "username": "Danielnrg",
    "score": 1,
    "post_id": "121babb",
    "parent_id": "t1_jdldnif"
  },
  {
    "id": "jdljeum",
    "date": "2023-03-25 07:56:05",
    "content": "> To what extent should this be a US concern though?\n\nDepends.  How important do you consider it is to prevent a clear rival and adversary nation from conquering and annexing the second largest country in Europe?\n\nHow do you feel about, say, China helping North Korea roll south and conquer South Korea, or China invading Taiwan?  How about the Arab world uniting long enough to try again to conquer Israel?",
    "username": "doc_daneeka",
    "score": 2,
    "post_id": "121babb",
    "parent_id": "t1_jdlj7hl"
  },
  {
    "id": "jdl87ry",
    "date": "2023-03-25 05:23:07",
    "content": "Belarusians yes, the dictator and their friend not",
    "username": "DOGE_lunatic",
    "score": 21,
    "post_id": "121b7ds",
    "parent_id": "t3_121b7ds"
  },
  {
    "id": "jdlbeze",
    "date": "2023-03-25 06:03:17",
    "content": "Why don't you ask her? If that's a show stopper then you'll know right away. Belarusians themselves are blunt a bit so you should be a bit careful but I think that she'd understand the question and its intent.",
    "username": "openthatup",
    "score": 11,
    "post_id": "121b7ds",
    "parent_id": "t3_121b7ds"
  },
  {
    "id": "jdlkmp5",
    "date": "2023-03-25 08:14:32",
    "content": "I would bet she is young enough to not support the war",
    "username": "Pascuccii",
    "score": 4,
    "post_id": "121b7ds",
    "parent_id": "t3_121b7ds"
  },
  {
    "id": "jdlbjgn",
    "date": "2023-03-25 06:04:56",
    "content": "I’ve been using google translate to talk to her, since I can’t speak Belarusian, and her English isn’t the best.",
    "username": "Affectionate_Hand_59",
    "score": 2,
    "post_id": "121b7ds",
    "parent_id": "t3_121b7ds"
  },
  {
    "id": "jdl9vn1",
    "date": "2023-03-25 05:43:31",
    "content": "Depends, many people from Belarus actually support what is happening. But I assume that your girl is young enough to use the internet and knows some different languages except Russian to avoid propaganda, so most likely you should be good.",
    "username": "Individual-Ad-6634",
    "score": 1,
    "post_id": "121b7ds",
    "parent_id": "t3_121b7ds"
  },
  {
    "id": "jdlh02e",
    "date": "2023-03-25 07:20:16",
    "content": "I just don’t know what I should do because she’s really pretty and really nice and I don’t want to mess it up",
    "username": "Affectionate_Hand_59",
    "score": 1,
    "post_id": "121b7ds",
    "parent_id": "t3_121b7ds"
  },
  {
    "id": "jdl89qn",
    "date": "2023-03-25 05:23:47",
    "content": "Awesome",
    "username": "Affectionate_Hand_59",
    "score": 2,
    "post_id": "121b7ds",
    "parent_id": "t1_jdl87ry"
  },
  {
    "id": "jdlxhyo",
    "date": "2023-03-25 11:18:39",
    "content": "Age not matter",
    "username": "AbadonnaAbbys",
    "score": 3,
    "post_id": "121b7ds",
    "parent_id": "t1_jdlkmp5"
  },
  {
    "id": "jdm0d6j",
    "date": "2023-03-25 11:52:14",
    "content": "If she is comfortable communicating with a stranger in Belarussian, that itself can be seen as a political statement that she holds progressive views.",
    "username": "CatNinety",
    "score": 3,
    "post_id": "121b7ds",
    "parent_id": "t1_jdlbjgn"
  },
  {
    "id": "jdlbdpf",
    "date": "2023-03-25 06:02:49",
    "content": "She’s speaks some English Russian and german",
    "username": "Affectionate_Hand_59",
    "score": 2,
    "post_id": "121b7ds",
    "parent_id": "t1_jdl9vn1"
  },
  {
    "id": "jdm107m",
    "date": "2023-03-25 11:59:16",
    "content": "So what are you going to do, just not talk about anything you care about in case she doesn't agree? Just be proud to be yourself. If she likes you back, nice. If she not, well, you can't be someone else.  \n\n\nYou're on the other side of the world. Communication doesn't need to be intense. Not right now, anyway.",
    "username": "CatNinety",
    "score": 3,
    "post_id": "121b7ds",
    "parent_id": "t1_jdlh02e"
  },
  {
    "id": "jdlv2jy",
    "date": "2023-03-25 10:47:25",
    "content": "And yet the colonial pipeline was hacked because someone bought a password on the darknet. Thousands of companies were exposed by solarwinds who set \"solarwinds123\" as their password (unconfirmed if this is how they were breached), the president had \"MAGA202020!\" as his password...\n\nI am not convinced by this article",
    "username": "finite_turtles",
    "score": 1,
    "post_id": "121bpa3",
    "parent_id": "t3_121bpa3"
  },
  {
    "id": "jdlqmmy",
    "date": "2023-03-25 09:44:19",
    "content": ">-elemzés: oroszország elérte az [éves hiánycélt 2 hónap alatt](https://www.intellinews.com/russia-s-budget-deficit-hits-its-full-year-target-in-the-first-two-and-half-months-of-2023-273888)   \n\nA [felét](https://telex.hu/gazdasag/2023/03/24/elszallt-koltsegvetesi-hiany-bevetel-kiadas-penzugyminiszterium) háború nélkül is össze lehet hozni, csak vészhelyzeti kormányzás kell hozzá.",
    "username": "SonnyVabitch",
    "score": 16,
    "post_id": "121cfbr",
    "parent_id": "t3_121cfbr"
  },
  {
    "id": "jdlk18d",
    "date": "2023-03-25 08:05:35",
    "content": "Valaki felvilágosíthatná a prominens ruszki milbloggereket, hogy azért támadnak emberi hullámokkal, mert se tudás, se eszköz nincs másra.",
    "username": "rolika75",
    "score": 10,
    "post_id": "121cfbr",
    "parent_id": "t3_121cfbr"
  },
  {
    "id": "jdlark0",
    "date": "2023-03-25 05:54:48",
    "content": "kapcsolódik, az ICC körözés miatt    \nAusztria bejelentette, hogy letartóztatnák putyint ha odamenne  \na dél afrikai kormányzat jogi tanácsot kér, hogy le kell-e tartóztatniuk putyint, aki a BRICS megbeszélésre oda fog utazni",
    "username": "linkelek1",
    "score": 15,
    "post_id": "121cfbr",
    "parent_id": "t3_121cfbr"
  },
  {
    "id": "jdlaode",
    "date": "2023-03-25 05:53:40",
    "content": "reuters link: https://archive.ph/qcpiw",
    "username": "linkelek1",
    "score": 4,
    "post_id": "121cfbr",
    "parent_id": "t3_121cfbr"
  },
  {
    "id": "jdlkpti",
    "date": "2023-03-25 08:15:51",
    "content": "> -a frontot túlélt orosz katonáknak komoly PTSD-je van\n\nUkránoknak nincs ilyen, igaz? Ők pozitív jellemfejlődéssek térnek vissza a lövészárkokból?",
    "username": "Exit727",
    "score": -21,
    "post_id": "121cfbr",
    "parent_id": "t3_121cfbr"
  },
  {
    "id": "jdlv5oi",
    "date": "2023-03-25 10:48:39",
    "content": "![gif](giphy|llANeu88cEAsq8sDO9)\n\npróbálkozz magyarul. Sajnos nem beszélni angol.",
    "username": "politizalo_saci43",
    "score": -10,
    "post_id": "121cfbr",
    "parent_id": "t3_121cfbr"
  },
  {
    "id": "jdm3len",
    "date": "2023-03-25 12:26:36",
    "content": "De azért mi különösen tehetségesek vagyunk az ilyesmiben.",
    "username": "Effective-Station505",
    "score": 4,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlqmmy"
  },
  {
    "id": "jdld6c6",
    "date": "2023-03-25 06:26:50",
    "content": "Már gondolkodtam azon, mi a helyzet akkor ha csak az egyik dublőrét tartóztatják le valahol? Az igazi gyorsan nyilatkozik, hogy bocsi én itt vagyok Oo-ban, az a személy akit elkaptatok csak dublőr. Az ICC fel van erre készülve pl beszereztek DNS mintát?",
    "username": "Hopp-hopp",
    "score": 10,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlark0"
  },
  {
    "id": "jdluxos",
    "date": "2023-03-25 10:45:34",
    "content": "Ha rákattintanál (de nem teszed) ez lenne az első mondat /translated/:  \"Az ukrán háborús övezettel szomszédos orosz régiók lakói katonák agressziójára, bűnözésére és alkoholizmusára panaszkodnak.\" \n\nHogy jönnek az ukránok a linkelt cikkhez?\n\nEsetleg arra gondolsz hogy egy ilyen cikket csak akkor lehet linkelni ha az adott téma ukrán megfelelőjét is megkeresi és linkeli?\n\nEgyébként szerintem sokkal jobban bírják, mert:\n\n1., Honvédők\n\n2., A világ 99%-a mellettük van\n\n3., Nem kell bűnözőkkel, gyilkosokkal együtt harcolniuk\n\n4., Látják a jövőjüket. Ez a RF katonáira már biztosan nem igaz.",
    "username": "Low-Blueberry8192",
    "score": 9,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlkpti"
  },
  {
    "id": "jdlkz0g",
    "date": "2023-03-25 08:19:45",
    "content": "Honvédők. Ehhez mérten nyilvánulj meg róluk!",
    "username": "Hopp-hopp",
    "score": 6,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlkpti"
  },
  {
    "id": "jdm3l4q",
    "date": "2023-03-25 12:26:31",
    "content": "De az ukrán katonáknak is van, és van róla film is (szerintem nem propaganda, de Te majd eldöntöd):\n\n[https://www.youtube.com/watch?v=Kgcp2a-wnUE](https://www.youtube.com/watch?v=Kgcp2a-wnUE)\n\nÉs úgy általában minden frontot megjárt katonánál előjön (Irak, Afganisztán, Korea, Vietnám stb.):\n\n[https://www.youtube.com/results?search\\_query=soldier+ptsd](https://www.youtube.com/results?search_query=soldier+ptsd)",
    "username": "Maydayof",
    "score": 1,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlkpti"
  },
  {
    "id": "jdlxunz",
    "date": "2023-03-25 11:22:52",
    "content": "Soha nem keso elkezdeni tanulni",
    "username": "Eretnek",
    "score": 8,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlv5oi"
  },
  {
    "id": "jdle9t7",
    "date": "2023-03-25 06:42:00",
    "content": "a kreml szerintem nem meri nyilvánosan felválallni, hogy kamu putyinok tartottak nyilvános rendezvényeket  \nha az igazi putyin menekülni akar, akkor lehet, hogy valamelyik dublőrét olyan helyre küldi, ahol le tudják tartóztatni, vagy még inkább szervez neki egy balesetet/kivégzést",
    "username": "linkelek1",
    "score": 5,
    "post_id": "121cfbr",
    "parent_id": "t1_jdld6c6"
  },
  {
    "id": "jdlm206",
    "date": "2023-03-25 08:36:02",
    "content": "Ennek mi köze van ahhoz hogy bulvárcikkeket állít be jelentésként a frontról? Propagandát szeretnél olvasni vagy objektív beszámolókat?",
    "username": "Exit727",
    "score": -2,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlkz0g"
  },
  {
    "id": "jdm2cea",
    "date": "2023-03-25 12:13:41",
    "content": "![gif](giphy|GzmqhMZhT5eWmIZiuC|downsized)\n\nNincs rá időm. De szerencsére itt van nekem a Google.",
    "username": "politizalo_saci43",
    "score": -1,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlxunz"
  },
  {
    "id": "jdlf2k9",
    "date": "2023-03-25 06:52:56",
    "content": "Igen, logikus. Fontos, hogy vészhelyzetben a dublőr halála titokban maradhasson. Külföldön nem könnyű ezt biztosítani. Elképzelhető inkább nem utazik rizikós helyre.",
    "username": "Hopp-hopp",
    "score": 5,
    "post_id": "121cfbr",
    "parent_id": "t1_jdle9t7"
  },
  {
    "id": "jdll27u",
    "date": "2023-03-25 08:21:05",
    "content": "Az életét megmentheti így... egy időre. Ha élni akar, minimum egy arcplasztika kell még. Ellenben a hatalma elpárolog. Lehet hogy a hatalom erősebb drog számára mint az élet.. sajnos. Pedig sok életet menthetne meg ha a hatalmától megválna.",
    "username": "Low-Blueberry8192",
    "score": 2,
    "post_id": "121cfbr",
    "parent_id": "t1_jdle9t7"
  },
  {
    "id": "jdlupu0",
    "date": "2023-03-25 10:42:36",
    "content": "Amikor az afganisztáni, meg az iraki háborúból ki tudja hány turnus után hazatért amerikai katonáknál végre elkezdték komolyan venni a PTSD-t, akkor százezrével jelentek meg a cikkek - és jelennek meg a mai napig is - arról, hogy mekkora mentális teher van azokon, akik idegen országba mennek el háborúzni, és nem elsősorban azért, mert a háború szar (amúgy az), hanem mert a biztonságot jelentő otthoni szociális hálótól több ezer kilométerre kell az életét kockáztatnia egy olyan célért, amivel lehet, hogy egyébként abszolút nem ért egyet.\n\nAkkor hősnek kiáltották ki azokat a katonákat, akik a PTSD-jükkel küzdve mégis hasznos tagjaivá tudtak válni a társadalomnak, mert mekkora önfegyelmet igényel az, hogy a háború borzalmai után mégis felemelt fejjel tud pénztáros lenni egy Wallmartban.\n\nNa, ott hány olyan cikket olvastál, hogy szegény afgán, meg iraki katonák vajon szenvednek-e PTSD-től?  \nSehányat.\n\nSehányat, de nem azért, mert az afgán meg az iraki katonáknak nem volt, vagy ne lenne PTSD-je, hanem mert egyrészt egy vesztes háború után valahogy mégiscsak áldozatot kell csinálni a megszálló félből, hogy annyira szarul azért mégse nézzen ki a dolog, másrészt meg azért, mert mentálisan borzasztóan nagy különbség van aközött, hogy elmész parancsra gyerekeket a falhoz csapni, nőket erőszakolni, meg nyugdíjasokat kivégezni, meg aközött, hogy önszántadból próbálod ugyanezeket az embereket megvédeni, akár az életed árán is.",
    "username": "HelpDaren",
    "score": 7,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlm206"
  },
  {
    "id": "jdlu95o",
    "date": "2023-03-25 10:36:12",
    "content": "Objektíven honvédők.",
    "username": "Hopp-hopp",
    "score": 6,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlm206"
  },
  {
    "id": "jdlkhvs",
    "date": "2023-03-25 08:12:28",
    "content": "Tegnapi 24.hu hír az ICC-hez való maradéktalan csatlakozásunkhoz:  Parlament előtt a javaslat, amely lehetővé tenné Putyin letartóztatását Magyarországon",
    "username": "Hopp-hopp",
    "score": 2,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlf2k9"
  },
  {
    "id": "jdm1orq",
    "date": "2023-03-25 12:06:37",
    "content": ">mert a **biztonságot jelentő otthoni szociális hálótól** több ezer kilométerre kell az életét kockáztatnia egy olyan célért, amivel lehet, hogy egyébként abszolút nem ért egyet.\n\nSzerencsére minket ez a veszély nem fenyegetne egy esetleges háború esetén.",
    "username": "fingusz",
    "score": 3,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlupu0"
  },
  {
    "id": "jdlzx19",
    "date": "2023-03-25 11:47:16",
    "content": "És?\n\nKapják ők az ukrán propagandát, tartsa bennük a lelket. De itt mi harmadik félként híreket akarunk olvasni róluk nem bulvárt. Amúgy is gyávaság lenne elhallgatni, milyen árat fizetnek a hazájuk védelméért. Ez egy háború, emberek ölnek, halnak, és traumatizálódnak.",
    "username": "Exit727",
    "score": -7,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlu95o"
  },
  {
    "id": "jdm8ix2",
    "date": "2023-03-25 13:13:26",
    "content": "Bocs, de ki mondta, hogy itt független híreket olvasol? Ha nem tetszik amit az OP összehoz, akkor keresd ki magadnak a  szerinted független híreket...",
    "username": "Sufficient_Beach_653",
    "score": 3,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlzx19"
  },
  {
    "id": "jdm10q2",
    "date": "2023-03-25 11:59:26",
    "content": "Nézz feljebb a kommentfolyamon válaszért. Bőven elegendő bárkinek.",
    "username": "Hopp-hopp",
    "score": 2,
    "post_id": "121cfbr",
    "parent_id": "t1_jdlzx19"
  },
  {
    "id": "jdlbqq2",
    "date": "2023-03-25 06:07:30",
    "content": "The press release has a favored side though.\n\nhttps://twitter.com/KGBreeB/status/1636457658738679821",
    "username": "Chicken_Crotch_Pie",
    "score": 2,
    "post_id": "121clud",
    "parent_id": "t3_121clud"
  },
  {
    "id": "jdlgvt0",
    "date": "2023-03-25 07:18:32",
    "content": "WION, being an Indian tabloid, has to hype up Ruzzian weapons since India has spent billions buying everything from Sukhois to S400s to aircraft carrier. OFC the Indian public doesn't want to hear that their govt just bought garbage.\n\nAs for Ruzzia's so-called hypersonic missile - it's just a 1980's ballistic missile being shot from a plane at elevation. Here is an actual explanation [Debunking Ruzzia's Hypersonic missile](https://youtube.com/shorts/I7EXGOTJ7UA?feature=share)\n\nWION, CRUX, Hindustan Time - all trash outlets that go hard supporting Ruzzia. US and the Western allies should seriously re-think India's inclusion in the QUAD or any Western alliances, since they are the least reliable partner.",
    "username": "Zumokoto77",
    "score": 3,
    "post_id": "121dihz",
    "parent_id": "t3_121dihz"
  },
  {
    "id": "jdlgw44",
    "date": "2023-03-25 07:18:40",
    "content": "Haha the US can't even look after their own banks! Oh well, just stomp in and cause more trouble!",
    "username": "spitz81",
    "score": 3,
    "post_id": "121dxml",
    "parent_id": "t3_121dxml"
  },
  {
    "id": "jdlultq",
    "date": "2023-03-25 10:41:04",
    "content": "While this is outside of the one year rule...it's also still well into the realm of what's \"known\" is so hazy, so educated guesses and inferences.  Like the sheer number of alleged Russian sabotage/assassination groups captured/killed/foiled begs a lot of questions we haven't gotten good answers for, like is this  a large effort that's failing badly, or is this classic paranoid \"they're everywhere!\" reporting.\n\nWe don't know at this point, and likely won't know for some time, or ever (Russia is unlikely to report the breadth of its clandestine operations, Ukraine is unlikely to give an entirely truthful account of their counter-intelligence/internal security actions)",
    "username": "pnzsaurkrautwerfer",
    "score": 3,
    "post_id": "121dqgn",
    "parent_id": "t3_121dqgn"
  },
  {
    "id": "jdm6qg9",
    "date": "2023-03-25 12:57:02",
    "content": "Nothing.\n\nNothing at all.\n\nThe GRU and FSB's failures are on the same epic proportion as the West failure to predict Hitler's attack in 1940 or the Vietnamese failure to see 600,000 Chinese rolling up the border to sneak attack them in 1979.\n\nAt the very basic level (and the only one I will talk about since this is the one we have the best information on,) their job is to provide Russia high command with detailed information on the Ukrainian military, state of preparedness, etc. And they are very well placed to do so: [the Ukrainian GUR and SBU were crawling with Russian spies](https://www.theguardian.com/world/2023/jan/26/ukrainian-security-service-needs-cleanout-after-arrest-of-accused-spy) and the [Russians managed to spread moles across Ukraine.](https://www.reuters.com/investigates/special-report/ukraine-crisis-russia-saboteurs/) This is due to the fact a/Ukrainian intelligence agencies had strong ties with Russian owing to Soviet era cooperation and later owing to the pro-Russian government and b/there is a large chunk of Russian-speakers in Ukraine who willingly act as fifth-columnists.\n\nAnd they bloody failed.\n\nI don't know what they fed Putin but I am sure they fed him wrong information because oh boy the Russian underestimated the Ukrainian severely. If them attacking the way larger, way better prepared, way better motivated with an inadequate force was not damning enough, then here is an article on the government official newspaper RIA-Novosti claiming victory [on Feb 26th 2022](https://web.archive.org/web/20220226153051/https://ria.ru/20220226/rossiya-1775162336.html).",
    "username": "Puzzleheaded_Scar333",
    "score": 1,
    "post_id": "121dqgn",
    "parent_id": "t3_121dqgn"
  },
  {
    "id": "jdli0h4",
    "date": "2023-03-25 07:35:13",
    "content": "Not to mention that the Kiev regime was responsible for ethnic cleansing on a major scale.\n\nBut the loan package will be split between the goons in Kiev and the 'rebuilding' companies in America, just as happened in Iraq.",
    "username": "panbert",
    "score": 1,
    "post_id": "121e8w6",
    "parent_id": "t3_121e8w6"
  },
  {
    "id": "jdlmgya",
    "date": "2023-03-25 08:42:22",
    "content": "oBviOusLy tHiS iS PuTiN pRopAgANdA!!!",
    "username": "falllinemaniac",
    "score": 7,
    "post_id": "121ectr",
    "parent_id": "t3_121ectr"
  },
  {
    "id": "jdls325",
    "date": "2023-03-25 10:05:30",
    "content": "Reality is Russian biased!",
    "username": "proudfootz",
    "score": 3,
    "post_id": "121ectr",
    "parent_id": "t1_jdlmgya"
  },
  {
    "id": "jdm12ny",
    "date": "2023-03-25 12:00:02",
    "content": "Putin had an agent go back with his time machine to publish this story!",
    "username": "falllinemaniac",
    "score": 2,
    "post_id": "121ectr",
    "parent_id": "t1_jdls325"
  },
  {
    "id": "jdm1dyw",
    "date": "2023-03-25 12:03:25",
    "content": "That is the most rational explanation.",
    "username": "proudfootz",
    "score": 1,
    "post_id": "121ectr",
    "parent_id": "t1_jdm12ny"
  },
  {
    "id": "jdltuyv",
    "date": "2023-03-25 10:30:42",
    "content": "Ya fuck that.  We came, we saw, let's get the fucks outta here.",
    "username": "3woodx",
    "score": 1,
    "post_id": "121etnd",
    "parent_id": "t3_121etnd"
  },
  {
    "id": "jdm6ln4",
    "date": "2023-03-25 12:55:47",
    "content": "Watching their fellow ass-clowns getting constantly lit the bleep up!",
    "username": "StakedCryptoWarrior",
    "score": 1,
    "post_id": "121etnd",
    "parent_id": "t3_121etnd"
  },
  {
    "id": "jdln8je",
    "date": "2023-03-25 08:53:59",
    "content": "More on this subject from other reputable sources:\n\n---\n- Malaysiakini (C+): [New Zealand raises concerns with China on South China Sea, Taiwan](https://www.malaysiakini.com/world/659948)\n- Reuters (A+): [New Zealand raises concerns with China on South China Sea, Taiwan](https://www.reuters.com/world/asia-pacific/new-zealand-raises-concerns-with-china-south-china-sea-taiwan-2023-03-25/)\n- Radio New Zealand (C-): [China's top diplomat: Confident about ties with New Zealand](https://www.rnz.co.nz/news/world/486672/china-s-top-diplomat-confident-about-ties-with-new-zealand)\n- Alarabiya (C-): [New Zealand raises concerns with China on South China Sea, Taiwan ](https://english.alarabiya.net/News/world/2023/03/25/New-Zealand-raises-concerns-with-China-on-South-China-Sea-Taiwan-)\n\n---\n[__Extended Summary__](https://www.reddit.com/r/newswall/comments/121fxrn/) | [More: New Zealand raises ...](https://www.newswall.org/story/nz-raises-concerns-with-china-on-south-china-sea-taiwan) | [FAQ & Grades](https://www.reddit.com/r/newswall/comments/uxgfm5/faq_newswall_bot/) | I'm a bot",
    "username": "newswall-org",
    "score": 1,
    "post_id": "121f3v6",
    "parent_id": "t3_121f3v6"
  },
  {
    "id": "jdlknw2",
    "date": "2023-03-25 08:15:02",
    "content": "DNIPRO, Ukraine—One Ukrainian paid almost $10,000 to flee the draft. Another has ignored five military summonses. A third avoids public spaces, fearing a military official will pounce and issue a call-up.  \nAfter a year of war, Ukraine is facing increasing challenges in raising the troops it needs to resist Russian forces and eject them from its territory.  \nWhen Russia invaded in February last year, thousands of volunteers lined up outside military recruitment centers. With many of them now dead or injured, Ukrainian authorities are scrambling to recruit replacements, often drafting those who have neither the desire nor the training to serve. The result is a growing number of fighting-age men who are attempting to evade service.\n\nSo far, Ukraine has managed to replenish its ranks regularly, and has largely succeeded in holding back a monthslong Russian onslaught in the east as it awaits an influx of tens of thousands of fresh troops, many of them trained in the West, to drive its planned spring offensive.\n\nBut while polls show that support for the defense effort remains high, the stock of willing volunteers now appears to be dwindling. Ukraine’s population is less than one-third the size of Russia’s, not accounting for the exodus of millions since the war began, and the kind of coercion used in Russia’s authoritarian system isn’t an option, Kyiv says.\n\n“We can’t do as Russia does and drive people to war with batons,” President Volodymyr Zelensky told reporters in February, three days after he renewed a decree on mobilization that makes reservists and most healthy men of fighting age eligible for call-up, in place since the war started. He said evasion of military service was a serious issue for Ukraine.\n\nThe war has ravaged the professional armies of both Ukraine and Russia. Moscow responded last September with a mobilization of more than 300,000 men, and President Vladimir Putin has told Russians to prepare for a protracted war.  \nUkraine had a standing army of 260,000 when Russia invaded, and around 100,000 have been killed or wounded since then, according to Western estimates. The military banked until recently on patriotic fervor to swell those ranks. TV ads call on people to sign up and “defend what’s yours,” and billboards promote the Interior Ministry’s new Offensive Guard, with brigades named Anger and Spartan, and slogans urging reservists and experienced troops to “turn your rage into firepower.”  \nAlongside the recruitment campaigns, Ukraine is increasingly relying on enlistment officers in military uniform handing out summonses in public spaces. The Security Service of Ukraine, the country’s domestic security and intelligence agency, said this month that it had closed down 26 Telegram channels that had been posting the locations and times where they were active.",
    "username": "Eric-VII-Immortel",
    "score": 1,
    "post_id": "121f2xk",
    "parent_id": "t3_121f2xk"
  },
  {
    "id": "jdlkekf",
    "date": "2023-03-25 08:11:04",
    "content": "L'article est payant ...",
    "username": "Segel_le_vrai",
    "score": 1,
    "post_id": "121f2xk",
    "parent_id": "t3_121f2xk"
  },
  {
    "id": "jdlkh1j",
    "date": "2023-03-25 08:12:07",
    "content": "Désolé…Je vais essayer de vous le donner autrement.",
    "username": "Eric-VII-Immortel",
    "score": 2,
    "post_id": "121f2xk",
    "parent_id": "t1_jdlkekf"
  },
  {
    "id": "jdlkihi",
    "date": "2023-03-25 08:12:43",
    "content": "Non. En tant que « reddit readers » vous pouvez le lire.",
    "username": "Eric-VII-Immortel",
    "score": 2,
    "post_id": "121f2xk",
    "parent_id": "t1_jdlkekf"
  },
  {
    "id": "jdlmqzq",
    "date": "2023-03-25 08:46:37",
    "content": "I feel like more people should make criticisms based on incompetence or failures. You can be generally supportive of NATO's overall purpose while recognizing that various campaigns or missions could have been handled better -- [to put it mildly.](https://apnews.com/article/9532e62d78904daa9c97983a37f40751) You can be a \"little bit critical\" here, y'know? You don't need to commit yourself to a partisan position just because there's too many Kremlin propagandists scurrying about.",
    "username": "Splemndid",
    "score": 6,
    "post_id": "121ezkc",
    "parent_id": "t3_121ezkc"
  },
  {
    "id": "jdm2vfi",
    "date": "2023-03-25 12:19:09",
    "content": "I think most people just didn't understand or care about NATO before the global internet and the current situation in Ukraine made them salient. Unless you were really into politics and foreign policy, They were a vague alliance of states that \"kept peace\". The Kosovo bombing was before the internet really took off, and at least for Americans was just another irrelevant far-off conflict they could shrug off. This is by far the most amount of light and scrutiny that has been placed upon NATO in their history, and the world at large is learning about them in real-time (and also inevitably being misled at the same time)",
    "username": "Ok_Librarian2474",
    "score": 2,
    "post_id": "121ezkc",
    "parent_id": "t3_121ezkc"
  },
  {
    "id": "jdlp0bc",
    "date": "2023-03-25 09:20:40",
    "content": "Somewhat missing the point that people can be critical at a level above simple competency assessments. The meat of the discourse about NATO criticism is whether or not NATO is an american trojan horse designed to create a state of dependency on the USA for its members and force them to align themselves with american foreign interests.",
    "username": "SegSignal",
    "score": 1,
    "post_id": "121ezkc",
    "parent_id": "t1_jdlmqzq"
  },
  {
    "id": "jdlp70y",
    "date": "2023-03-25 09:23:22",
    "content": "On the point of military organizations committing senseless tragedies; in my view there has been a shift in the post-industrialized world were we will no longer simply allow these types of events to occur unpunished. \n\nTo all the crazy shit that happened in Iraq, Afghanistan, and Kuwait, you aren't going to find the absolutely horrendous, unnecessary use of force that were found in Vietnam and every war before.",
    "username": "BrandonTheFish",
    "score": 0,
    "post_id": "121ezkc",
    "parent_id": "t1_jdlmqzq"
  },
  {
    "id": "jdllouy",
    "date": "2023-03-25 08:30:29",
    "content": "I mean thats not really a lefty thing. In general, civilian casualties are worse than combatant casualties, though i do sincerely feel bad for both russian and ukrainian conscripts who got dragged out of their lifes in order to fight",
    "username": "wallmartwarrior",
    "score": 7,
    "post_id": "121f9i7",
    "parent_id": "t3_121f9i7"
  },
  {
    "id": "jdlpmh7",
    "date": "2023-03-25 09:29:42",
    "content": "It is our responsibility to keep r/Ukraine focused on important or vital information and high-effort content. As a temporary measure, speculation / supportive ideas / low effort content / opinions will be removed. Please do not send us angry modmails or DMs if we decide to remove your post. This will not result in restoring your post.\n\n[Feel free to browse our rules, here.](https://www.reddit.com/r/ukraine/about/rules)",
    "username": "ukraine-ModTeam",
    "score": 1,
    "post_id": "121g6rg",
    "parent_id": "t3_121g6rg"
  },
  {
    "id": "jdloxm6",
    "date": "2023-03-25 09:19:33",
    "content": "# ruSSianfascism",
    "username": "DoriN1987",
    "score": 4,
    "post_id": "121g6rg",
    "parent_id": "t3_121g6rg"
  },
  {
    "id": "jdlp87m",
    "date": "2023-03-25 09:23:49",
    "content": "That Europe though that ruSSia could become a trustable partner is beyond my understanding.\n\nThis \"country\" only knows violence.",
    "username": "TimelyAstronomer6494",
    "score": 4,
    "post_id": "121g6rg",
    "parent_id": "t3_121g6rg"
  },
  {
    "id": "jdlosw9",
    "date": "2023-03-25 09:17:35",
    "content": "Is this an **insane**, **not insane** or **fake** submission? \nPlease reply to this comment with either `insane`, `not insane` or `fake`. We encourage everyone to vote because posts are taken down by these votes so it is important the community voices their opinion, accurately. If you reply **anywhere else** in the thread, your vote will **not** be counted.\n\n^P.S. ^If ^you ^believe ^this ^post ^is ^fake, *^do ^not* ^call ^it ^out ^in ^the ^comments. ^Send ^us ^a ^modmail ^with ^any ^proof ^you ^have.\n\n#Votes \n\n| Insane | Not insane | Fake |\n| --- | --- | --- |\n| 1 | 0 | 0 |\n\nHey OP, if you provide further information in a comment, make sure to start your comment with `!explanation`. \n\n^I ^am ^a ^bot ^for ^r/insaneparents. ^Please ^send ^me ^a ^message ^if ^you ^have ^any ^feedback ^or ^if ^I ^misbehave. ^Also ^consider ^joining ^our ^[Discord](https://discordapp.com/invite/xFbPBHy).",
    "username": "Dad_B0T",
    "score": 1,
    "post_id": "121gdka",
    "parent_id": "t3_121gdka"
  },
  {
    "id": "jdludaw",
    "date": "2023-03-25 10:37:48",
    "content": "Of course it’s not a coincidence when you make it up as it’s happening. \n\nI predict it’s going to still be winter and the temperature in the negatives, where I live. \n\nHOLY SHIT. I PREDICTED IT.",
    "username": "PsychoMouse",
    "score": 4,
    "post_id": "121gdka",
    "parent_id": "t3_121gdka"
  },
  {
    "id": "jdm316w",
    "date": "2023-03-25 12:20:50",
    "content": "I wouldn’t call this a full blown insane, but i would call it silly, the Russo-Ukrainian war has been going in since 2014, ever since the annexation of Crimea, predicting it at that time (pre February) may have been something, but not right when the buildup for the “special military operation” happens",
    "username": "MrEpicWeewee",
    "score": 5,
    "post_id": "121gdka",
    "parent_id": "t3_121gdka"
  },
  {
    "id": "jdltjlj",
    "date": "2023-03-25 10:26:07",
    "content": "I'm curious. At which point did she predict the war, before it was glaringly obvious or after?",
    "username": "Intrepid-Dig-1855",
    "score": 3,
    "post_id": "121gdka",
    "parent_id": "t3_121gdka"
  },
  {
    "id": "jdlx6mn",
    "date": "2023-03-25 11:14:51",
    "content": "Everyone knew it was gonna hapen sooner or later haha",
    "username": "FrostedDonuTrap",
    "score": 2,
    "post_id": "121gdka",
    "parent_id": "t3_121gdka"
  },
  {
    "id": "jdmgiug",
    "date": "2023-03-25 14:20:15",
    "content": "A year ago I had a dream that on march 25th 2023 the sky would be blue. Nobody listened to me. This is not a coincidence",
    "username": "RoastedHunter",
    "score": 1,
    "post_id": "121gdka",
    "parent_id": "t3_121gdka"
  },
  {
    "id": "jdm0ypl",
    "date": "2023-03-25 11:58:47",
    "content": "How'd she dream it exactly? Because predictive dreams are more like riddles and not so specific. Because its a reflection of your mind when its in a controless state, not a magic crystal like in The Labyrinth.",
    "username": "XxChickenTender69xX",
    "score": 1,
    "post_id": "121gdka",
    "parent_id": "t3_121gdka"
  },
  {
    "id": "jdm4pnr",
    "date": "2023-03-25 12:37:46",
    "content": "I don’t know, believing you had a dream that predicted something after it was already obvious doesn’t sound just “silly” to me.  At a minimum, she appears to be blessed with a confidence in her convictions that far surpasses her intellect or education.",
    "username": "charlestoonie",
    "score": 2,
    "post_id": "121gdka",
    "parent_id": "t1_jdm316w"
  },
  {
    "id": "jdltphw",
    "date": "2023-03-25 10:28:31",
    "content": "She predicted it when it was glaringly obvious, and started boasting about it afterwards because she was right. \n\nShe also only came up with the china-russia thing after that was \"announced\"",
    "username": "NeonMoth7076",
    "score": 3,
    "post_id": "121gdka",
    "parent_id": "t1_jdltjlj"
  },
  {
    "id": "jdm4srg",
    "date": "2023-03-25 12:38:37",
    "content": "She says her (passed on) mother came to her in a dream and told her there was going to be a world war and Russia was gonna start it lol",
    "username": "NeonMoth7076",
    "score": 1,
    "post_id": "121gdka",
    "parent_id": "t1_jdm0ypl"
  },
  {
    "id": "jdlzj2x",
    "date": "2023-03-25 11:42:41",
    "content": "I sympathize truly, for having a mother who takes glee off the back of what is a horrific war for all involved.",
    "username": "Intrepid-Dig-1855",
    "score": 3,
    "post_id": "121gdka",
    "parent_id": "t1_jdltphw"
  },
  {
    "id": "jdlx75k",
    "date": "2023-03-25 11:15:00",
    "content": "Of course it has nothing to do with NATO. That’s just an excuse. Russians are Russians- they are always killing, invading, rapping, torturing, imprisoning etc. They don’t like NATO simply because it gets in their way of doing all of that.",
    "username": "Frosty_Key4233",
    "score": 10,
    "post_id": "121gbjf",
    "parent_id": "t3_121gbjf"
  },
  {
    "id": "jdm41pn",
    "date": "2023-03-25 12:31:14",
    "content": "The more you read history the more you will understand that this title is not emotionally or propaganda. This is business as usual for Russian rejects",
    "username": "Tiptoeplease",
    "score": 4,
    "post_id": "121gbjf",
    "parent_id": "t3_121gbjf"
  },
  {
    "id": "jdm46ue",
    "date": "2023-03-25 12:32:39",
    "content": "Finally, the elephant in the room is being discussed openly. The world has been de-colonizing, on the ground and in the mindset, since the 1940s. But the Russians have missed that boat. They are still living in the 19th century age of empires. It's about time to stop tiptoeing  around that. They need to be openly challenged on the behavior of their country and not given a pass, \"Well, that's just Russia\".",
    "username": "Practical-Ordinary-6",
    "score": 4,
    "post_id": "121gbjf",
    "parent_id": "t3_121gbjf"
  },
  {
    "id": "jdlu1h3",
    "date": "2023-03-25 10:33:15",
    "content": "Rape, torture, loot, murder,kidnap....in short \" Ruskij mir\".",
    "username": "Imperfect_Mila",
    "score": 4,
    "post_id": "121gbjf",
    "parent_id": "t3_121gbjf"
  },
  {
    "id": "jdmg0yq",
    "date": "2023-03-25 14:16:21",
    "content": "That chart is weird. 1945 against Japan? Number 13 should be South Korea, helping the North to do so. Not sure about Bangladesh in 1975 or Angola in 1975, those seem like odd examples to include. But there are of course several that would be just fine being on the list like Finland in 1939, Romania in 1939, Ukraine in 2022 and 2014 obviously, and more.",
    "username": "Awesomeuser90",
    "score": 1,
    "post_id": "121gbjf",
    "parent_id": "t3_121gbjf"
  },
  {
    "id": "jdlta4p",
    "date": "2023-03-25 10:22:31",
    "content": "I would love for the Wagner gals and “tough guy” Russians to spend a few days in Mexico.  See how that shit really goes.  \n\nWould take less than a week for any of the cartels to undress Wagner.  It gets a little rougher the further West you go Russia.  Them boys will eat you whole, halfed, or quartered",
    "username": "AcanthocephalaNo2926",
    "score": 2,
    "post_id": "121gbjf",
    "parent_id": "t3_121gbjf"
  },
  {
    "id": "jdm49tk",
    "date": "2023-03-25 12:33:29",
    "content": "1945 Japan. \n\nlol.",
    "username": "TimaeGer",
    "score": 1,
    "post_id": "121gbjf",
    "parent_id": "t3_121gbjf"
  },
  {
    "id": "jdmhs7a",
    "date": "2023-03-25 14:30:02",
    "content": "There's this weird drive when hating on something online to make every aspect and every moment of a person/country/thing bad. Like people are incapable of nuance. Ukraine was a part of the nation this narrative paints.",
    "username": "JohnLaw1717",
    "score": 1,
    "post_id": "121gbjf",
    "parent_id": "t1_jdmg0yq"
  },
  {
    "id": "jdm0sg3",
    "date": "2023-03-25 11:56:54",
    "content": "Some sicarios are true psychopaths. You have to be a monster of a human to try and out do isis. Just for street cred and not even to your enemies just civilians",
    "username": "Dapper_Target1504",
    "score": 3,
    "post_id": "121gbjf",
    "parent_id": "t1_jdlta4p"
  },
  {
    "id": "jdloynj",
    "date": "2023-03-25 09:19:59",
    "content": "tbf the strategy was originally designed against the USSR and it's better safe and redunant than sorry and \"less defeatist\".",
    "username": "Repulsive-Cheetah-56",
    "score": 91,
    "post_id": "121gb28",
    "parent_id": "t3_121gb28"
  },
  {
    "id": "jdlovz0",
    "date": "2023-03-25 09:18:53",
    "content": "Its better too have roadbases and not need them than too need them and not have them adjust accordingly",
    "username": "FindusSomKatten",
    "score": 67,
    "post_id": "121gb28",
    "parent_id": "t3_121gb28"
  },
  {
    "id": "jdlqxk4",
    "date": "2023-03-25 09:48:56",
    "content": "That concept was implemented when people still viewed the Russians as somewhat competent",
    "username": "Borki88",
    "score": 31,
    "post_id": "121gb28",
    "parent_id": "t3_121gb28"
  },
  {
    "id": "jdlr82d",
    "date": "2023-03-25 09:53:04",
    "content": "Actually it proves they were correct. Ukraine has been using roads as runways a lot during the war to protect their planes and assets.",
    "username": "Muffin_Magi",
    "score": 34,
    "post_id": "121gb28",
    "parent_id": "t3_121gb28"
  },
  {
    "id": "jdlsdn7",
    "date": "2023-03-25 10:09:40",
    "content": "Just saying - if enemy fire on your airbases was such a big concern, maybe you shouldn't have picked the smaller Gripen that had 1/3rd the range of the competing F-15?",
    "username": "HaaEffGee",
    "score": 0,
    "post_id": "121gb28",
    "parent_id": "t3_121gb28"
  },
  {
    "id": "jdlwm2i",
    "date": "2023-03-25 11:07:42",
    "content": "Also, it was supposed to be a deterrent. It was more important how the Soviets thought a war would play out, rather than how it would actually play out.",
    "username": "euteron",
    "score": 46,
    "post_id": "121gb28",
    "parent_id": "t1_jdloynj"
  },
  {
    "id": "jdlt8z3",
    "date": "2023-03-25 10:22:03",
    "content": "> \"less defeatist\".\n\nAnything less than hyper offensive tactics is defeatist these days smh",
    "username": "gleamedangel",
    "score": 18,
    "post_id": "121gb28",
    "parent_id": "t1_jdloynj"
  },
  {
    "id": "jdlp8lc",
    "date": "2023-03-25 09:23:58",
    "content": "True, plus the Russian weren't exactly cheap on the number of Cruise Missiles they've used on the 24th of Feb.",
    "username": "gentsuba",
    "score": 30,
    "post_id": "121gb28",
    "parent_id": "t1_jdlovz0"
  },
  {
    "id": "jdlt6v0",
    "date": "2023-03-25 10:21:15",
    "content": "> Its better too have roadbases and not need them than too need them and not have them adjust accordingly\n\nYeah, better safe than sorry",
    "username": "gleamedangel",
    "score": 5,
    "post_id": "121gb28",
    "parent_id": "t1_jdlovz0"
  },
  {
    "id": "jdlwl5k",
    "date": "2023-03-25 11:07:22",
    "content": "Well back then they were still the Soviets. Double the population, at least double the share of GDP (yes they technically didn't use that metric but w/e) on defense, they still had ~~their *totally willing* cannon fodder~~ the Warsaw Pact, and their economy and MIC were still intact if stagnating and inefficient. \n\nSay what you will about the USSR and its economy, but they at least could produce thousands of tanks per year along with thousands of IFV and other armored vehicles. They even for a brief period had the edge in designs (1960s they were ahead with smoothbore guns and composite armor; compare the base Leo1 to T-64). Now they'd stagnate, but at least they were able to come up with functioning, realistic designs that even had new innovations and technology from time to time. Of course once the electronics revolution happened it was all downhill but at least they could do *something* right. \n\nRussia on the other hand...well I'm sure the T-14 will be mass produced any day now...",
    "username": "God_Given_Talent",
    "score": 21,
    "post_id": "121gb28",
    "parent_id": "t1_jdlqxk4"
  },
  {
    "id": "jdm2kh6",
    "date": "2023-03-25 12:16:01",
    "content": "That concept was implemented when people still viewed the Russians as somewhat competent - but not with the Gripen. The Swedes already started using it with the Viggen, but the development of the Gripen took nearly two decades. By the time it was adopted in the late 90s, there was little doubt about which side owned the skies.\n\nNow being a domestically produced fighter program that they were pretty far into, honestly it made sense that they continued the program after the USSR collapsed.\n\nBut the dispersed airbases idea was long dead by that point. The 90s was the age of Desert Storm, it showed that we could achieve SEAD and sustained bombing campaigns from three countries over. Fuel tanks were winning wars.",
    "username": "HaaEffGee",
    "score": 2,
    "post_id": "121gb28",
    "parent_id": "t1_jdlqxk4"
  },
  {
    "id": "jdlrwsw",
    "date": "2023-03-25 10:03:01",
    "content": "Actually Ukraine is operating mostly from airbases.",
    "username": "221missile",
    "score": 0,
    "post_id": "121gb28",
    "parent_id": "t1_jdlr82d"
  },
  {
    "id": "jdlwulw",
    "date": "2023-03-25 11:10:39",
    "content": "The Gripen was picked before the range was known. It was designed to have the range the air force asked for.",
    "username": "euteron",
    "score": 8,
    "post_id": "121gb28",
    "parent_id": "t1_jdlsdn7"
  },
  {
    "id": "jdmbexp",
    "date": "2023-03-25 13:38:40",
    "content": "The Swedish air force is intended for a purely defensive role, requiring a range that maybe extends to the borders of Finland, Norway and Denmark. At its adoption Sweden didn't have a huge stack of defensive treaties with all of Western Europe and would need to fight the war in Sweden. the F-15 is a great fighter, but not for the very specific conditions of Sweden. A small, easily maintained and cheap to use fighter/interceptor was the ask and it was exactly what was delivered.",
    "username": "Raket0st",
    "score": 3,
    "post_id": "121gb28",
    "parent_id": "t1_jdlsdn7"
  },
  {
    "id": "jdlwqb9",
    "date": "2023-03-25 11:09:12",
    "content": "PERUN powerpoints kicks. But yes. In reality a cessna could've delivered a nuclear bomb straight into the kremlin starting somewhere in Finland lol.",
    "username": "Repulsive-Cheetah-56",
    "score": 26,
    "post_id": "121gb28",
    "parent_id": "t1_jdlwm2i"
  },
  {
    "id": "jdmfr0u",
    "date": "2023-03-25 14:14:11",
    "content": "“Even if you win your fucked”",
    "username": "Redscooters",
    "score": 1,
    "post_id": "121gb28",
    "parent_id": "t1_jdlwm2i"
  },
  {
    "id": "jdltihz",
    "date": "2023-03-25 10:25:41",
    "content": "... time for nuclear first strike capabilities for everyone.",
    "username": "Repulsive-Cheetah-56",
    "score": 3,
    "post_id": "121gb28",
    "parent_id": "t1_jdlt8z3"
  },
  {
    "id": "jdlufss",
    "date": "2023-03-25 10:38:47",
    "content": "Early on they were forced to use a lot of roads. While they have now returned to use bases they still use roads from time to time.",
    "username": "Muffin_Magi",
    "score": 21,
    "post_id": "121gb28",
    "parent_id": "t1_jdlrwsw"
  },
  {
    "id": "jdm5f0n",
    "date": "2023-03-25 12:44:36",
    "content": "Yes, they requested a small fighter with a shorter range. That is exactly what I was pointing at?\n\nThis wasn't the 60s, they were stuck to their idea of distributed runways which worked for the Viggen. They failed to see how revolutionary range had become to the air war. If you are adopting a multi-role fighter in the late 90s, and you can't do aerial refuelling, then you are not ready for that new war.\n\nDistributed runways were not how you get SEAD. As the Swedes themselves had noticed at that time, because they scrapped the basing system before the Gripen was even fully delivered. This was the age of sustained sorties from three countries over.",
    "username": "HaaEffGee",
    "score": -1,
    "post_id": "121gb28",
    "parent_id": "t1_jdlwulw"
  },
  {
    "id": "jdmg8i1",
    "date": "2023-03-25 14:17:58",
    "content": "Having your fleet consist of smaller fighters is definitely a solid idea - most European countries do it. After all Sweden is not exactly preparing for two mayor wars on different continents.\n\n^((At least I hope so, I have met some Swedish soldiers. The nice-but-also-a-viking-with-a-machinegun vibes they gave off did not feel like people I want to go up against))\n\nBut the idea that their air fleet is going to gain the upper hand by spreading out to a handful of pre-prepared roads is not going to fly in this age. You need to stay out of range of the enemy and clear your way forward. If Russia invades today, the Swedes are going to pull their air fleet way way back to where they are safe, and slowly chip away at the enemy from there.\n\nThat's why they also have tankers and AWACS systems, that is why they have been training with NATO and with their neighbours since forever. Hell, they literally just announced that they are joining their air forces together with those Scandinavian neighbours.\n\nThey need that large net around them to work in - you are not holding out in the world of BVR combat when no place in your country is more than 150 km from the edge of that net. An enemy AWACS will have directed a missile at you before your landing gear is up.",
    "username": "HaaEffGee",
    "score": 1,
    "post_id": "121gb28",
    "parent_id": "t1_jdmbexp"
  },
  {
    "id": "jdm9d1l",
    "date": "2023-03-25 13:20:54",
    "content": "Wouldn't be hard to hit St. Petersburg from there.",
    "username": "Minamoto_Keitaro",
    "score": 4,
    "post_id": "121gb28",
    "parent_id": "t1_jdlwqb9"
  },
  {
    "id": "jdmfy8e",
    "date": "2023-03-25 14:15:45",
    "content": "The reason why Soviets were so obsessed with the idea of a “death hand\" device is due to the senile leadership unable to make decisions.",
    "username": "RealBenjaminKerry",
    "score": 2,
    "post_id": "121gb28",
    "parent_id": "t1_jdlwqb9"
  },
  {
    "id": "jdmcd40",
    "date": "2023-03-25 13:46:47",
    "content": "Can't detect a thermal launch signature when you use a trebuchet as your delivery method",
    "username": "HK47WasRightMeatbag",
    "score": 7,
    "post_id": "121gb28",
    "parent_id": "t1_jdm9d1l"
  },
  {
    "id": "jdm3g3i",
    "date": "2023-03-25 12:25:04",
    "content": "Wtf I love schizophrenia now",
    "username": "Chubat0",
    "score": 4,
    "post_id": "121gonn",
    "parent_id": "t3_121gonn"
  },
  {
    "id": "jdlt5t8",
    "date": "2023-03-25 10:20:51",
    "content": "Element 115 :o",
    "username": "Aware-Assistance-158",
    "score": 1,
    "post_id": "121gonn",
    "parent_id": "t3_121gonn"
  },
  {
    "id": "jdlxdwi",
    "date": "2023-03-25 11:17:17",
    "content": "Wow",
    "username": "DifficultAd4684",
    "score": 0,
    "post_id": "121gonn",
    "parent_id": "t3_121gonn"
  },
  {
    "id": "jdlu1xc",
    "date": "2023-03-25 10:33:25",
    "content": "Don't you ever think zelenski being used by the west, russia clear had enough of the threats and the pokes, in the end he felt like he had no choice but to push back.",
    "username": "Murky_Ordinary7904",
    "score": 1,
    "post_id": "121gonn",
    "parent_id": "t3_121gonn"
  },
  {
    "id": "jdludcj",
    "date": "2023-03-25 10:37:49",
    "content": ">Putin is working WITH Zelensky to assassinate dissidents--people standing in the way of the Globalist Plan\n\nNo.",
    "username": "forthesakeofwhich",
    "score": 1,
    "post_id": "121gonn",
    "parent_id": "t3_121gonn"
  },
  {
    "id": "jdlva8k",
    "date": "2023-03-25 10:50:26",
    "content": "interesting connection\n\nelement 115\n\nMOSCOVIUM was officially recognized 30 Dec 2015\n\n2666 days later= 18 April\n\n411 days after Putin seized the Zaporizhzhia nuclear plant on 3 Mar= 3/3\n\nARTICLE 5 HAS BEEN TRIGGERED= 411\n\n18 April= 9 months 11 days after the Guidestones were demolished on 7/7/22\n\n18 April--117th annv of the Great San Francisco earthquake on 18 April 1906\n\nworld war 3= 117\n\nBridge= 117",
    "username": "EurekaStockade",
    "score": 3,
    "post_id": "121gonn",
    "parent_id": "t1_jdlt5t8"
  },
  {
    "id": "jdlvr7c",
    "date": "2023-03-25 10:56:30",
    "content": "so Putin waited exactly 9 years after he invaded Crimea to push back\n\nhe invaded Crimea on Feb 23= 2/23\n\nSkull & Bones number\n\nthis is a Globalist script to engineer a fake energy crisis which can be blamed for the planned financial collapse",
    "username": "EurekaStockade",
    "score": 1,
    "post_id": "121gonn",
    "parent_id": "t1_jdlu1xc"
  },
  {
    "id": "jdlvsgm",
    "date": "2023-03-25 10:56:58",
    "content": "yes",
    "username": "EurekaStockade",
    "score": 3,
    "post_id": "121gonn",
    "parent_id": "t1_jdludcj"
  },
  {
    "id": "jdmebai",
    "date": "2023-03-25 14:02:46",
    "content": "Compelling argument you’ve got there.",
    "username": "Manos_Of_Fate",
    "score": 1,
    "post_id": "121gonn",
    "parent_id": "t1_jdlvsgm"
  },
  {
    "id": "jdlrvch",
    "date": "2023-03-25 10:02:27",
    "content": "I think it's a serious and accurate portrayal of Russia's motivations going into the war.",
    "username": "MauritanianHistory",
    "score": 2,
    "post_id": "121gtgj",
    "parent_id": "t3_121gtgj"
  },
  {
    "id": "jdlt004",
    "date": "2023-03-25 10:18:28",
    "content": "Fuck the paywall: https://archive.is/20230325073330/https://www.nytimes.com/2023/03/24/business/economy/ukraine-seize-russian-assets.html",
    "username": "DEPHIC",
    "score": 26,
    "post_id": "121h36b",
    "parent_id": "t3_121h36b"
  },
  {
    "id": "jdlsj1d",
    "date": "2023-03-25 10:11:45",
    "content": "Apart from helping Ukraine rebuild, taking away this money will also prevent it being spent by RF on weapons and other defense material (*like suicide drones from Iran or artillery shells from North Korea*), so I fail to see why this shouldn't be a viable option?",
    "username": "Fjell-Jeger",
    "score": 18,
    "post_id": "121h36b",
    "parent_id": "t3_121h36b"
  },
  {
    "id": "jdlt3ex",
    "date": "2023-03-25 10:19:53",
    "content": "It’s obvious that this should happen.  There has to be some real deterrent to launching a war, and it should go beyond just the cost of rebuilding. Russia has to pay for its war, why should anyone else pick up the tab?",
    "username": "Top_Solid7610",
    "score": 10,
    "post_id": "121h36b",
    "parent_id": "t3_121h36b"
  },
  {
    "id": "jdltfpj",
    "date": "2023-03-25 10:24:37",
    "content": "Switzerland won't donate or let others donate their equipment to help stop the war, but they sure will throw a fit if you confiscate a terror states bank assets...",
    "username": "DEPHIC",
    "score": 17,
    "post_id": "121h36b",
    "parent_id": "t3_121h36b"
  },
  {
    "id": "jdluy6q",
    "date": "2023-03-25 10:45:45",
    "content": "Very much agree they should pay for it all. Countless civilians have died by their direct targeting. Blatant war crimes committed constantly.",
    "username": "JustASt0ry",
    "score": 7,
    "post_id": "121h36b",
    "parent_id": "t3_121h36b"
  },
  {
    "id": "jdm1puo",
    "date": "2023-03-25 12:06:55",
    "content": "The Russian terrorists must be made to pay or what kind of message do we send to other terrorist states.",
    "username": "Sensitive-Pirate-461",
    "score": 5,
    "post_id": "121h36b",
    "parent_id": "t3_121h36b"
  },
  {
    "id": "jdlzxay",
    "date": "2023-03-25 11:47:22",
    "content": "\\>U.S. officials have cautioned against seizing Russia’s reserves \n\nBecause the corrupt officials have already done this and are hiding the money as we speak.",
    "username": "Salines_Beach",
    "score": -1,
    "post_id": "121h36b",
    "parent_id": "t3_121h36b"
  },
  {
    "id": "jdmcfc3",
    "date": "2023-03-25 13:47:19",
    "content": "Russia should be held accountable (to include seizure and redistribution of the oligarchs' plunder) but there's a way to do it that brings the Russians into western civilization and makes them an asset to Ukraine and the free world, and there's a way to do it that could lead to worse outcomes than we see even now.\n\nAnyone with a strong opinion on this subject who hasn't studied the history of WWI and WWII , specifically the Treaty of Versailles and the Marshall Plan, would be wise to do so, and 10-15 minutes of reading  is enough to grasp the key takeaways:\n\n[https://encyclopedia.ushmm.org/content/en/article/treaty-of-versailles](https://encyclopedia.ushmm.org/content/en/article/treaty-of-versailles)\n\n[https://thehill.com/opinion/international/384959-lessons-from-the-marshall-plan-liberty-and-faith-not-money-and-power/](https://thehill.com/opinion/international/384959-lessons-from-the-marshall-plan-liberty-and-faith-not-money-and-power/)",
    "username": "Stumphenhammer",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t3_121h36b"
  },
  {
    "id": "jdmeg45",
    "date": "2023-03-25 14:03:52",
    "content": "What useless f**kers are stalling in this idea?\nAll Ruzzian reserves that have been seized should be sent to Ukraine. Most basic common sense here.",
    "username": "Zumokoto77",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t3_121h36b"
  },
  {
    "id": "jdlv2cr",
    "date": "2023-03-25 10:47:20",
    "content": ">Ms. Yellen and others have argued that seizing Russia’s accounts could undermine faith in the dollar, the most widely used currency for the world’s trade and transactions. Foreign nations might be more reluctant to keep money in U.S. banks or make investments, fearing that it could be seized. \n\nVenezuela and Iran: you think?",
    "username": "Joxposition",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t3_121h36b"
  },
  {
    "id": "jdlumft",
    "date": "2023-03-25 10:41:17",
    "content": "Thanks /u/DEPHIC, you the real MVP. \n\nHey OP (/u/Electrical_Chart1499) could you please post article content in the comments rather than just saying \"hey it's a challenge\" and leaving it to other people? Clearly you're able to read it, if you're able to post it, so just CTRL-A, CTRL-C, CTRL-V and you'd be helping a lot of people out.",
    "username": "h8speech",
    "score": 13,
    "post_id": "121h36b",
    "parent_id": "t1_jdlt004"
  },
  {
    "id": "jdm7he0",
    "date": "2023-03-25 13:03:58",
    "content": "I think the main argument against it is that this was done to Germany in WWI, which directly led to WWII.  After WWII, enemies were rebuilt as allies and now Germany and Japan are very good allies.  \n\nForcing Russia to repay isn’t a good idea just because it feels like a just punishment.",
    "username": "Leto2AndTheCrew",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdlsj1d"
  },
  {
    "id": "jdm2syk",
    "date": "2023-03-25 12:18:25",
    "content": "Utter garbage but sure feel free to provide any actual proof.",
    "username": "SutMinSnabelA",
    "score": 2,
    "post_id": "121h36b",
    "parent_id": "t1_jdlzxay"
  },
  {
    "id": "jdmdtha",
    "date": "2023-03-25 13:58:48",
    "content": "Or, more likely, it's because of what we learned from the Treaty of Versailles as well as the Marshall Plan.",
    "username": "Stumphenhammer",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdlzxay"
  },
  {
    "id": "jdlx2zt",
    "date": "2023-03-25 11:13:34",
    "content": "I do not want to  pay for copyright violation.  A friend in Boston had to pay over 10,000 for placing copyright media on her website.",
    "username": "Electrical_Chart1499",
    "score": -4,
    "post_id": "121h36b",
    "parent_id": "t1_jdlumft"
  },
  {
    "id": "jdmgfc3",
    "date": "2023-03-25 14:19:29",
    "content": "This is a popular take for some historians but Germany improved its economy first and then started to invade other countries when it could have just not gone to war. I understand the way reparations were imposed was a bad idea but I think the nazis were the cause of WWII. Using money from putin and his oligarchs that normal russians would never benefit from anyway could be done to help rebuild UKR.",
    "username": "Consistent-Metal9427",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdm7he0"
  },
  {
    "id": "jdmgm4i",
    "date": "2023-03-25 14:20:57",
    "content": "You have to distinguish between current moskovy leadership and future potential options. As long as putin is in power you have to squeeze them as hard as you can. When his regime collapses there may be a chance to rebuild like in Germany. But don’t forget that Germany was occupied for the longest time and divided in four sectors. And US troops are still there. Is that going to be possible in the territory of the Russian federation?",
    "username": "UnCommonCommonSens",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdm7he0"
  },
  {
    "id": "jdmflm3",
    "date": "2023-03-25 14:12:59",
    "content": "Is that the argument or is it just Russian sympathizers?",
    "username": "ckal09",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdm7he0"
  },
  {
    "id": "jdmhqkn",
    "date": "2023-03-25 14:29:41",
    "content": "And how about Ukraine? Look at their cities and infrastructures. It’s on Russia to pay back all the damages they’ve done for this bullshit war. \nThey have oil, they can recoup those loses.",
    "username": "Sneekbar",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdm7he0"
  },
  {
    "id": "jdlxhwr",
    "date": "2023-03-25 11:18:38",
    "content": "I don't think you'd be at risk of that, man, it's just Reddit. This isn't your website; if NYT wanted to take the text down, they'd get their lawyers to contact Reddit, but in practice this doesn't ever happen.\n\nHaving said that, if you wanna PM the text of articles to me (or anyone else active on the comments) so we can repost it, feel free.\n\nYou do post decent content, and I'm sure we all appreciate that.",
    "username": "h8speech",
    "score": 9,
    "post_id": "121h36b",
    "parent_id": "t1_jdlx2zt"
  },
  {
    "id": "jdmi23a",
    "date": "2023-03-25 14:32:08",
    "content": "The other main argument is it might be illegal to seize all the money and would be a violation of international law. It would encourage other countries to stop investing in western banks",
    "username": "numba1cyberwarrior",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdmgfc3"
  },
  {
    "id": "jdmib14",
    "date": "2023-03-25 14:34:00",
    "content": "Nazis were the cause.  The reparations and terrible economy is what the common people rallied behind though.  Hitler used the WWI punishment as a rallying cry",
    "username": "Leto2AndTheCrew",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdmgfc3"
  },
  {
    "id": "jdm1dzp",
    "date": "2023-03-25 12:03:25",
    "content": "How about you take the risk? It's no big deal.",
    "username": "therocketofpoop",
    "score": -4,
    "post_id": "121h36b",
    "parent_id": "t1_jdlxhwr"
  },
  {
    "id": "jdmdjck",
    "date": "2023-03-25 13:56:28",
    "content": "Did you, uh, read my comment before replying to it?\n\n>\tHaving said that, if you wanna PM the text of articles to me (or anyone else active on the comments) so we can repost it, feel free.\n\nSo in the comment you’re replying to I just offered to do exactly that, plus if you read [here](https://reddit.com/r/UkraineWarVideoReport/comments/11zakbb/_/jdbnhal/?context=1), I **did** exactly that, by myself, just yesterday. \n\nBut sometimes I’m on mobile or the site isn’t working for me, and I can’t do it. It isn’t an unreasonable ask that the one person we definitely know can see the article (OP) lets the rest of us see it. I mean, that’s literally the point of being OP, right? Sharing the article? It’s not meant to be a scavenger hunt challenge. \n\nI’m willing to take the (imagined) risk, like I just said; every time he posts an article, if necessary, because he does make good posts. But he should just pm the article text to make that easier, like I *also* just said. \n\nWhat have you done for this community lately?",
    "username": "h8speech",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdm1dzp"
  },
  {
    "id": "jdmf7ee",
    "date": "2023-03-25 14:09:52",
    "content": "Lol, I appreciate the way you handled all that...classy, adult like, and helpful. That kid (the troll, not the OP) probably won't learn anything useful from it, but I appreciate the reminder/inspiration to be better.",
    "username": "Stumphenhammer",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdmdjck"
  },
  {
    "id": "jdmehwx",
    "date": "2023-03-25 14:04:16",
    "content": "I haven't gone around asking others in public to engage in copyright infringement (which in some places carries penalties) so that I do not have to face the possibility of penalties myself while achieving some measure of convenience for myself. Also I don't go around asking others what they have done for the community as a bullying tactic.\n\nEnjoy!",
    "username": "therocketofpoop",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdmdjck"
  },
  {
    "id": "jdmfr0z",
    "date": "2023-03-25 14:14:11",
    "content": "Thank you very much for saying that. Frequently I feel like I’m tilting at windmills, and a bit of approval occasionally is much appreciated. \n\nHave a good day!",
    "username": "h8speech",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdmf7ee"
  },
  {
    "id": "jdmfb8t",
    "date": "2023-03-25 14:10:44",
    "content": ">bullying tactic\n\nYou might want to try some cream for that thin skin you’ve got there, babe. 😘",
    "username": "h8speech",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdmehwx"
  },
  {
    "id": "jdmhv4k",
    "date": "2023-03-25 14:30:41",
    "content": "You're doing it the way rational, well-adjusted adults do it, which is not the language of the primary, or at least most vocal, audience on Reddit. It makes a difference, you just won't see the results that often. After he licks his wounded ego, he may just think about the interaction with a little more depth, maybe.\n\nBTW: I've been involved in copyright and trademark cases, both defending and responding to cease-and-desists, you weren't off base there either.",
    "username": "Stumphenhammer",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdmfr0z"
  },
  {
    "id": "jdmiic9",
    "date": "2023-03-25 14:35:31",
    "content": "Lol!",
    "username": "PhillyLove87",
    "score": 1,
    "post_id": "121h36b",
    "parent_id": "t1_jdmfb8t"
  },
  {
    "id": "jdltt6e",
    "date": "2023-03-25 10:29:59",
    "content": "Is our Girky trying to incite mutiny? Bring it on!!!",
    "username": "DormantSpector61",
    "score": 28,
    "post_id": "121hn3h",
    "parent_id": "t3_121hn3h"
  },
  {
    "id": "jdlviea",
    "date": "2023-03-25 10:53:22",
    "content": "Hasn't he been killing Ukrainians since 2014?",
    "username": "BagFine4185",
    "score": 22,
    "post_id": "121hn3h",
    "parent_id": "t3_121hn3h"
  },
  {
    "id": "jdlw1re",
    "date": "2023-03-25 11:00:30",
    "content": "Girkin either has no clue about how international law works, or more likely does, but pretends otherwise to further his agenda (to expand the war by forcing an official war declaration.)\n\nThe invasion of Ukraine is illegal, but the only persons liable to be tried for it are policy-level Russian officials. Individual soldiers, or even officers, are not expected to judge the legality of the war itself, and can not be found guilty of following orders to wage a war, even if the war is illegal. They can only be tried for any war crimes committed by themselves or by persons under their command. Girkin himself, incidentally, is guilty on both counts, both as a policy-level official as the self-proclaimed minister of defense of the \"DNR\", and as a war criminal, ranging from downing of MH17 to ordering the execution of unarmed Ukrainian POWs.\n\nNone of the major wars since WW2 (Korea, Vietnam, Soviet-Afghan, Iraq-Iran, US-Afghan, US-Iraq, etc.) have been declared. Many have been illegal based on various interpretations of legality, but it's ludicrous to claim that every single soldier participating in these wars on the invader's side is a war criminal *simply* because the war they fought in was undeclared.",
    "username": "GeneReddit123",
    "score": 15,
    "post_id": "121hn3h",
    "parent_id": "t3_121hn3h"
  },
  {
    "id": "jdm2528",
    "date": "2023-03-25 12:11:33",
    "content": "Jesus christ doesn't he get that even if war was declared killing civilians, rape and torture are still illegal and war crimes even If your ordered to do it",
    "username": "wombat9278",
    "score": 5,
    "post_id": "121hn3h",
    "parent_id": "t3_121hn3h"
  },
  {
    "id": "jdlvzbh",
    "date": "2023-03-25 10:59:35",
    "content": "Uh, the World decided around 1945 that you couldn't claim \"just following orders\".",
    "username": "Cheap_Doctor_1994",
    "score": 5,
    "post_id": "121hn3h",
    "parent_id": "t3_121hn3h"
  },
  {
    "id": "jdlumhu",
    "date": "2023-03-25 10:41:18",
    "content": "So declare war and back date it to Feb 2022 to make all those illegal orders suddenly legal? Clown show.\nIsn't it against the russian constitution to start a war so if it's ever declared a war then putin can be arrested? Won't happen.",
    "username": "TopLingonberry4346",
    "score": 6,
    "post_id": "121hn3h",
    "parent_id": "t3_121hn3h"
  },
  {
    "id": "jdlx30b",
    "date": "2023-03-25 11:13:34",
    "content": "Then how does he explaining downing mh-17 if there was no legal order because there is no war",
    "username": "slavaukrainu",
    "score": 2,
    "post_id": "121hn3h",
    "parent_id": "t3_121hn3h"
  },
  {
    "id": "jdm7sw7",
    "date": "2023-03-25 13:06:54",
    "content": "I guess you could say he is cleverer than the average Russian in a criminal way but does anyone detect that he's also trying to cover his own arse as well ?",
    "username": "Psychological-Bee760",
    "score": 2,
    "post_id": "121hn3h",
    "parent_id": "t3_121hn3h"
  },
  {
    "id": "jdm42em",
    "date": "2023-03-25 12:31:26",
    "content": "Girkin, still alive and literally spitting out logic",
    "username": "cynical_observer01",
    "score": 1,
    "post_id": "121hn3h",
    "parent_id": "t3_121hn3h"
  },
  {
    "id": "jdm892e",
    "date": "2023-03-25 13:10:58",
    "content": "Girkin is a cunt. But a cunt that can be useful in causing unrest in the Russians army’s ranks.",
    "username": "ZRR28",
    "score": 1,
    "post_id": "121hn3h",
    "parent_id": "t3_121hn3h"
  },
  {
    "id": "jdlxdjw",
    "date": "2023-03-25 11:17:09",
    "content": "...yes and Australians, and Malaysians, Dutch +++",
    "username": "FearCure",
    "score": 21,
    "post_id": "121hn3h",
    "parent_id": "t1_jdlviea"
  },
  {
    "id": "jdlxay5",
    "date": "2023-03-25 11:16:18",
    "content": "I thought he had a point, but now that I read your point it seems that he is definitely trying that war-escalation tactic and also he surely wants there to be a 'by the books' war not only in order to possibly not lose - but also if and when they most surely do lose, he'd like to at least be part of a collective and official war-machine and not some silly S.O.",
    "username": "ForSacredRussia1",
    "score": 7,
    "post_id": "121hn3h",
    "parent_id": "t1_jdlw1re"
  },
  {
    "id": "jdm493t",
    "date": "2023-03-25 12:33:17",
    "content": "They are criminals under domestic law and depending on the next power in Russia they could be selectively prosecuted.",
    "username": "pseudonym-6",
    "score": 5,
    "post_id": "121hn3h",
    "parent_id": "t1_jdlw1re"
  },
  {
    "id": "jdmdl8b",
    "date": "2023-03-25 13:56:54",
    "content": "> The invasion of Ukraine is illegal, but the only persons liable to be tried for it are policy-level Russian officials. Individual soldiers, or even officers, are not expected to judge the legality of the war itself, and can not be found guilty of following orders to wage a war, even if the war is illegal.\n\nI wouldn't be so sure about that one - a lot of international law got re-interpreted in the last two decades, and as a result Germany successfully prosecuted several surviving people assisting Nazi war crimes back then. As most crimes have reached the statue of limitations currently only complicity to murder is prosecuted - for people who before were seen as not expected to judge the legality of their tasks (like the secretary to a concentration camp commander). Without the statue of limitations issue a lot of soldiers could've been prosecuted with the current interpretation, though.\n\nI don't expect individual soldiers to be prosecuted just for being part of the war, though, as dealing with all the other crimes will already take ages. I wouldn't be surprised for Russians having to prove they were not part of the invasion for acquiring a Visa to some parts of the world once this is over, though.\n\n> None of the major wars since WW2 (Korea, Vietnam, Soviet-Afghan, Iraq-Iran, US-Afghan, US-Iraq, etc.) have been declared. Many have been illegal based on various interpretations of legality, but it's ludicrous to claim that every single soldier participating in these wars on the invader's side is a war criminal simply because the war they fought in was undeclared.\n\nYou'll need to separate pre/post 9/11 wars here, as that's where interpretations of international law changed. Also we have the main force being the US here, with the Hague invasion act, and a bunch of other countries that typically would look into starting investigations being complicit. \n\nThis also might be another reason why we won't see prosecution of ordinary soldiers - it'd set a precedent and could potentially open up soldiers involved in Iraq and Afghanistan to prosecution. \n\nIf a war is illegal or not depends mainly on UN definition, if it's undeclared or not doesn't play much of a role.",
    "username": "aard_fi",
    "score": 2,
    "post_id": "121hn3h",
    "parent_id": "t1_jdlw1re"
  },
  {
    "id": "jdm6bx2",
    "date": "2023-03-25 12:53:15",
    "content": "Considering he’s a terrorist himself I think it’s safe to assume that he does ‘get it’ but also doesn’t care",
    "username": "Bridgetdidit",
    "score": 3,
    "post_id": "121hn3h",
    "parent_id": "t1_jdm2528"
  },
  {
    "id": "jdmb9io",
    "date": "2023-03-25 13:37:24",
    "content": "There is no war crime, when there is no war…",
    "username": "Suspicious_Hawk6414",
    "score": 2,
    "post_id": "121hn3h",
    "parent_id": "t1_jdm2528"
  },
  {
    "id": "jdm4ie6",
    "date": "2023-03-25 12:35:53",
    "content": "MH17, never forget",
    "username": "Nice_Dependent_7317",
    "score": 11,
    "post_id": "121hn3h",
    "parent_id": "t1_jdlxdjw"
  },
  {
    "id": "jdluun8",
    "date": "2023-03-25 10:44:26",
    "content": "“Analysis” - LOL…… this crisis was caused by government but the leftist media tries so hard to pin it on corporations which are government sponsored entities to begin with",
    "username": "redeggplant01",
    "score": 0,
    "post_id": "121hj5u",
    "parent_id": "t3_121hj5u"
  },
  {
    "id": "jdlyyky",
    "date": "2023-03-25 11:36:09",
    "content": "If you can offer the same products for a much cheaper price because you’re not “greedy” then go ahead — I’m sure you’d get a ton of customers happily shopping with you instead of the “greedy” corporations!",
    "username": "AntonGw1p",
    "score": -1,
    "post_id": "121hj5u",
    "parent_id": "t3_121hj5u"
  },
  {
    "id": "jdm6o9m",
    "date": "2023-03-25 12:56:28",
    "content": "Amplification has been a successful strategy by Progressives. Trade Union analysis in a Guardian article shared on Reddit and FB and …\n\nIf you agree with the thinking, you don’t think twice. The repetition makes your belief stronger.\n\nIf you disagree, you might dig in to find a flaw and then demonize the OP.\n\nAlternatively, people who agree could say to themselves “let me look for flaws and then if I can’t find them, I’ve reinforced my belief”. Or people who disagree could say “well what in here is true that could make me rethink why I disagree.”\n\n1. Cherry-picked data\n2. Faulty logic\n3. Unsubstantiated claims\n4. Poor credibility/bias\n5. Correlation not causation\n6. Necessary but insufficient",
    "username": "solomon2609",
    "score": 0,
    "post_id": "121hj5u",
    "parent_id": "t3_121hj5u"
  },
  {
    "id": "jdmajom",
    "date": "2023-03-25 13:31:14",
    "content": "Regardless of the reason why the prices are going up the government should not step in on the economy at large and dictate/step in on prices of goods. It’s all about supply and demand. If people continue to buy product at higher prices then the market can bear that price. \n\nAs long as New price X New quantity Demanded is more than Old Price X Old quantity demanded then companies should raise prices.",
    "username": "butlerdm",
    "score": -1,
    "post_id": "121hj5u",
    "parent_id": "t3_121hj5u"
  },
  {
    "id": "jdlw42a",
    "date": "2023-03-25 11:01:20",
    "content": "There will always be exceptions among millions of people, but generally:  \nOur feeling is a feeling of repulsion at Russia's aggressiveness towards a country that simply wants to independently choose its own friends and its own future. While neither NATO nor Ukraine are perfect, at the end of the day this comes down to Russia realizing that few people who have belonged to Russia's sphere of influence in the past want to remain there if given the choice. Russia also knows that creating border conflicts effectively rules out NATO membership. There is broad support here for supporting Ukraine for as long as is necessary. Pretty much all our support packages, both humanitarian and military, have broad support in parliament. This also reassures Ukraine that even a change in government here does not mean any risk of Norway withdrawing its support. Absolutely all my friends and family are entirely pro-Ukraine in this war, and I am very happy that my tax money goes towards aiding Ukraine in its struggle. Support for sending more and more powerful weapons is also just increasing, both because Russia's war crimes are increasing too and because drunk Medvedev's incoherent ramblings about total war have no credibility anymore.\n\nThere is little internal tension about our approach. What there is, though, is some worry about the long-term effects of this war on our relationship with Russia, who will continue to be our neighbor. But there is very little fear of direct hostilities. Russian sabotage on Norwegian soil is an ongoing threat, and we know that Russian intelligence activity has increased. But the fear of Russia going into open warfare against a NATO country is pretty much non-existent, and we're not scared of something bad happening to us personally. Russia has no casus belli, there is no significant Russian presence here for Russia to fake having to protect, and their military is severely weakened. They have clearly demonstrated to the world that they are no longer a military superpower, just a paper tiger, and a full-scale war against NATO can only end badly for Russia. With their nuclear arms they can inflict pretty much total damage on us as well, but that would mean the end of Russia, and any war between NATO and Russia without nuclear weapons will be won easily by NATO. The Russian authorities also know, even if they will never publicly admit it, that there is not a single NATO country that wants to cross the border into Russian territory and take a single square metre of their country.\n\nIn the areas bordering Russia, the cross-border relationship has generally been better than the relationship on the national level, in part due to the Soviet Union's assistance (which of course also included many Ukrainians) in our liberation during WW2. They came, they liberated and they left again, for which we are thankful. The relationship at the border has *mostly* been pretty good and calm, despite belonging to opposite blocs. So while most people even in the border areas agree that we had to cut off most ties now, they are probably more saddened by it than the rest of Norway. And more worried for what the relationship will be like after this. Still, that issue pales in comparison to the brutality on the ground in Ukraine, and Norwegians at the border are also appalled that Russians they have been on friendly terms and co-operated with for a long time now suddently support and/or deny Russia's extensive war crimes. The Svalbard archipelago also has a significant Russian presence, and that's a bit complicated, even though the Russians and the Norwegians living there generally live in different areas. So there is uncertainty about our relationship, but not fear for our safety, and we will support Ukraine regardless.\n\nSupport for NATO has been high in Norway before this war, but it has still increased significantly because of the war. The Socialist Left Party, which has a confidence-and-supply relationship with the current government, has also reversed its position of advocating for Norway to leave NATO. Now only the far-left Red Party wants to leave, and even they have absolutely no intention of bringing up the subject. It's not really been a hot issue before this either, the vast majority wants to remain, but now leaving is absolutely unthinkable. Us being in NATO helps a lot, and we are also very happy that Sweden and Finland will seemingly join over the coming months.",
    "username": "xehest",
    "score": 36,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdlv28g",
    "date": "2023-03-25 10:47:18",
    "content": "The general consensus is that we’re against Russia. We help a lot without getting directly involved. We are not afraid of escalation beyond our borders. And NATO is a big reason for that.",
    "username": "Espa89",
    "score": 20,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdlxpeh",
    "date": "2023-03-25 11:21:08",
    "content": "I feel like the general sentiment is that Russia is out of its mind (or rather Putin). I’m a bit worried for war fatigue, but the alternative to not support Ukraine is so much riskier imo. We just have to keep the momentum. \n\n(Personally I’m so angry that this little group of people basically hold the whole World hostage right now. Most people just want to live In peace, I feel like Russia is stuck In the middle ages. I thought physical war was a thing of the past.)",
    "username": "FinancialSurround385",
    "score": 10,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdlva9k",
    "date": "2023-03-25 10:50:26",
    "content": "I find Norwegians to be very much pro Ukraine, pro democracy and against dictators invading peaceful countries. As for security, almost all of soldiers and gear stationed in the north at our border by the Barents sea have been sent to Ukraine and are likely exploded, dead or wounded. For det first time in my life i think the kids from the Norwegian army guarding the Moscowit boarder have a chance to actually stop an invasion. Slava Ukraine!",
    "username": "Straight_Standard_92",
    "score": 8,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdlygmn",
    "date": "2023-03-25 11:30:17",
    "content": "Well, 5 minutes long googling brings us some Norway’s opinion polls results on the subject, \nlets see them…\n\n[oslomet](https://www.oslomet.no/en/research/featured-research/seven-in-ten-say-war-ukraine-destroyed-norwegian-russian-relations-for-generations)\n\n[statista](https://www.statista.com/statistics/1293868/norway-military-support-ukraine-opinion/)\n\n[highnorthnews](https://www.highnorthnews.com/en/no-difference-between-north-and-south-regard-attitudes-towards-russia-says-researchers)\n\n[regjeringen](https://www.regjeringen.no/en/topics/foreign-affairs/humanitarian-efforts/neighbour_support/id2908141/)\n\nBesides, there’s a lot of articles covering the latest developments in the area - new role of Norway as a key European energy supplier, Russian submarines cruising along Norwegian borders threatening oil/gas infrastructure and old but unresolved dispute about Svalbard archipelago being pulled out of skapet. Presumably it may also add to the common attitude.",
    "username": "sovlex",
    "score": 2,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdm0kon",
    "date": "2023-03-25 11:54:32",
    "content": "I really, really hate war. I want the killing to stop.",
    "username": "Hattkake",
    "score": 2,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdm1fi7",
    "date": "2023-03-25 12:03:52",
    "content": "I hope it ends soon.",
    "username": "smaagoth",
    "score": 2,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdm21m7",
    "date": "2023-03-25 12:10:32",
    "content": "I want the war to end. I fully support Ukraine. 🇺🇦",
    "username": "--Alexandra-P--",
    "score": 2,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdlydzi",
    "date": "2023-03-25 11:29:26",
    "content": "1. It is a sad and unnecessary war, and we wish that it would have never started.\n2. That said, we have always been wary of Russia, and that they now get pounded into Ukrainian mud with the help of Norwegian (and other countries) weapons is good.\n3. Focus on improving the Norwegian military is good.\n4. Personally I think Russia is already way above their heads in mud, and don't feel like 'escalating' anything more.\n5. With Finland (and eventually Sweden) joining NATO, it will strengthen the defense of Nordics/Baltics tremendously.",
    "username": "NotAHamsterAtAll",
    "score": 1,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdm0f2s",
    "date": "2023-03-25 11:52:49",
    "content": "Fuck the war and fuck Putin.\n\n&#x200B;\n\nI'm housing a Ukrainian family who had to flee the war, they live in my basement apartment here in Norway. Such a nice family who has had to experience such heartbreaking stuff.\n\n&#x200B;\n\nWe chat a lot, I've also managed to hook them up with a few bicycles and a gaming computer for their 11 year old son. They seem to enjoy life here already, especially the fact that they can feel safe.\n\n&#x200B;\n\nI want Putin and all his supporters dead. I have yet to feel any fear myself, but if the war continues we could for sure be in risk as well, doubt that will happen though.",
    "username": "Asmothercucker",
    "score": 1,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdm1ogp",
    "date": "2023-03-25 12:06:32",
    "content": "The fact that russia have failed spectaculary in ukraine makes me feel safer\n\nHopefully Ukraine will kick them out sooner and if they take Crimea back noone will complain",
    "username": "Corando",
    "score": 1,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdm0xa2",
    "date": "2023-03-25 11:58:21",
    "content": "I've yet to meet a person who believes the absurd fiction that Russia was pulled against its will into a battle against \"Nazis\" in Ukraine, that's an absurd notion. Most of the people I've spoken with are fully in favour of Ukraine defending itself, and hope this horrible business will come to an end soon. \n\nAs for tensions... in the circles I run in, there is no fear that Ruscists might invade or otherwise harm Norway militarily. I live on a fjord, and I have been told that there have been more military vessels than usual because of tensions with Russia, and it seems so to me. But I don't know if that is true. I'm also in the south of the country, far from the border with Russia. Perhaps I would be more nervous about the war if I lived in Kirkenes, I can't say.\n\nMy perception is that the average Norwegian is mostly worried for the people trapped in this conflict - refugees, and people fleeing conscription by the Russian state. That is what people bring up most often when speaking of the war, and that is where my own concerns lie.",
    "username": "fairygodmotherfckr",
    "score": 0,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdm0itc",
    "date": "2023-03-25 11:53:56",
    "content": "There are disagreeances of course, but generally people support Ukraine, it seems. Some people are angry about the extent of help Ukraine is given by Norway because they’d rather have the money spent at home. But I suppose you’d have people thinking that no matter what country. \nMy city has taken in a LOT of Ukrainian refugees and my impression of the people is really really good. They’re friendly, and they seem genuinly interested in integrating and learning our language. I’m impressed.",
    "username": "Interesting-Entry-34",
    "score": 0,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdlz6vp",
    "date": "2023-03-25 11:38:46",
    "content": "Let them kill each other. I dont give a fuck. 🥱",
    "username": "Financial-Dust-5881",
    "score": -6,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdm80wn",
    "date": "2023-03-25 13:08:55",
    "content": "Putin is an asshole and needs to be stopped. I'm fully for a full front NATO war against Russia. The nuclear war is coming either way so we might as well get it overwith before they wisen up and actually spend money on maintainence.\n\nRussia should cease to exist and russians in general should face the same faith unless they give up any natural resources to the west and accept to convert their land to a puppet for Europe.\n\n_To those who don't understand, this is what the majority of Russians think about the west_\n\nSerious: I fully support Ukraine to the extent necessary to keep Russia at bay. Every day the war continues, less russians are able and willing to fight for the totalarian asshole Putin.\n\nI think the west need to start propaganda war against Russia and make russians understand that we don't actually have anyhing against them - just their leader. If they stop the war, sanctions will be lifted and trade might go back to normal.",
    "username": "theitguy19",
    "score": 1,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdmg9hb",
    "date": "2023-03-25 14:18:11",
    "content": ">*How is Norwegian society in general feeling about this war?*\n\nMany seem to be in support of Ukraine *no matter the cost* and some more worried that others. Others have a more pragmatic view, the authorities will tow the NATO-line and try to maintain popular support. Though it's starting to wear of some now, and the next new crisis is soon here to take peoples mind away from this particular war. Just like Ukraine took peoples mind away from Covid, and war in the Middle East etc. before that, so too will the next crisis take peoples mind away from Ukraine...\n\n>*Are they feeling tense that it might escalate?*\n\nSome are. Some people are talking like the Russian Bear is right on our doorstep, which of course is completely ridiculous. The  authorities is on the other hand focused on a more integrated Nordic defense with our neighbors, and a stronger Norwegian presence in the Circumpolar region with continued Russian cooperation. So no, there's no *real worry* that the situation will escalate.\n\n>*Or are they feeling more relieved?*\n\nRelieved? No, I wouldn't say anyone is very relieved? Why would they?\n\n>*And does the fact that Norway is in NATO help or worse the situation?*\n\nDepends on who you ask. Those in favor of NATO will say it betters the situation, those opposed will argue the opposite. The view of the authorities is as usual very much pro-NATO.\n\nThere's been a much more polarizing debate when it comes to NATO than there's ever been. *\"If you don't support NATO you're basically inviting Russia to invade\"* and *\"You're either with us, or against us.\"* type of arguments really. Making it hard for the critics of NATO to have a voice without being shot down as a betrayer of Ukraine or something. Which is sort of weird in itself since they're not a part of NATO or EUs defense pact, just like Georgia was. Poor Georgia.",
    "username": "skjeggutenbart",
    "score": 1,
    "post_id": "121htmw",
    "parent_id": "t3_121htmw"
  },
  {
    "id": "jdm84yj",
    "date": "2023-03-25 13:09:56",
    "content": "Great comment. \n\nAdding to your comment: \n\nOne area of controversy: We do continue cooperating with Russia regarding fishing quotas, seen as a deed of necessity to preserve a healthy fish population. The controversial part is not that Russian ships have a quota in Norwegian waters, but that Russian ships can still deliver fish to three Norwegian ports. Ukraina has repeatedly asked Norway to discontinue this practice, but the government is reluctant to comply even though it reportedly is not a requirement in the fishing treaty between Norway and Russia.",
    "username": "Viseprest",
    "score": 1,
    "post_id": "121htmw",
    "parent_id": "t1_jdlw42a"
  },
  {
    "id": "jdmccwm",
    "date": "2023-03-25 13:46:44",
    "content": "There are also Ukrainians living in Svalbard together with the Russians, actually the Ukranians may outnumber them there. See article: https://www.highnorthnews.com/en/svalbard-russians-and-ukrainians-live-side-side",
    "username": "IrdniX",
    "score": 1,
    "post_id": "121htmw",
    "parent_id": "t1_jdlw42a"
  },
  {
    "id": "jdm2sey",
    "date": "2023-03-25 12:18:16",
    "content": ">physical war was a thing of the past.\n\nWell, Norway have taken active parts in 3 offensive physical wars for the last 20years. I don't know what you considered the past, but at least one of them is still going.",
    "username": "Odd-Jupiter",
    "score": 4,
    "post_id": "121htmw",
    "parent_id": "t1_jdlxpeh"
  },
  {
    "id": "jdm1dwh",
    "date": "2023-03-25 12:03:23",
    "content": "He bravely and stoically gives no fucks about death and brutality. I suspect he is not norwegian.",
    "username": "bleepytybleepbleep",
    "score": 2,
    "post_id": "121htmw",
    "parent_id": "t1_jdlz6vp"
  },
  {
    "id": "jdm3ilb",
    "date": "2023-03-25 12:25:46",
    "content": "That is true. Still think an invasion with the aim of terrotorial gain from a relative modern country of a neighbour posing no threat, is quite surprising In this Day and age.",
    "username": "FinancialSurround385",
    "score": 3,
    "post_id": "121htmw",
    "parent_id": "t1_jdm2sey"
  },
  {
    "id": "jdm3vx6",
    "date": "2023-03-25 12:29:39",
    "content": "I don't know if attacking someone on on another continent for no reason, take their national resources, destroy all their infrastructure, and then leave them to die without money, power, or water is much better then taking land.\n\nBut i guess it's in the eye of the beholder.",
    "username": "Odd-Jupiter",
    "score": -2,
    "post_id": "121htmw",
    "parent_id": "t1_jdm3ilb"
  },
  {
    "id": "jdm42bd",
    "date": "2023-03-25 12:31:25",
    "content": "No. Doesn’t make Russia’s actions justifiable though. I think war is medieval no matter who starts it.",
    "username": "FinancialSurround385",
    "score": 1,
    "post_id": "121htmw",
    "parent_id": "t1_jdm3vx6"
  },
  {
    "id": "jdm4sbo",
    "date": "2023-03-25 12:38:30",
    "content": "No one ever claimed that it justifies anything. Have we turned so much into Americans that we can't talk about stuff without being on a \"side\"? \n\nAnd i totally agree with you, all wars turns into barbary.",
    "username": "Odd-Jupiter",
    "score": 1,
    "post_id": "121htmw",
    "parent_id": "t1_jdm42bd"
  },
  {
    "id": "jdlyaf6",
    "date": "2023-03-25 11:28:13",
    "content": "I did have a lot of big dreams before and during war (I'm from Ukraine), but they always had kinda happy ending, with spiritual renovation of my land, but also very big price to pay for it.",
    "username": "8rita8",
    "score": 3,
    "post_id": "121ih1p",
    "parent_id": "t3_121ih1p"
  },
  {
    "id": "jdmbgvc",
    "date": "2023-03-25 13:39:08",
    "content": "No",
    "username": "roger4lead",
    "score": 1,
    "post_id": "121ih1p",
    "parent_id": "t3_121ih1p"
  },
  {
    "id": "jdmec2x",
    "date": "2023-03-25 14:02:57",
    "content": "It sounds like you’re not asking currently but in general? If so, yes. Historically large scale conflicts like war have often been seen in dreams beforehand. Jung himself had violent dreams presaging the First World War, and he was able to see the build up to the Second World War in the dreams of his German patients. More recently, I have heard people report an increase in these type of dreams surrounding major catastrophes such as 9/11, or the hurricane destruction of New Orleans (both off which I had intense dreams about beforehand).\n\nOf course, when looking at dreams like this it’s hard to say what is actually “prophetic” and what is just extrapolated dread/projected anxiety. Dreams do take what we know and are interested in and defamiliarize them from the context of memory and history to run simulations about possible future responses. If, for instance, you are someone who pays any attention to the news, or to wars in general, or who consumes any media in which warfare plays a part, or have any emotional feelings about these topics, then it’s perfectly natural that you could have dreamt this.",
    "username": "taitmckenzie",
    "score": 1,
    "post_id": "121ih1p",
    "parent_id": "t3_121ih1p"
  },
  {
    "id": "jdlyfqi",
    "date": "2023-03-25 11:30:01",
    "content": "mine had the opposite tone. I had a vision of every single previous human civilisation almost in a pyramid and I was getting shown how each and every single one of these civilisations thought that they were invincible at the time but how they always ended in bloodshed and catastrophe and that this time will be no differnet.\n\n&#x200B;\n\nand how reality itself is essentially based on bloodshed, and we are ignorant to this fact because we don't want to see it and I got shown the meat industry and how our entire existence is based on bloodshed of animals and that everything is reliant on death and that humans are not different to animals in this regard.",
    "username": "ifeelsomuchshame252",
    "score": 1,
    "post_id": "121ih1p",
    "parent_id": "t1_jdlyaf6"
  },
  {
    "id": "jdlvxhj",
    "date": "2023-03-25 10:58:53",
    "content": "Hi! I'm QualityVote, and I'm here to give YOU the user some control over YOUR sub! \n\nIf the post above contributes to the sub in a meaningful way, **please upvote this comment!**\n\nIf this post breaks the rules of /r/SPACs, belongs in the Daily, Weekend, or Mega threads, or is a duplicate post, please **downvote this comment!**\n\n*Your vote determines the fate of this post! If you abuse me, I will disappear and you will lose this power, so treat it with respect.*",
    "username": "QualityVote",
    "score": 1,
    "post_id": "121icfu",
    "parent_id": "t3_121icfu"
  },
  {
    "id": "jdmi5re",
    "date": "2023-03-25 14:32:54",
    "content": "Fuck Russia.",
    "username": "_sillycibin_",
    "score": 1,
    "post_id": "121icfu",
    "parent_id": "t3_121icfu"
  },
  {
    "id": "jdm00j4",
    "date": "2023-03-25 11:48:23",
    "content": "For frig sake!! 😂😂😂😂 what paper is this?",
    "username": "Difficult_Complex308",
    "score": 3,
    "post_id": "121iufg",
    "parent_id": "t3_121iufg"
  },
  {
    "id": "jdm2ohe",
    "date": "2023-03-25 12:17:10",
    "content": "I think, The Mirror",
    "username": "jollyrodger2077",
    "score": 3,
    "post_id": "121iufg",
    "parent_id": "t1_jdm00j4"
  },
  {
    "id": "jdlzvru",
    "date": "2023-03-25 11:46:50",
    "content": ":/ I lived through and vividly remember the 90s.\n\nLike....nearly every 90s movie...even fuckin' *Ms. Doubtfire*...is coming true.  \n\nMaybe man just follows the same patterns over and over if I'm not joking",
    "username": "uselessbynature",
    "score": 4,
    "post_id": "121j611",
    "parent_id": "t3_121j611"
  },
  {
    "id": "jdm6z53",
    "date": "2023-03-25 12:59:17",
    "content": "Palpatine: \"We Will Watch Your Career With Great Interest.\"",
    "username": "MKUltraBlack",
    "score": 1,
    "post_id": "121j611",
    "parent_id": "t3_121j611"
  },
  {
    "id": "jdmbw9o",
    "date": "2023-03-25 13:42:45",
    "content": "Anakin literally quotes George Bush in Revenge of the Sith",
    "username": "Internal_Balance6901",
    "score": 1,
    "post_id": "121j611",
    "parent_id": "t3_121j611"
  },
  {
    "id": "jdmc07f",
    "date": "2023-03-25 13:43:41",
    "content": "Those movies are literally about how a republic falls into Fascism(and space Jesus). George Lucas has said as much. It was supposed to be a warning, but no one told George to do more than one draft of the scripts. It not a bad observation.",
    "username": "LexOdin",
    "score": 1,
    "post_id": "121j611",
    "parent_id": "t3_121j611"
  },
  {
    "id": "jdm1riq",
    "date": "2023-03-25 12:07:25",
    "content": "We all live in a simulation",
    "username": "The_Mighty_Onion",
    "score": 0,
    "post_id": "121j611",
    "parent_id": "t1_jdlzvru"
  },
  {
    "id": "jdmetqk",
    "date": "2023-03-25 14:06:51",
    "content": "\"Fool me once Obi Wan, shame on me.  Fool me twice...  shame on.....  I can't be fooled Obi Wan!\"",
    "username": "sHaDowpUpPetxxx",
    "score": 1,
    "post_id": "121j611",
    "parent_id": "t1_jdmbw9o"
  },
  {
    "id": "jdm2w22",
    "date": "2023-03-25 12:19:20",
    "content": "It's not a simulation; just turns out man is so predictable it feels like one.\n\nThat's how Christianity works.  If you read the Bible as a tome of verbalized, passed down warning and not a manual on self flagellation it starts to make sense in a grand historical scheme.",
    "username": "uselessbynature",
    "score": 6,
    "post_id": "121j611",
    "parent_id": "t1_jdm1riq"
  },
  {
    "id": "jdm51bd",
    "date": "2023-03-25 12:40:54",
    "content": "Say it again. I don’t think they heard you in the back!",
    "username": "Practical_Drama_7106",
    "score": 1,
    "post_id": "121j611",
    "parent_id": "t1_jdm2w22"
  },
  {
    "id": "jdm6kj5",
    "date": "2023-03-25 12:55:29",
    "content": "Can you expand on this more? The Bible topic specifically.",
    "username": "InformationOpening74",
    "score": 1,
    "post_id": "121j611",
    "parent_id": "t1_jdm2w22"
  },
  {
    "id": "jdmfrkn",
    "date": "2023-03-25 14:14:19",
    "content": "I keep saying it and I usually get downvoted.\n\nI don't proselytize but I do talk about it a lot IRL.  Unfortunately most people dismiss me as crazy but I don't really care cuz it's your own smiting that's comin I'm busy building an arc hahahahaha",
    "username": "uselessbynature",
    "score": 1,
    "post_id": "121j611",
    "parent_id": "t1_jdm51bd"
  },
  {
    "id": "jdm9wak",
    "date": "2023-03-25 13:25:33",
    "content": "It's a collection of stories about the fall of civilizations.  \n\nHistory doesn't get written by the losers.  Pacifists always lose and true Christian's are pacifists (the church, all of them, is an establishment by man and very corrupt).  Humans have always passed on their EQ type history through stories, song, art.\n\nThat's what the Bible is.  \n\nI didn't ever read it until my 30s and it's plain as day if you don't have a pastor to shove it down your throat.",
    "username": "uselessbynature",
    "score": 2,
    "post_id": "121j611",
    "parent_id": "t1_jdm6kj5"
  },
  {
    "id": "jdlzs6b",
    "date": "2023-03-25 11:45:40",
    "content": "Apologize had to add & subtract some infor this morning.... Only allowed to post 40,000 characters now .... YEESh....   Have a great weekend all...    \n\nChico",
    "username": "Chico237",
    "score": 3,
    "post_id": "121j35n",
    "parent_id": "t3_121j35n"
  },
  {
    "id": "jdm0lic",
    "date": "2023-03-25 11:54:47",
    "content": "Thanks, Chico, \nSome good reading with my coffee.\nThe future is looking very nice for the future of niocorp and a few other mines.\nHave a great weekend.\nRichard.",
    "username": "Important_Nobody_000",
    "score": 3,
    "post_id": "121j35n",
    "parent_id": "t3_121j35n"
  },
  {
    "id": "jdlzv88",
    "date": "2023-03-25 11:46:40",
    "content": "Just waiting for the coffin makers to build the last 10,000 then their ready to go.",
    "username": "Sensitive-Pirate-461",
    "score": 1,
    "post_id": "121j24q",
    "parent_id": "t3_121j24q"
  },
  {
    "id": "jdm6jwg",
    "date": "2023-03-25 12:55:19",
    "content": "They are not needed, they burn them in mobile crematoriums",
    "username": "Faromme",
    "score": 1,
    "post_id": "121j24q",
    "parent_id": "t1_jdlzv88"
  },
  {
    "id": "jdm006s",
    "date": "2023-03-25 11:48:16",
    "content": "Russia can’t feed and equip 400k troops, never mind the monumental task of transporting and housing them.",
    "username": "Affectionate_Bus_884",
    "score": 11,
    "post_id": "121j23x",
    "parent_id": "t3_121j23x"
  },
  {
    "id": "jdm1ysb",
    "date": "2023-03-25 12:09:41",
    "content": "Has the first 400k shown up yet?",
    "username": "IvanVodkaNoPants",
    "score": 9,
    "post_id": "121j23x",
    "parent_id": "t3_121j23x"
  },
  {
    "id": "jdm5ptc",
    "date": "2023-03-25 12:47:29",
    "content": "There is no way 400k people are going to volunteer. Russia is going to have to draft them and Putin is more scared of Russians than NATO. The whole point of this war was to unite the Russian people against an common enemy that wasn’t Him.",
    "username": "nedfromcal",
    "score": 7,
    "post_id": "121j23x",
    "parent_id": "t3_121j23x"
  },
  {
    "id": "jdm61lm",
    "date": "2023-03-25 12:50:33",
    "content": "Crack suicide squads",
    "username": "spachi25",
    "score": 4,
    "post_id": "121j23x",
    "parent_id": "t3_121j23x"
  },
  {
    "id": "jdmaege",
    "date": "2023-03-25 13:29:59",
    "content": "*400,000 More Russian Dudes May Join Others In Finland & Estonia Soon: Reality*",
    "username": "-SkarchieBonkers-",
    "score": 3,
    "post_id": "121j23x",
    "parent_id": "t3_121j23x"
  },
  {
    "id": "jdm3c7j",
    "date": "2023-03-25 12:23:58",
    "content": "Soldiers… 🤣",
    "username": "ThatLoneBoot",
    "score": 2,
    "post_id": "121j23x",
    "parent_id": "t3_121j23x"
  },
  {
    "id": "jdm3r8j",
    "date": "2023-03-25 12:28:18",
    "content": "I hope they bring body bags",
    "username": "RH5050",
    "score": 2,
    "post_id": "121j23x",
    "parent_id": "t3_121j23x"
  },
  {
    "id": "jdmi5kr",
    "date": "2023-03-25 14:32:52",
    "content": "They can barely keep their trains going, their logistics are Kafkaesque, many of the units deployed already have been 'restaffed' 3x, and we see constant videos of the slaves complaining about suicide assaults, lack of ammunition, lack of food, equipment, gear, command, comms, medical care, etc etc et al.\n\nI'm starting to think putin is a CIA plant!🤣",
    "username": "Abject-Interaction35",
    "score": 1,
    "post_id": "121j23x",
    "parent_id": "t3_121j23x"
  },
  {
    "id": "jdm9xa1",
    "date": "2023-03-25 13:25:48",
    "content": "whatever troop logistics backbone Russia has left would be shattered if 400,000 cholos showed up wanting gear",
    "username": "nacozarina",
    "score": 4,
    "post_id": "121j23x",
    "parent_id": "t1_jdm006s"
  },
  {
    "id": "jdm4247",
    "date": "2023-03-25 12:31:21",
    "content": "They are currently volunteering to be fertilizer",
    "username": "jaghataikhan_warhawk",
    "score": 6,
    "post_id": "121j23x",
    "parent_id": "t1_jdm1ysb"
  },
  {
    "id": "jdmbwdt",
    "date": "2023-03-25 13:42:47",
    "content": "😂..speshul forces",
    "username": "Teabagger-of-morons",
    "score": 2,
    "post_id": "121j23x",
    "parent_id": "t1_jdm3c7j"
  },
  {
    "id": "jdm4j7i",
    "date": "2023-03-25 12:36:06",
    "content": "Special Decomposition Operation",
    "username": "IvanVodkaNoPants",
    "score": 3,
    "post_id": "121j23x",
    "parent_id": "t1_jdm4247"
  },
  {
    "id": "jdmdw84",
    "date": "2023-03-25 13:59:25",
    "content": "Again",
    "username": "Skrewrussia",
    "score": 1,
    "post_id": "121j1zk",
    "parent_id": "t3_121j1zk"
  },
  {
    "id": "jdmdpde",
    "date": "2023-03-25 13:57:50",
    "content": "God that's a lot of graves to dig.",
    "username": "Deletethishouse",
    "score": 1,
    "post_id": "121j1wm",
    "parent_id": "t3_121j1wm"
  },
  {
    "id": "jdmgdfo",
    "date": "2023-03-25 14:19:04",
    "content": ">I suppose there's a reason he's the only one talking about this\n\nYes, because he made it up.\n\n>So what do you think? What is your analysis? \n\nThe fed is doing what it's doing for exactly the reasons they say. They are actually pretty open about what they do and why they do it, and their actions line up with what we know about economics and what other central banks would do and do do in similar positions.\n\n>He gets up to 1M views on his videos.\n\nLuckily, truth isn't a popularity contest.",
    "username": "MachineTeaching",
    "score": 1,
    "post_id": "121jnc8",
    "parent_id": "t3_121jnc8"
  }
]
