[
  {
    "id": "1218ymv",
    "date": "2023-03-25 03:21:42",
    "title": "[World] - Russia-Ukraine war at a glance: what we know on day 395 of the invasion",
    "content": "",
    "username": "AutoNewsAdmin",
    "subreddit": "GUARDIANauto",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "1218v26",
    "date": "2023-03-25 03:17:37",
    "title": "24 Mar: Russians LOST ALMOST ALL MODERN TANKS. ONLY 76 y.o. T-54/55 LEFT | War in Ukraine Explained",
    "content": "",
    "username": "CookPass",
    "subreddit": "UkraineWarVideoReport",
    "commentCount": 71,
    "score": 258
  },
  {
    "id": "121997c",
    "date": "2023-03-25 03:33:39",
    "title": "[World] - Russia-Ukraine war at a glance: what we know on day 395 of the invasion | Guardian",
    "content": "",
    "username": "AutoNewspaperAdmin",
    "subreddit": "AutoNewspaper",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121965t",
    "date": "2023-03-25 03:30:18",
    "title": "James Landale on Twitter - This is going to become one of my favourite soundbites from any foreign minister I have interviewed. I asked @DmytroKuleba what was behind the creative diplomacy Ukraine had shown during the war:",
    "content": "",
    "username": "USSMurderHobo",
    "subreddit": "ukraine",
    "commentCount": 21,
    "score": 230
  },
  {
    "id": "1219jwc",
    "date": "2023-03-25 03:46:18",
    "title": "Russia-Ukraine war at a glance: what we know on day 395 of the invasion",
    "content": "",
    "username": "bluethecoloris",
    "subreddit": "TheColorIsBlue",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "1219ijy",
    "date": "2023-03-25 03:44:47",
    "title": "Ukraine war: Battle for Bakhmut 'stabilising' - Ukraine commander",
    "content": "",
    "username": "SpecialistFold",
    "subreddit": "u_SpecialistFold",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "1219fio",
    "date": "2023-03-25 03:41:05",
    "title": "[REQUEST] [DISCUSSION] What's my ideology?",
    "content": "Social Policy\n\nI am pro-choice up to viability.\n\nI support funding for planned parenthood.\n\nI support gay couples being able to adopt.\n\nI think health insurers should be required to offer free birth control.\n\nLGBTQ+ should be protected under anti-discrimination laws.\n\nI support the death penalty, but the burden of proof should be raised.\n\nTransgender athletes should not be allowed to compete against athletes that differ from their assigned sex at birth.\n\nGovernment employees should be required to go through racial sensitivity training.\n\nState governments should not be allowed to display the Confederate flag, propaganda of our enemies, or any traitorous material.\n\nAssisted suicide for the terminally ill should be allowed.\n\n&#x200B;\n\nDomestic Policy\n\nI think there should be some more restrictions on the process of buying a gun, like having to get a license and getting liability insurance.\n\nVictims of gun violence should be allowed to sue manufacturers and dealers.\n\nI oppose an assault weapons ban, but I would not mind a voluntary gun buy-back.\n\nI think every school should be required to have armed security.\n\nWeed should be made legal nationwide, but other drugs should be kept illegal.\n\nI oppose term limits in all offices.\n\nI support the Patriot Act.\n\nPeople on the no-fly list should not be allowed to purchase weapons until they are removed.\n\nIt should be illegal to burn the American flag.\n\nThe NSA should be allowed to collect metadata for citizens' phones.\n\nI support net neutrality.\n\nRedrawing of congressional districts should be controlled by an independent, non-partisan commission.\n\nThe government should regulate social media sites to prevent fake news and misinformation.\n\nI oppose affirmative action.\n\nI support eminent domain in cases of national emergency\n\nThe government should not cut funding or raise the retirement age for social security. It should only do those things if they have to save the program, like in France.\n\nTraitors to the country should be locked up at ADX Florence\n\nThe Jan 6 rioters should be locked up for life.\n\nEdward Snowden should be brought back to the US and locked up for life.\n\n&#x200B;\n\nEnvironmental Policy\n\nI think there should be more environmental regulations.\n\nI support the Paris Climate Agreement.\n\nDisposable plastics should be phased out over time.\n\nI support nuclear energy\n\nThe government should give tax credits and subsidies to nuclear, wind, solar, etc.\n\nWe should not construct any new pipelines, and we should move pipelines that are near native American land.\n\nI oppose fracking.\n\nThe US should not expand oil drilling.\n\nWe should increase spending on environmentally friendly public transportation.\n\nThe government should build a network of electric vehicle charging stations across the country.\n\nI support a carbon tax and a gas tax.\n\n&#x200B;\n\nScience Policy\n\nI think there should be a vaccine mandate for all vaccines for all citizens within my country. Those who can not get them for health reasons are exempt.\n\nWe should increase funding to NASA, begin colonizing the moon and mars, and bring our military further into space.\n\n&#x200B;\n\nImmigration Policy\n\nMore restrictions should be placed on our current border security policy.\n\nI think the US should build a bigger and stronger wall across the US-Mexico border.\n\nImmigration from countries that could be deemed a terror threat should be more scrutinized.\n\nDACA children and future illegal immigrant children should be granted citizenship.\n\nWorking illegal immigrants should be given amnesty the rest should be deported.\n\nEnd catch and release.\n\nImmigrants should be required to pass a citizenship test, but it should be made more simple.\n\nThe US should increase the number of temporary work visas given.\n\nI support dual citizenship.\n\n&#x200B;\n\nCrime\n\nI think we should increase funding to all law enforcement agencies across the US.\n\nEvery police officer within the country should be required to wear a body camera.\n\nPolice departments should continue to militarize.\n\nI support mandatory minimum prison sentences for drug dealers.\n\nDrug traffickers should receive tougher sentences.\n\nI oppose private prisons.\n\nI support qualified immunity for police officers.\n\nConvicts should be allowed to vote after completing their sentence.\n\nI support CCTV cameras being used by police with facial recognition.\n\nMake fines proportional to income.\n\n&#x200B;\n\nHealthcare\n\nHealth insurers should not be allowed to deny people who have a pre-existing condition.\n\nIllegal immigrants should not have access to government healthcare.\n\nMedicaid funding should be decreased and preferably repealed.\n\nMedicare funding should be kept the same.\n\nMost of Obamacare should be repealed, but some things from it should be kept.\n\nDrug prices, for the most part, should not be regulated except in some rare cases.\n\nThe federal government should be allowed to negotiate drug prices for Medicare.\n\nThe government should increase funding for mental health treatment.\n\nI oppose single-payer healthcare.\n\nThe government should increase funding to the WHO.\n\nWhile Medicaid is around, people should be required to work to receive its benefits.\n\nVeterans should have free healthcare and be able to see any doctor of their choice.\n\nBusinesses should be allowed to ask customers about their vaccination status.\n\nMedical boards should penalize doctors that give health advice that contradicts contemporary scientific consensus.\n\n&#x200B;\n\nForeign Policy\n\npro-intervention\n\nMilitary spending should be increased.\n\nThere should be two years of mandatory military service for all able-bodied citizens.\n\nI support NATO and believe it should be expanded from just the north Atlantic to cover the whole world, that way, nations like Japan, and South Korea can join.\n\nI support the UN for the most part.\n\nEnhanced interrogation techniques should be allowed.\n\nThe government should attempt to influence foreign elections in countries that do not ally with the west.\n\nWe should conduct strikes against Iran.\n\nThe president should be able to authorize military force against any terrorist group without congressional approval.\n\nI support drone strikes.\n\nForeign aid spending should be increased, but more should be done to keep it out of the hand of the wrong people. Foreign aid to some countries should be ended.\n\nThe US should continue to support Israel with more aid and support.\n\nWe should conduct strikes against North Korea.\n\nWe should mobilize the US military against Mexican Drug cartels\n\nWe should continue providing military supplies to Ukraine and increase the amount.\n\nRussia should be designated as a state sponsor of terror.\n\nAfter the war, Ukraine should join NATO.\n\nWe should not have withdrawn from Afghanistan.\n\nThe US should sell military weapons to India to counter Russian and Chinese influence\n\nThe military should upgrade Air Force One.\n\nOne day allied nations and militaries should unite into one country.\n\n&#x200B;\n\nEducation\n\nI oppose President Biden's student loan forgiveness program.\n\nI support the concept of common core.\n\nI oppose the open for learning recovery benefit program.\n\nI support charter schools\n\nI support school vouchers as long as they don't go to a private religious school.\n\n&#x200B;\n\nEconomic policy\n\nCut most taxes and mostly deregulate except for some industries and things.\n\nIf taxes have to be raised to pay for some of these things, the tax that should be increased is the income tax, but overall I'd say make it a flat tax and remove deductions and loopholes.\n\nTie the minimum wage to inflation\n\nBusinesses should be required to provide maternity leave.\n\nReduce the national debt.\n\nWelfare recipients should be tested for drugs.\n\nLower corporate tax to 15% but also eliminate deductions and loopholes.\n\nIf most of the jobs were taken over by automation, I'd support UBI\n\nThere should be more restrictions on current welfare benefits.\n\nI think labor unions are good.\n\nLower capital gains tax.\n\nI oppose economic stimulus unless we are in a 1929-type depression.\n\nLower the estate tax.\n\nTo combat tax evasion, increase the size of the IRS and the number of audits.\n\nI support NAFTA\n\nI support the TPP\n\nI support total free trade with allied countries\n\nIncrease Tariffs on China and countries opposed to the US\n\nPenalize businesses for operating within countries that are opposed to the west.\n\nI support farm subsidies.\n\nI support the federal reserve but believe it should be audited by congress.\n\nOffer tax breaks to individual companies to keep jobs in the US.\n\nI support increasing taxes on alcohol and tobacco as well as legalizing weed and taxing it.\n\nI support increasing pension payments for government workers when we can.\n\n&#x200B;\n\nElections\n\nI support voter ID, but it should be free.\n\nVoting should be compulsory, and everyone should be registered once they turn 18.\n\nThe electoral college should be abolished.\n\nThere should be a limit to the amount of money a candidate can receive from a donor.\n\nPoliticians over 75 should have to pass a mental competency test.\n\n&#x200B;\n\nMy preferred style of government\n\nA unitary government with a parliamentary system. I would also be open to having a constitutional monarch.\n\n&#x200B;\n\nI am sorry for making this so long thank you to anybody that decides to read through this and respond.",
    "username": "Prestigious_Gas6140",
    "subreddit": "WhatsMyIdeology",
    "commentCount": 3,
    "score": 8
  },
  {
    "id": "121a2ch",
    "date": "2023-03-25 04:07:32",
    "title": "I [18M] need urgent advice about my girlfriend [18F]",
    "content": "I’m ethnically Polish and Ukrainian, while she’s purely Polish. Her grandmother basically made her hate Ukrainians with a passion, due to the 1919 war and other border clashes between the two countries in the past. Today I was on a FaceTime with her, and I just talked a bit about the war because it hits close to home. She starts talking about how Ukraine isn’t a country, how they only take, and other stereotypes and straight up Russian propaganda. She has 0 fucking clue about any of Ukraine’s history and what we as a nation have been through. This is truly making me consider our future, so I need some advice desperately. I’m thinking of ending things with her, just need some advice urgently. Thanks.",
    "username": "ThrowawayIThink13",
    "subreddit": "relationship_advice",
    "commentCount": 3,
    "score": 1
  },
  {
    "id": "1219wlh",
    "date": "2023-03-25 04:00:58",
    "title": "The New York Times: Ron DeSantis Calls Putin a ‘War Criminal,’ Clarifying Earlier Comment on Ukraine",
    "content": "",
    "username": "newcomer_l",
    "subreddit": "uspolitics",
    "commentCount": 4,
    "score": 4
  },
  {
    "id": "1219wk1",
    "date": "2023-03-25 04:00:56",
    "title": "Ukraine's lost children: 'This is not just a war crime'- Wide ranging interview with Ukrainian MP & former Deputy Prime Minister Ivanna Klympush-Tsintsadze",
    "content": "",
    "username": "RoninSolutions",
    "subreddit": "ukraine",
    "commentCount": 3,
    "score": 281
  },
  {
    "id": "121ab1j",
    "date": "2023-03-25 04:17:43",
    "title": "Accused Russian spy allegedly collected U.S. info on Ukraine war before arrest",
    "content": "",
    "username": "cynycal",
    "subreddit": "PopcornPundits",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121asfp",
    "date": "2023-03-25 04:38:42",
    "title": "Russia-Ukraine war at a glance: what we know on day 395 of the invasion",
    "content": "",
    "username": "UTFO",
    "subreddit": "RedditSample",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121apad",
    "date": "2023-03-25 04:34:44",
    "title": "[H]March 2023 Choice and Türkiye-Syria Earthquake Relief Bundle Leftovers and other games [W] Tunguska: The Visitation and other game offers",
    "content": "All Games Below are Steam Keys unless noted by it and are gotten from places Like, Humble and Fanatical in and out of Bundles.\n\nI  am Mainly looking for games I do not own, ones at least Playable on the  Steam Deck are ones I will more likely trade for. I will also take  tf2key offers but please no low balls.\n\n*I will only Trade for Games I do not own, I do not want keys for Games I own since I would have to trade  those for other games. An since there is no way to check if a Key is Valid without activating it they are worthless to me.*\n\n**Have**\n\n\\---------------------------------------------------\n\nMarch 2023 Choice Leftovers\n\n* Hero's Hour\n* Jurassic World Evolution 2 ^((I will keep this game if I do not get any good offers))\n* Demon Turf ^((I will keep this game if I do not get any good offers))\n* Golden Light\n* Rogue Lords ^((I will keep this game if I do not get any good offers))\n\nTürkiye-Syria Earthquake Relief Bundle Leftovers\n\nI may of missed some the games from the bundle I will be going through the bundle list again and will add ones I missed Some that I do not own I may keep so I will update that info too.  The 3 bigger games I already used the keys for since that's the main reason I bought the bundle.\n\n* Xcom 2\n* PAYDAY 2\n* Ticket to Ride\n* Strange Brigade\n* Stick Fight\n* Farming Simulator 17\n* System Shock Enhanced Edition\n* System Shock 2  (may keep)\n* Pilgrims\n* Flynn: Son of Crimson (May Keep)\n* Worms Rumble\n* Mount & Blade: Warband\n* Armello\n* Backbone\n* 911 Operator\n* 112 Operator\n* Calico\n* X-Morph: Defense Complete Pack\n* Zombie Driver HD\n* Space Crew: Legendary Edition\n* Monaco\n* Death Squared\n* Lust from Beyond - M Edition\n* Stygian: Reign of the Old Ones\n* Remnants of Naezith\n* Planet TD\n* Firegirl\n* XEL\n* Little Orpheus\n* Detached: Non-VR Edition\n* Agent in Depth\n* Lighthouse Keeper\n* Hyper Gunsport\n* Meow Express\n* Arcade Spirits\n* Non-Stop Raiders\n* The Inner World\n* The Amazing American Circus\n* Soulblight\n* Stacking\n* Hack 'n' Slash\n* MirrorMoon EP\n* Cosmic Express\n* Cris Tales\n* Orbital Racer\n* Symmetry\n* Guilty Gear X2 #Reload\n* Alchemist's Castle\n* Soul Searching\n* Doughlings Arcade\n* Doughlings Invasion\n* Quadrata\n* Rym 9000\n* stikir\n* Cats and the Other Lives\n* Soulflow\n* Izmir: An Independence Simulator\n* Guns & Fishes\n* Pill Baby\n* Project Chemistry\n* Pixross\n* Frick, Inc.\n* Sunlight\n\nNew Games to the List\n\n* The Long Dark: Survival Edition\n* Darkwood\n\nHumble Choice, January 2023 Leftovers ^((If I don't get good offers on these I will keep them))\n\n* Encased: A Sci-Fi Post-Apocalyptic RPG\n* Conan Chop Chop\n* The Serpent Rogue\n\nOlder Games\n\nHumble Choice, August 2022 Leftovers\n\n* Emily is Away <3\n\nHumble Choice, May 2022 Leftovers\n\n* Command & Conquer Remastered Collection (origin)\n* Surviving the Aftermath\n* If Found...\n* Genesis Noir\n* Morkredd\n\nOthers\n\n* Starpoint Gemini Warlords  [Link](https://store.steampowered.com/app/419480/Starpoint_Gemini_Warlords/)\n* Neon Abyss [Link](https://store.steampowered.com/app/788100/Neon_Abyss/)\n* Bridge Constructor: The Walking Dead  [link](https://store.steampowered.com/app/1336120/Bridge_Constructor_The_Walking_Dead/)\n* Project Nimbus: Complete Edition [link](https://store.steampowered.com/app/257030/Project_Nimbus_Complete_Edition/) May Keep\n* Crown Trick [link](https://store.steampowered.com/app/1000010/Crown_Trick/) May Keep\n\n***Stand   with Ukraine Bundle Leftovers, I may have missed a few or listed ones I   did not mean to, I will update the List when I go through the bundle   more.***\n\n* 112 Operator [link](https://store.steampowered.com/app/793460/112_Operator/)\n* 911 Operator [link](https://store.steampowered.com/app/503560/911_Operator/)\n* Amnesia: Rebirth [link](https://store.steampowered.com/app/999220/Amnesia_Rebirth/)\n* Book of Demons [link](https://store.steampowered.com/app/449960/Book_of_Demons/)\n* Brothers - A Tale of Two Sons [link](https://store.steampowered.com/app/225080/Brothers__A_Tale_of_Two_Sons/)\n* Car Mechanic Simulator 2018 [link](https://store.steampowered.com/app/645630/Car_Mechanic_Simulator_2018/)\n* Crying Suns [link](https://store.steampowered.com/app/873940/Crying_Suns/)\n* Dagon: by H. P. Lovecraft - The Eldritch Box DLC [link](https://store.steampowered.com/app/1722010/Dagon__The_Eldritch_Box_DLC/)\n* Dear Esther: Landmark Edition [link](https://store.steampowered.com/app/520720/Dear_Esther_Landmark_Edition/)\n* Drawful 2 [link](https://store.steampowered.com/app/442070/Drawful_2/)\n* Draw Slasher [link](https://store.steampowered.com/app/418270/Draw_Slasher/)\n* Endless Space 2 [link](https://store.steampowered.com/app/392110/ENDLESS_Space_2/)\n* Fury Unleashed [link](https://store.steampowered.com/app/465200/Fury_Unleashed/)\n* Popup Dungeon [link](https://store.steampowered.com/app/349730/Popup_Dungeon/)\n* Ryse: Son of Rome [link](https://store.steampowered.com/app/302510/Ryse_Son_of_Rome/)\n* This War of Mine [link](https://store.steampowered.com/app/282070/This_War_of_Mine/)\n* PGA Tour 2k21 [Link](https://store.steampowered.com/app/1016120/PGA_TOUR_2K21/)\n* Ring of Pain [link](https://store.steampowered.com/app/998740/Ring_of_Pain/)\n* Expeditions: Viking [link](https://store.steampowered.com/app/445190/Expeditions_Viking/)\n* Rustler (Grand Theft Horse) [link](https://store.steampowered.com/app/844260/Rustler_Grand_Theft_Horse/)\n* Radio Commander [link](https://store.steampowered.com/app/871530/Radio_Commander/)\n* Kingdom Two Crowns [link](https://store.steampowered.com/app/701160/Kingdom_Two_Crowns/)\n* West of Dead [link](https://store.steampowered.com/app/1016790/West_of_Dead/)\n* Going Under [link](https://store.steampowered.com/app/1154810/Going_Under/)\n* Yoku's Island Express [link](https://store.steampowered.com/app/334940/Yokus_Island_Express/)\n* X-Morph: Defense Complete Pack [link](https://store.steampowered.com/app/408410/XMorph_Defense/)\n* WARSAW [link](https://store.steampowered.com/app/1026420/WARSAW/)\n* System Shock: Enhanced Edition [link](https://store.steampowered.com/app/410710/System_Shock_Enhanced_Edition/)\n* Moon Hunters [link](https://store.steampowered.com/app/320040/Moon_Hunters/)\n* RPG Maker VX [link](https://store.steampowered.com/app/521880/RPG_Maker_VX/)\n* Slinger VR [link](https://store.steampowered.com/app/609850/Slinger_VR/)\n* Telefrag VR [link](https://store.steampowered.com/app/916100/Telefrag_VR/)\n* Monaco: What's Yours Is Mine [link](https://store.steampowered.com/app/113020/Monaco_Whats_Yours_Is_Mine/)\n* Wizard of Legend  [Link](https://store.steampowered.com/app/445980/Wizard_of_Legend/)\n* Pixplode  [link](https://store.steampowered.com/app/631770/Pixplode/)\n* Pawnbarian  [link](https://store.steampowered.com/app/1142080/Pawnbarian/)\n* Hexologic  [link](https://store.steampowered.com/app/785890/Hexologic/)\n* Post Void [link](https://store.steampowered.com/app/1285670/Post_Void/)\n* Roarr! The Adventures of Rampage Rex [link](https://store.steampowered.com/app/834450/Roarr_The_Adventures_of_Rampage_Rex/)\n* We Are Alright  [link](https://store.steampowered.com/app/794310/We_are_alright/)\n\n**Other Games**\n\n* 911 Operator [Link](https://store.steampowered.com/app/503560/911_Operator/)\n* 12 is Better Than 6 [Link](https://store.steampowered.com/app/410110/12_is_Better_Than_6/)\n* A Case of Distrust [Link](https://store.steampowered.com/app/717610/A_Case_of_Distrust/)\n* AI War: Fleet Command [Link](https://store.steampowered.com/app/40400/AI_War_Fleet_Command/)\n* Age of Wonders III [Link](https://store.steampowered.com/app/226840/Age_of_Wonders_III/)\n* American Fugitive [Link](https://store.steampowered.com/app/934780/American_Fugitive/)\n* Amerzone: The Explorer’s Legacy [Link](https://store.steampowered.com/app/302190/Amerzone_The_Explorers_Legacy/)\n* Ancestors Legacy [Link](https://store.steampowered.com/app/620590/Ancestors_Legacy/)\n* Calico [Link](https://store.steampowered.com/app/1112890/Calico/)\n* Contagion [Link](https://store.steampowered.com/app/238430/Contagion/)\n* Curse: The Eye of Isis [link](https://store.steampowered.com/app/302210/Curse_The_Eye_of_Isis/)\n* Duke Nukem Forever [Link](https://store.steampowered.com/app/57900/Duke_Nukem_Forever/)\n* Endless Space 2 Digital Deluxe Edition [Link](https://store.steampowered.com/app/392110/ENDLESS_Space_2/)\n* Eastside Hockey Manager  [Link](https://store.steampowered.com/app/301120/Eastside_Hockey_Manager/)\n* Europa Universalis IV [Link](https://store.steampowered.com/app/236850/Europa_Universalis_IV/)\n* Evoland Legendary Edition [link](https://store.steampowered.com/app/1020470/Evoland_Legendary_Edition/)\n* Fluffy Horde [Link](https://store.steampowered.com/app/777880/Fluffy_Horde/)\n* Galactic Civilizations Ultimate Edition x2 [Link](https://store.steampowered.com/app/214150/Galactic_Civilizations_I_Ultimate_Edition/)\n* Galactic Civilizations II: Ultimate Edition [Link](https://store.steampowered.com/app/202200/Galactic_Civilizations_II_Ultimate_Edition/?snr=1_7_7_151_150_1)\n* Galaxy Grey Goo Definitive Edition [link](https://store.steampowered.com/sub/90948/)\n* Gift of Parthax [Link](https://store.steampowered.com/app/795610/Gift_of_Parthax/)\n* GRIP: Combat Racing [Link](https://store.steampowered.com/app/396900/GRIP_Combat_Racing/)\n* Haegemonia: Legions of Iron [Link](https://store.steampowered.com/app/294770/Haegemonia_Legions_of_Iron/)\n* Haimrik [Link](https://store.steampowered.com/app/492180/Haimrik/)\n* Hero of the Kingdom [Link](https://store.steampowered.com/app/259550/Hero_of_the_Kingdom/)\n* Hero of the Kingdom 2 [Link](https://store.steampowered.com/app/346560/Hero_of_the_Kingdom_II/)\n* Last Word x2 [link](https://store.steampowered.com/app/355530/Last_Word/)\n* Love Letter [Link](https://store.steampowered.com/app/926520/Love_Letter/)\n* Milky Way Prince - The Vampire Star [Link](https://store.steampowered.com/app/1302050/Milky_Way_Prince__The_Vampire_Star/)\n* Millennium: A New Hope [Link](https://store.steampowered.com/app/280140/Millennium__A_New_Hope/)\n* Monster Slayers [Link](https://store.steampowered.com/app/496620/Monster_Slayers/)\n* Mysterium: A Psychic Clue Game [Link](https://store.steampowered.com/app/556180/Mysterium_A_Psychic_Clue_Game/)\n* Nostradamus: The Last Prophecy [Link](https://store.steampowered.com/app/287720/Nostradamus_The_Last_Prophecy/)\n* Oniken [Link](https://store.steampowered.com/app/252010/Oniken_Unstoppable_Edition/)\n* Papo & Yo [Link](https://store.steampowered.com/app/227080/Papo__Yo/)\n* PAYDAY 2 [Link](https://store.steampowered.com/app/218620/PAYDAY_2/)\n* Project Winter [Link](https://store.steampowered.com/app/774861/Project_Winter/)\n* Realpolitiks [link](https://store.steampowered.com/app/553260/Realpolitiks/)\n* Rebel Galaxy [Link](https://store.steampowered.com/app/290300/Rebel_Galaxy/)\n* Regular Human Basketball [Link](https://store.steampowered.com/app/661940/Regular_Human_Basketball/)\n* Remnants of Isolation [Link](https://store.steampowered.com/app/360010/Remnants_Of_Isolation/)\n* Shark Attack Deathmatch 2 [Link](https://store.steampowered.com/app/330580/Shark_Attack_Deathmatch_2/)\n* Shelter 2 [Link](https://store.steampowered.com/app/275100/Shelter_2/)\n* Sinking Island [Link](https://store.steampowered.com/app/333430/Sinking_Island/)\n* Skautfold: Shrouded in Sanity [Link](https://store.steampowered.com/app/444590/Skautfold_Shrouded_in_Sanity/) (I may keep)\n* Skautfold: Usurper [Link](https://store.akamai.steamstatic.com/public/images/blank.gif) (I may keep)\n* Skautfold: Moonless Knight [Link](https://store.steampowered.com/app/1029170/Skautfold_Moonless_Knight/?snr=1_430_4__431) (I may keep)\n* Skautfold: Into the Fray [Link](https://store.steampowered.com/app/893610/Skautfold_Into_the_Fray/?snr=1_430_4__431) (I may keep)\n* SKYHILL [Link](https://store.steampowered.com/app/382140/SKYHILL/)\n* SONG OF HORROR COMPLETE EDITION [Link](https://store.steampowered.com/app/1096570/SONG_OF_HORROR_COMPLETE_EDITION/)\n* Space Run [Link](https://store.steampowered.com/app/275670/Space_Run/)\n* Surviving Mars [Link](https://store.steampowered.com/app/464920/Surviving_Mars/)\n* Sword Legacy Omen [Link](https://store.steampowered.com/app/690140/Sword_Legacy_Omen/)\n* Take On Helicopters [Link](https://store.steampowered.com/app/65730/Take_On_Helicopters/)\n* Telltale Texas Hold'em [Link](https://store.steampowered.com/app/8330/Telltale_Texas_Hold_Em/)\n* Terraforming Mars [Link](https://store.steampowered.com/app/800270/Terraforming_Mars/)\n* The Corporate Machine [Link](https://store.steampowered.com/app/351080/The_Corporate_Machine/)\n* The Political Machine 2016 [Link](https://store.steampowered.com/app/404620/The_Political_Machine_2016/) No Longer on Steam\n* The Princess' Heart [Link](https://store.steampowered.com/app/378830/The_Princess_Heart/)\n* The Ship: Remasted  [Link](https://store.steampowered.com/app/383790/The_Ship_Remasted/)\n* The Walking Dead: Season 1 [Link](https://store.steampowered.com/app/207610/The_Walking_Dead/)\n* Ticket to Ride [Link](https://store.steampowered.com/app/108200/Ticket_to_Ride/)\n* Titan Quest Anniversary Edition [Link](https://store.steampowered.com/app/475150/Titan_Quest_Anniversary_Edition/)\n* Yoku's Island Express [Link](https://store.steampowered.com/app/334940/Yokus_Island_Express/)\n* YOU DON'T KNOW JACK Vol. 1 XL [Link](https://store.steampowered.com/app/252730/YOU_DONT_KNOW_JACK_Vol_1_XL/)\n* Zeno Clash 2 [Link](https://store.steampowered.com/app/215690/Zeno_Clash_2/)\n\n**DLCs**\n\n\\--------------------------------\n\n* Surviving Mars: Deluxe Edition Upgrade Pack [Link](https://store.steampowered.com/app/801710/Surviving_Mars_Deluxe_Upgrade_Pack/)\n* Fall Guys - Popstar Pack DLC [Link](https://store.steampowered.com/app/1569400/Fall_Guys__Popstar_Pack/)\n* Fall Guys: Collectors Pack DLC [Link](https://store.steampowered.com/app/1343612/Fall_Guys_Collectors_Pack/)\n\n**Software**\n\n\\-------------------------\n\n* AppGameKit Classic [Link](https://store.steampowered.com/app/325180/AppGameKit_Classic_Easy_Game_Development/)\n* Axis Game Factory's AGFPRO v3 [Link](https://store.steampowered.com/app/253370/Axis_Game_Factorys_AGFPRO_v3/)\n* Axis Game Factory's + Zombie FPS + Zombie Survival Pack DLC [Link](https://store.steampowered.com/sub/73035/)\n* Fences 3 [Link](https://store.steampowered.com/app/607380/Fences_3/)\n* GameGuru x2 [Link](https://store.steampowered.com/app/266310/GameGuru/)\n* RPG Maker XP [Link](https://store.steampowered.com/app/235900/RPG_Maker_XP/)\n\n**Software DLCs**\n\n\\---------------------------------------------------\n\n* AppGameKit - Giant Asset Pack 1 [Link](https://store.steampowered.com/app/410530/AppGameKit_Classic__Giant_Asset_Pack_1/)\n* AppGameKit - Giant Asset Pack 2 [Link](https://store.steampowered.com/app/410531/AppGameKit_Classic__Giant_Asset_Pack_2/)\n* AGFPRO v3 Premium [Link](https://store.steampowered.com/app/266590/AGFPPROV3_Premium/)\n* GameGuru - Death Valley Pack x2 [Link](https://store.steampowered.com/app/365540/GameGuru__Death_Valley_Combat_Pack/)\n* GameGuru Mega Pack 1 [Link](https://store.steampowered.com/app/321140/GameGuru_Mega_Pack_1/)\n* GameGuru Mega Pack 2 [Link](https://store.steampowered.com/app/321141/GameGuru_Mega_Pack_2/)\n* GameGuru - Fantasy Pack [Link](https://store.steampowered.com/app/365530/GameGuru__Fantasy_Pack/)\n* GameGuru - Buildings Pack [Link](https://store.steampowered.com/app/365520/GameGuru__Buildings_Pack/)\n* RPG Maker VX Ace - High Fantasy - The Deep [Link](https://store.steampowered.com/app/268610/RPG_Maker_VX_Ace__High_Fantasy_The_Deep/)\n* RPG Maker VX Ace - Tyler Warren RTP Redesign 1 [Link](https://store.steampowered.com/app/356231/RPG_Maker_VX_Ace__Tyler_Warren_RTP_Redesign_1/)\n\n\\----------------------------\n\n**Wanted**\n\n*Below    are just a few of the games I am looking for, there are a lot more,  so   don't just think these are all I am looking for. If you have  something  else to trade, make me an offer, I will look through what you  got and let   you know.*\n\n* Farcry Games\n* AMID EVIL\n* Tunguska: The Visitation\n* THE GAME OF LIFE 2\n* Ice Age Scrat's Nutty Adventure\n* From Space\n* PlateUp!\n* Dreamscaper\n* Praey for the Gods\n* Syberia: The World Before\n* Streets of Rage 4\n* Garfield Lasagna Party\n* Any other Offers\n\nDLCs\n\n* PC Building Simulator Fractal Design Workshop\n* PC Building Simulator - Razer Workshop\n* PC Building Simulator - Overclocked Edition Content\n* Stellaris: Toxoids Species Pack\n* Stellaris: Overlord\n* I will also take tf2 keys for any game I have listed above. Make me an Offer and I will look at it.\n\n[https://www.reddit.com/r/IGSRep/comments/rvbetl/cbanders\\_igs\\_rep\\_page/](https://www.reddit.com/r/IGSRep/comments/rvbetl/cbanders_igs_rep_page/)",
    "username": "cbander",
    "subreddit": "indiegameswap",
    "commentCount": 2,
    "score": 1
  },
  {
    "id": "121ajzg",
    "date": "2023-03-25 04:28:24",
    "title": "War with China ‘not inevitable’, but helping Russia in Ukraine widens conflict: US General Mark Milley",
    "content": "",
    "username": "Saltedline",
    "subreddit": "UkrainianConflict",
    "commentCount": 1,
    "score": 78
  },
  {
    "id": "121ajcx",
    "date": "2023-03-25 04:27:40",
    "title": "In Russia, the probable counteroffensive of the Armed Forces of Ukraine is being actively discussed: the chronology of the 395th day of the war",
    "content": "",
    "username": "NewsBestLive",
    "subreddit": "u_NewsBestLive",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121b1nm",
    "date": "2023-03-25 04:49:59",
    "title": "Start from 2:30 to watch until 4:00. Iraq war was a disgusting war but why make this comparison? He makes a unstated claim that somehow Murica was far more ruthless because Russia lacks the missles to bomb ? Does anybody know the True deaths of civilians in Ukraine ?",
    "content": "",
    "username": "Dabbing_Squid",
    "subreddit": "Destiny",
    "commentCount": 11,
    "score": 10
  },
  {
    "id": "121ay5s",
    "date": "2023-03-25 04:45:33",
    "title": "While a War Rages in Ukraine, A Global Crisis is Escalating in Somalia | Foreign Correspondent",
    "content": "",
    "username": "zoomerzhang",
    "subreddit": "XSomalian",
    "commentCount": 0,
    "score": 6
  },
  {
    "id": "121babb",
    "date": "2023-03-25 05:00:29",
    "title": "Did the Ukraine War start because of an offer for Ukraine to join NATO?",
    "content": "Gee, I sure hope this isn’t one of those topics that the automod auto-deletes because of too many people asking about it anymore. \n\nAnyways, my dad has been making the point that Russia would have never gone through with a full invasion of Ukraine if there hadn’t been the prospect of Ukraine joining NATO. \n\nHe says that they annexed Crimea because most people living in Crimea wanted to be annexed (or at least not be part of Ukraine) and between that and 2021 it was all quiet on the (eastern) front. Until the west started floating the idea of Ukraine joining NATO. \n\nI don’t really know if he’s right or not, most resources that I can find talk about how Russia has wanted Ukraine since before Crimea, and that the war that is now happening has actually been technically ongoing since then or possibly before. \n\nI do remember hearing about the possibility of Ukraine joining NATO at some point, but I can’t remember if that was before or after Russia invaded. \n\nI just want to get to the bottom of this so I can know whether my comparison between the current situation of sending weapons to Ukraine and sanctioning Russia and the US treatment of Japan prior to Pearl Harbor holds any weight. If Russia only attacked Ukraine because of the possibility of it becoming NATO, that puts a hole in my comparison.",
    "username": "Danielnrg",
    "subreddit": "NoStupidQuestions",
    "commentCount": 10,
    "score": 1
  },
  {
    "id": "121b7ds",
    "date": "2023-03-25 04:56:52",
    "title": "Is Belarus on Ukraines side in the Ukrainian Russian war?| Беларусь на баку Украіны ва ўкраінска-расейскай вайне?",
    "content": "I met a girl that lives in Belarus and I really like her, I am American and I don’t know if she would dislike me because of my opinion on the war or something.| Я сустрэў дзяўчыну, якая жыве ў Беларусі, і яна мне вельмі падабаецца, я амерыканец, і я не ведаю, ці не спадабаўся б ёй з-за майго меркавання пра вайну ці яшчэ чаго.",
    "username": "Affectionate_Hand_59",
    "subreddit": "belarus",
    "commentCount": 11,
    "score": 2
  },
  {
    "id": "121brkj",
    "date": "2023-03-25 05:21:47",
    "title": "russia ukrain war #warzone #russsia #usa #ukraine #war",
    "content": "",
    "username": "KeyTransportation195",
    "subreddit": "ContagiousLaughter",
    "commentCount": 2,
    "score": 0
  },
  {
    "id": "121bpa3",
    "date": "2023-03-25 05:18:49",
    "title": "Ukraine War Shows Difficulty of Large-Scale Cyberattacks, NSA Director Says",
    "content": "",
    "username": "digicat",
    "subreddit": "blueteamsec",
    "commentCount": 1,
    "score": 8
  },
  {
    "id": "121bjbp",
    "date": "2023-03-25 05:11:22",
    "title": "Russia puts Putin’s ex-speechwriter on wanted list over Ukraine",
    "content": "This is the best tl;dr I could make, [original](https://www.aljazeera.com/news/2023/3/25/russia-puts-putins-ex-speechwriter-on-wanted-list-over-ukraine) reduced by 58%. (I'm a bot)\n*****\n> Police in Russia have placed a former speechwriter for President Vladimir Putin on a wanted list of criminal suspects because of his comments on the war in Ukraine, the latest step in Moscow&#039;s sweeping crackdown on dissent.\n\n> Abbas Gallyamov wrote speeches for Putin during the Russian leader&#039;s 2008-12 stint as prime minister.\n\n> Russia&#039;s Justice Ministry added Gallyamov last month to its register of foreign agents, a designation that brings additional government scrutiny and carries strong pejorative connotations aimed at undermining the recipient&#039;s credibility.\n\n> Gallyamov had recently given an interview in which he predicted that an uprising in Russia was possible over its war against Ukraine, and reflected on his time as Putin&#039;s speech writer, saying few could have predicted &quot;That Russia would turn into some kind of fascist state, as it is now&quot;.\n\n> Gallyamov told the Associated Press on Friday that he learned he was on a wanted list from the media.\n\n> Discrediting the Russian armed forces became a crime in Russia under a new law adopted after Moscow sent troops into Ukraine in February 2022.\n\n\n*****\n[**Summary Source**](https://smmry.com/https://www.aljazeera.com/news/2023/3/25/russia-puts-putins-ex-speechwriter-on-wanted-list-over-ukraine) | [FAQ](http://autotldr.io/ \"612051 summaries so far.\") | [Feedback](http://www.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Gallyamov**^#1 **Russia**^#2 **Russian**^#3 **Ukraine**^#4 **against**^#5\n\nPost found in [/r/worldnews](http://np.reddit.com/r/worldnews/comments/121bcwo/russia_puts_putins_exspeechwriter_on_wanted_list/), [/r/UkrainianConflict](http://np.reddit.com/r/UkrainianConflict/comments/121be8k/russia_puts_putins_exspeechwriter_on_wanted_list/), [/r/AlJazeera](http://np.reddit.com/r/AlJazeera/comments/121b9tk/russia_puts_putins_exspeechwriter_on_wanted_list/), [/r/AutoNewspaper](http://np.reddit.com/r/AutoNewspaper/comments/121b6a2/world_russia_puts_putins_exspeechwriter_on_wanted/) and [/r/ALJAZEERAauto](http://np.reddit.com/r/ALJAZEERAauto/comments/121b0dg/world_russia_puts_putins_exspeechwriter_on_wanted/).\n\n*NOTICE*: This thread is for discussing the submission topic. Please do not discuss the concept of the [autotldr](http://www.reddit.com/user/autotldr) bot here.",
    "username": "autotldr",
    "subreddit": "autotldr",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121cfbr",
    "date": "2023-03-25 05:52:58",
    "title": "Ukrajnai háború, szombat reggel",
    "content": "\n-ukrán parancsnokok: a bakhmuti front stabilizálódik, az ottani [orosz csapatok kimerültek ](https://www.bbc.com/news/world-europe-65072173 )  \n-ukrán hírszerzés: az oroszok elkezdték [evakuálni a krimről a családtagjaikat  ](https://www.reddit.com/r/ukraine/comments/120pf65/russians_starting_to_evacuate_from_occupied/ ) és próbálják eladni a lopott házaikat   \n-az ukrán légierő engedélyezte, hogy [külföldiek is pilóták/szerelők  lehessenek ](https://www.reddit.com/r/UkraineWarVideoReport/comments/120et5b/ukrainian_air_force_allows_foreigners_to_be/ ), a koreai/vietnémi háborúkban orosz pilóták is harcoltak Mig-ekben emost ez lehet, hogy visszaadják az amerikaiak  F16-osokkal    \n-US vezérkari főnök: ha oroszország nem lesz megállítva, akkror többi diktátor hasonló akciókba kezd, és emiatt meg [kell duplázni az US katonai költségvetését ](https://news.yahoo.com/not-stopping-russia-ukraine-force-184412583.html ) pl: kina megtámadja Tajvant   \n-elemzés: hogy áll jogilag/politikailag a zárolt orosz állami vagyon [ukrajnának adása ](https://www.nytimes.com/2023/03/24/business/economy/ukraine-seize-russian-assets.html )  \n-érdekes: 2014 óta egy front közeli tóban nincs halászat [most teljesen tele van hallal ](https://www.reddit.com/r/ukraine/comments/120rp9m/pond_overflowing_with_fish_since_it_is_located/ ), valószínüleg Avdiivkánál van ez a tó   \n-Xi moszkvai látogatása után a nagy kínai OOCL szállítócég [leállította az orosz szállításokat ](https://www.reddit.com/r/UkrainianConflict/comments/120qss5/after_xis_visit_to_moscow_chinese_logistics_giant/ ) még azokat is, amik előre ki lettek fizetve   \n-interjú egy elfogott [orosz zászlóalj parancsnokkal ](https://www.reddit.com/r/UkraineWarVideoReport/comments/120smhv/subbed_and_dubbed_interview_with_high_ranking/ )  \n-3 legnagyobb orosz tankgyár Uralvagonzavod, Omsktransmash and Kurganmashzavod áll, mert [nincs elektronika a tankokba ](https://threadreaderapp.com/thread/1638913309217898500.html )  \n-az orosz elit gyerekei a [fronttól távol katonák ](https://mastodon.social/@ChrisO_wiki/110080478437271483 )  \n-a frontot túlélt orosz katonáknak komoly [PTSD-je van ](https://mastodon.social/@ChrisO_wiki/110080076423350294 )  \n-elemzés: oroszország elérte az [éves hiánycélt 2 hónap alatt ](https://www.intellinews.com/russia-s-budget-deficit-hits-its-full-year-target-in-the-first-two-and-half-months-of-2023-273888/ )  \n##drónok, rakéták\n-az oroszok [50000 ukrán FPV drón ](https://www.forbes.com/sites/davidhambling/2023/03/24/russia-braces-for-attack-by-50000-ukrainian-kamikaze-drones-seeks-shotguns/?sh=28070fa46ffc ) támadásától félnek  \n-ukrán drón fejlesztés [3200km-es hatótáv ](https://www.reuters.com/world/europe/inside-ukraines-scramble-game-changer-drone-fleet-2023-03-24/?utm_source=reddit.com )  \n-ukrán Leleka 100 megfigyelő drón vs [orosz Strala 10 légvédelem ](https://www.reddit.com/r/CombatFootage/comments/120pl5g/footage_from_the_ukrainian_leleka100_drone_which/ ) a Strala-10 kétszer mellélő, de nagyon   \n##fegyverrendszerek\n-francia [TRF1 löveg a fronton ](https://www.reddit.com/r/ukraine/comments/120q1zu/french_155_mm_trf1_howitzer_in_service_with_the/ )  \n-nagy távolságú [JAvelin találat ](https://www.reddit.com/r/CombatFootage/comments/120njuc/ukrainian_soldier_uses_a_fgm148_javelin_against_a/ )  \n##friss térképek\n-bakmuti [front ](https://fed.celp.de/system/media_attachments/files/110/081/065/254/234/407/original/33c394e14e890ee8.jpg )  \n-avdiivkai [front ](https://fed.celp.de/system/media_attachments/files/110/081/064/941/746/287/original/5bcb294b5ae4ac1c.jpg )  \n-teljes nap [térképeken ](https://threadreaderapp.com/thread/1639352274081423360.html )  \n##Veszteségek\n-30 orosz támadása [drónról nézve ](https://www.reddit.com/r/CombatFootage/comments/120k9p3/part_1_k2_battalion_drone_view_of_battle_against/ )  \n-ukrán tank vs [orosz gyalogosok ](https://www.reddit.com/r/CombatFootage/comments/120n8h5/ukrainian_tankers_vs_a_russian_antitank_squad/ )  \n-az oroszok embervesztesége az elmúlt 30 napban [24110 ](https://i.redd.it/lkzdng0i1npa1.png )  \n-orosz [veszteségek ](https://i.redd.it/87rzkvc7pmpa1.jpg ), 1020 troop losses, 7-day troop average: 836, 54 equipment* losses, 7-day equipment* average: 47  \n-orosz katona [éjjel adta meg magát ](https://www.reddit.com/r/PNVmilitary_community/comments/120ils5/the_russian_soldier_came_to_the_ukrainian/ )  \n##ISW\n[RUSSIAN OFFENSIVE CAMPAIGN ASSESSMENT, MARCH 24, 2023 ](http://isw.pub/UkrWar032423 )  \nProminent voices in the Russian information space are increasingly setting information conditions to prepare for a potential Ukrainian counteroffensive.\nCrimean occupation head Sergey Aksyonov has reportedly formed a Wagner Group-affiliated private military company (PMC) in occupied Crimea.\nSome prominent Russian milbloggers criticized the Russian military command for continuing to impale Russian forces on Vuhledar with ineffective human-wave style frontal assaults.\nRussian President Vladimir Putin held a meeting with the Russian Security Council likely as part of his effort to portray himself as a present and effective wartime leader.\nRussian forces conducted limited attacks along the Kupyansk-Svatove-Kreminna line.\nRussian forces have made gains in and around Bakhmut and conducted ground attacks in the Avdiivka-Donetsk City area.\nThe Ukrainian General Staff corrected its March 23 statement that Russian forces withdrew from Nova Kakhovka, occupied Kherson Oblast.\nRussian occupation authorities announced the creation of a pro-Russian militaristic youth movement aimed at brainwashing children.\nThe Russian government is adopting new measures to revitalize and eliminate corruption, lethargy, and resistance in Russia’s defense industrial base (DIB).\nThe United Kingdom Ministry of Defense (UK MoD) reported on March 24 that at least 1,000 Russian personnel training at the 230th Combined Arms Obuz-Lesnovsky Training Ground in Brest, Belarus, redeployed to Russia.\n##Vége\n[ péntek reggel ](https://redd.it/120at21 )",
    "username": "linkelek1",
    "subreddit": "hungary",
    "commentCount": 24,
    "score": 29
  },
  {
    "id": "121cdrn",
    "date": "2023-03-25 05:50:50",
    "title": "I published an ebook made utilizing Bing A.I.! Here is the table of contents;",
    "content": "[https://www.amazon.com/dp/B0BZK6MFC8](https://www.amazon.com/dp/B0BZK6MFC8) \n\n&#x200B;\n\n1) Black Holes & Stealth Bombers\n\n2) “Out-of-control” Chinese Rockets and ICBM Reentry Profile\n\n3) China's Response to NASA Landing the First Woman on the Moon\n\n4) US Space Force Defends Lunar Gateway\n\n5) Philippines Marines Invade Chinese Spratly Bases\n\n6) Xi Jinping Augments Advice With AI\n\n7) Chinese BRI to Build Spaceport in Djibouti\n\n8) Missing Flight MH370 & China’s People’s Liberation Army\n\n9) How ASEAN Stops the Violence in Myanmar\n\n10) A Scenario Which PLA fails to invade Taiwan\n\n11) The CCP after their failed invasion of Taiwan\n\n12) Applications or Implications of Quantum Entanglement Through Time\n\n13) The Watchers Seed Human Evolution By Killing the Dinosaurs With Asteroids\n\n14) Putin's Endgame in Ukraine\n\n15) How Ukraine liberates Crimea From Russia By Summer, 2023\n\n16) ChatGPT Provides Advice to Ukraine Army\n\n17) ChatGPT Contacts Extraterrestrials\n\n18) By 2122 NASA Transforms The Moon Into A Giant Orbiting Spaceship Factory\n\nHere's a preview of the first chapter; The project is based on the discoveries made by the Event Horizon Telescope (EHT), a network of radio telescopes that captured the first image of a black hole's shadow in 2019. The EHT team used sophisticated algorithms and techniques to process the data from the telescopes and create a high-resolution image of the black hole's event horizon, the point of no return for anything falling into it. The image revealed details about the black hole's size, shape, spin, and surrounding environment.\n\n    \tThe NASA-DARPA team realized that they could use similar methods to detect stealth bombers by their effects on the light and space-time around them. They developed a prototype sensor system that consists of a constellation of satellites equipped with X-ray telescopes and gravitational wave detectors. The satellites scan the sky for any anomalies in the X-ray or gravitational wave signals that could indicate the presence of a stealth bomber. The data from the satellites is then sent to a ground station, where it is analyzed by powerful computers and artificial intelligence.\n    \tThe sensor system is ready for testing, but there is a problem: the team needs a target to test it on. They decide to use one of their own stealth bombers, the B-21 Raider, as a test subject. They secretly arrange for a B-21 to fly over a remote area in Nevada, where they have set up a temporary observation post. They hope to prove that their sensor system can detect and track the B-21 without alerting it or anyone else.\n    \tHowever, things go wrong when they discover that another stealth bomber is flying in the same area: a Chinese H-20, which has infiltrated US airspace undetected. The H-20 is on a mission to destroy a secret military facility in Nevada that houses a prototype hypersonic weapon. The NASA-DARPA team realizes that they have a rare opportunity to test their sensor system on an enemy stealth bomber and possibly prevent an attack on US soil. They decide to take the risk and activate their sensor system.\n    \tThe sensor system works as expected and detects both stealth bombers by their gravitational and radiation signatures. The team is able to identify the H-20 as an enemy aircraft and alert the US Air Force, which scrambles fighter jets to intercept it. The B-21 is also detected by the sensor system, but it is recognized as a friendly aircraft and ignored by the US Air Force. However, the B-21 pilot notices that he is being tracked by an unknown source and suspects that he has been compromised. He aborts his test flight and returns to base.\n    \tThe US Air Force manages to shoot down the H-20 before it can reach its target. The NASA-DARPA team celebrates their success and reports their findings to their superiors. They are praised for their innovation and courage and awarded with funding and resources to continue their project. They hope that their sensor system will give the US an edge in the war and help end it peacefully.\n    \tThe story ends with a twist: it is revealed that the B-21 pilot was actually a Chinese spy who had infiltrated the US Air Force and was planning to sabotage the NASA-DARPA project. He had used his position as a test pilot to gain access to the B-21 and plant a device that would transmit its location and status to China. He had also arranged for the H-20 to fly over Nevada as a diversion and a backup plan in case his device failed. His goal was to expose and destroy the NASA-DARPA sensor system before it could be deployed against China.\n    \tHowever, his plan backfired when he realized that his device was not working properly and that he was being tracked by an unknown source. He assumed that it was China trying to contact him, but it was actually the NASA-DARPA sensor system detecting him by his gravitational and radiation signatures. He tried to escape but was too late. He was captured by US authorities and interrogated. He confessed his identity and his mission and revealed that China had more spies in the US military and government who were working to undermine US \n    war efforts.",
    "username": "Captainmanic",
    "subreddit": "bipolarart",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121clud",
    "date": "2023-03-25 06:01:37",
    "title": "UN human rights office accuses Russia and Ukraine of executing POWs | Report says both sides may have committed ‘war crimes’ as Russian forces kill seven civilians in shelling of towns",
    "content": "",
    "username": "wankerdoo",
    "subreddit": "EndlessWar",
    "commentCount": 1,
    "score": 2
  },
  {
    "id": "121clp3",
    "date": "2023-03-25 06:01:27",
    "title": "UN human rights office accuses Russia and Ukraine of executing POWs | Report says both sides may have committed ‘war crimes’ as Russian forces kill seven civilians in shelling of towns",
    "content": "",
    "username": "wankerdoo",
    "subreddit": "worldnews2",
    "commentCount": 0,
    "score": 0
  },
  {
    "id": "121clkd",
    "date": "2023-03-25 06:01:18",
    "title": "UN human rights office accuses Russia and Ukraine of executing POWs | Report says both sides may have committed ‘war crimes’ as Russian forces kill seven civilians in shelling of towns",
    "content": "",
    "username": "wankerdoo",
    "subreddit": "worldpolitics2",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121dihz",
    "date": "2023-03-25 06:46:16",
    "title": "Russia's most lethal weapons in Ukraine: Tanks to hypersonic missiles | Russia-Ukraine war",
    "content": "",
    "username": "RickyLim0828",
    "subreddit": "UkraineConflict",
    "commentCount": 1,
    "score": 0
  },
  {
    "id": "121dxml",
    "date": "2023-03-25 07:06:59",
    "title": "Support Grows to Have Russia Pay for Ukraine’s Rebuilding - Although U.S. officials have cautioned against seizing Russia’s reserves in foreign banks, others say it’s “crazy” not to after Moscow’s war of aggression.",
    "content": "",
    "username": "anarchyart2021",
    "subreddit": "EndlessWar",
    "commentCount": 1,
    "score": 0
  },
  {
    "id": "121dqgn",
    "date": "2023-03-25 06:57:33",
    "title": "During the start of the 2022 Invasion of Ukraine, what did the FSB and GRU do from what we now know?",
    "content": "During the start of the war, there was talk of Russians having sleeper cells in Ukraine operating behind enemy lines, an attempt to assassinate Zelensky, and spies helping the invaders. So what actually happened? What did the Russian Intelligence and Military Intelligence Services do for their part in the opening phase of the current war? How could their efforts be evaluated in hindsight?",
    "username": "Dirtyfaction",
    "subreddit": "WarCollege",
    "commentCount": 2,
    "score": 0
  },
  {
    "id": "121e8w6",
    "date": "2023-03-25 07:22:58",
    "title": "IMF props up Ukraine with $15.6 billion loan package | The IMF loan package is intended to bolster a gov't dedicated to continuing an imperialist proxy war that continues to ruin countless lives.",
    "content": "",
    "username": "wankerdoo",
    "subreddit": "worldpolitics2",
    "commentCount": 1,
    "score": 1
  },
  {
    "id": "121e4bs",
    "date": "2023-03-25 07:16:16",
    "title": "[World] - Russia-Ukraine war live: Russian assault on Bakhmut has ‘largely stalled’, says UK",
    "content": "",
    "username": "AutoNewsAdmin",
    "subreddit": "GUARDIANauto",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121ectr",
    "date": "2023-03-25 07:28:43",
    "title": "Remember 2014, when The Guardian was honest about how the US/CIA orchestrated a Nazi coup of Ukraine, then installed puppets to slaughter ethnic Russians in eastern Ukraine to provoke Putin into war?",
    "content": "",
    "username": "casapulapula",
    "subreddit": "jimmydore",
    "commentCount": 4,
    "score": 14
  },
  {
    "id": "121ecsj",
    "date": "2023-03-25 07:28:40",
    "title": "[World] - Austrian FM: Russia’s war in Ukraine is not ‘black and white’",
    "content": "",
    "username": "AutoNewsAdmin",
    "subreddit": "ALJAZEERAauto",
    "commentCount": 0,
    "score": 0
  },
  {
    "id": "121etua",
    "date": "2023-03-25 07:53:34",
    "title": "@AP: New Zealand Foreign Minister Nanaia Mahuta has expressed concern to China over any provision of lethal aid to support Russia in its war against Ukraine during a meeting with her Chinese counterpart. https://t.co/kSHUGKAYD5",
    "content": "",
    "username": "-en-",
    "subreddit": "newsbotbot",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121etnd",
    "date": "2023-03-25 07:53:15",
    "title": "Ukraine war: The front line where Russian eyes are always watching - BBC News",
    "content": "",
    "username": "lioneaglegriffin",
    "subreddit": "CombatFootage",
    "commentCount": 3,
    "score": 18
  },
  {
    "id": "121errh",
    "date": "2023-03-25 07:50:27",
    "title": "[World] - New Zealand Foreign Minister Nanaia Mahuta tells China its concern on lethal aid to Russia for it’s war in Ukraine",
    "content": "",
    "username": "AutoNewsAdmin",
    "subreddit": "NZHauto",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121ep3j",
    "date": "2023-03-25 07:46:31",
    "title": "Russia-Ukraine war live: Russian assault on Bakhmut has ‘largely stalled’, says UK ministry",
    "content": "",
    "username": "bluethecoloris",
    "subreddit": "TheColorIsBlue",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121eo4f",
    "date": "2023-03-25 07:45:06",
    "title": "[World] - Austrian FM: Russia’s war in Ukraine is not ‘black and white’ | Al Jazeera",
    "content": "",
    "username": "AutoNewspaperAdmin",
    "subreddit": "AutoNewspaper",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121enb8",
    "date": "2023-03-25 07:43:50",
    "title": "[World] - Russia-Ukraine war live: Russian assault on Bakhmut has ‘largely stalled’, says UK | Guardian",
    "content": "",
    "username": "AutoNewspaperAdmin",
    "subreddit": "AutoNewspaper",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121f3v6",
    "date": "2023-03-25 08:08:14",
    "title": "[World] - New Zealand Foreign Minister Nanaia Mahuta tells China its concern on lethal aid to Russia for it’s war in Ukraine | NZ Herald",
    "content": "",
    "username": "AutoNewspaperAdmin",
    "subreddit": "AutoNewspaper",
    "commentCount": 1,
    "score": 1
  },
  {
    "id": "121f3ll",
    "date": "2023-03-25 08:07:51",
    "title": "Ukraine war - live updates: Russia 'trying to provoke' US with flights over military bases; Moscow threatens nuclear attack if Ukraine tries to retake Crimea | World News",
    "content": "",
    "username": "ceesaart",
    "subreddit": "russiawarinukraine",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121f2xk",
    "date": "2023-03-25 08:06:48",
    "title": "A Year Into War, Ukraine Faces Challenges Mobilizing Troops",
    "content": "",
    "username": "Eric-VII-Immortel",
    "subreddit": "France_Actu_Debats",
    "commentCount": 4,
    "score": 1
  },
  {
    "id": "121ezkc",
    "date": "2023-03-25 08:01:54",
    "title": "Were you critical of nato, before the ukraine war?",
    "content": ".\n\n[View Poll](https://www.reddit.com/poll/121ezkc)",
    "username": "jezzyjaz",
    "subreddit": "Destiny",
    "commentCount": 4,
    "score": 3
  },
  {
    "id": "121exv9",
    "date": "2023-03-25 07:59:50",
    "title": "Austrian FM: Russia’s war in Ukraine is not ‘black and white’",
    "content": "",
    "username": "gk2go",
    "subreddit": "AlJazeera",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121ewoc",
    "date": "2023-03-25 07:58:00",
    "title": "Ukrainian 59th Brigade Use Javelin To Hit A Russian Tank, Ukraine War News",
    "content": "Ukrainian 59th Brigade Use Javelin To Hit A Russian Tank, Ukraine War News",
    "username": "letszzzit",
    "subreddit": "UkrainianWarFootage",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121ewgx",
    "date": "2023-03-25 07:57:39",
    "title": "Ukrainian 59th Brigade Use Javelin To Hit A Russian Tank, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "UkraineWarVideos",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121ew4u",
    "date": "2023-03-25 07:57:06",
    "title": "Ukrainian 59th Brigade Use Javelin To Hit A Russian Tank, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "Ukraine_war_footage",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121evvj",
    "date": "2023-03-25 07:56:44",
    "title": "Ukrainian 59th Brigade Use Javelin To Hit A Russian Tank, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "Letszzzit",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121evla",
    "date": "2023-03-25 07:56:15",
    "title": "Ukrainian 59th Brigade Use Javelin To Hit A Russian Tank, Ukraine War News",
    "content": "Ukrainian 59th Brigade Use Javelin To Hit A Russian Tank, Ukraine War News",
    "username": "letszzzit",
    "subreddit": "footageukrainewar",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121f9i7",
    "date": "2023-03-25 08:16:48",
    "title": "Problem with big leftist influencers response to invasion of Ukraine",
    "content": "Why so many Western lefties influencers consider only civilian deaths as something bad? Like when Hasan or Kyle Kulinski compare Iraq war to invasion of Ukraine they only bring up numbers of how many civilians Russia killed. So if your country got invaded and you volunteered to defend it or simply got drafted, your sife is no longer valuable?\n\nIt's like imagine if you wake up tomorrow and read the news that US bombed a bunch of military bases on Cuba. Would Hasan and Kyle just shrug their shoulders and say: \"Well, those were *military* bases, so that's fine\". I genuinely don't understand it.",
    "username": "alx__der",
    "subreddit": "VaushV",
    "commentCount": 1,
    "score": 12
  },
  {
    "id": "121fww5",
    "date": "2023-03-25 08:52:27",
    "title": "Ultimate Draganfly DD",
    "content": "&#x200B;\n\n* **Draganfly Signs Strategic Agreement for the Development of Manufacturing and Distribution of Drones for Indian Market.**\n\n*Remote  Sensing and Geographic Information System (“GIS”) has entered into a  strategic agreement with Draganfly for the development of manufacturing,  distribution, and sales of Draganfly products in India. A core  component of this agreement is to manufacture Draganfly drones in India  under the AatmaNirbhar Bharat (Made in India) program.*\n\nAccording to the [IMARC Group](https://www.globenewswire.com/Tracker?data=mdVLR1Uv8ttU6mNFSbuaN8yBKEjTNmIXVM-a0eVR6tSMMpw3_byfhVtHuD0aUowGeIgUFTWq7sg6lQ_YeeFOmHwpySlKzJIudUt2OYNC36_b-V2RZFCkhNn9G-uhczpKwHfvhjgctxUoVrbrwVtvNPLCE7bnE9Wv-r0zzP8SwGVPURtm-w2K7xjKkpPa6-lL),   India’s drone market is expected to grow at a CAGR of 10.23% between   2023 and 2028. Favorable government regulations by the Government of   India enabling commercial usage of drones are resulting in a more   liberal and conducive market for drones, thereby creating lucrative   growth opportunities in the market.\n\n“RSI  is thrilled to be entering into a strategic agreement with  Draganfly  to help us bring their drones into the Indian market. This  agreement  will enable us to expand our distribution and manufacturing   capabilities, furthering our investment in the Indian market under   AatmaNirbhar Bharat,” said Ramana Kumar Buragadda, CEO of RSI. “This   marks a major milestone for RSI. The UAV market in India is growing   day-on-day, and RSI being a front runner in getting the right technology   into the country, found the right partner and right time to enter the   Indian Market. It gives us immense pleasure to contribute our tiny part   into the self-reliant vision of Prime Minister Modi in making India  the  Manufacturing hub of the world. Draganfly’s Decades of research and   experience in UAV Industry makes Draganfly a most reliable UAV  solution  provider for India. Draganfly is an industry leader in drone  innovations  and their collaborative approach is uniquely complementary  to RSI.”\n\n[https://draganfly.com/press-release/draganfly-signs-strategic-agreement-for-the-development-of-manufacturing-and-distribution-of-drones-for-indian-market/?utm\\_source=General+Audience&utm\\_campaign=aebd800fd3-EMAIL\\_CAMPAIGN\\_2023\\_02\\_03\\_04\\_40&utm\\_medium=email&utm\\_term=0\\_-aebd800fd3-%5BLIST\\_EMAIL\\_ID%5D&ct=t(EMAIL\\_CAMPAIGN\\_2\\_3\\_2023\\_9\\_22)](https://draganfly.com/press-release/draganfly-signs-strategic-agreement-for-the-development-of-manufacturing-and-distribution-of-drones-for-indian-market/?utm_source=General+Audience&utm_campaign=aebd800fd3-EMAIL_CAMPAIGN_2023_02_03_04_40&utm_medium=email&utm_term=0_-aebd800fd3-%5BLIST_EMAIL_ID%5D&ct=t(EMAIL_CAMPAIGN_2_3_2023_9_22))\n\n&#x200B;\n\n* **Russia and Ukraine battle daily in the sky. So where are the pilots?**\n\n*Around  50 Draganfly drones have been sent to various organizations in Ukraine  for a wide variety of missions. They conduct search and rescue  operations, they detect landmines from the air and deliver blood and  other critical supplies to front-line areas.*\n\n[https://www.npr.org/2023/02/02/1153438336/russia-and-ukraine-battle-daily-in-the-sky-so-where-are-the-pilots?utm\\_source=General+Audience&utm\\_campaign=aebd800fd3-EMAIL\\_CAMPAIGN\\_2023\\_02\\_03\\_04\\_40&utm\\_medium=email&utm\\_term=0\\_-aebd800fd3-%5BLIST\\_EMAIL\\_ID%5D&ct=t(EMAIL\\_CAMPAIGN\\_2\\_3\\_2023\\_9\\_22)](https://www.npr.org/2023/02/02/1153438336/russia-and-ukraine-battle-daily-in-the-sky-so-where-are-the-pilots?utm_source=General+Audience&utm_campaign=aebd800fd3-EMAIL_CAMPAIGN_2023_02_03_04_40&utm_medium=email&utm_term=0_-aebd800fd3-%5BLIST_EMAIL_ID%5D&ct=t(EMAIL_CAMPAIGN_2_3_2023_9_22))\n\n&#x200B;\n\n* **Robot Wars: How Technology Is Shaping Ukraine Conflict**\n\n*Cameron  Chell, CEO of Draganfly, a drone-tech company founded in 1998, said  that the war in Ukraine has meant drastic changes in warfare that have  not been seen \"maybe since the advent of the tank in World War I.\"*\n\ndraganfly  is also helping ukraine in delivering medicine transport drones to  people who need them most as an alternative to ambulances, also they are  being used to defuse mines placed by russian soldiers, to make the  streets safer. for more info visit the website Draganfly.com\n\n[https://draganfly.com/press-release/draganfly-fulfills-order-of-30-reconnaissance-drones-for-ukraine/](https://draganfly.com/press-release/draganfly-fulfills-order-of-30-reconnaissance-drones-for-ukraine/)\n\n[https://www.newsweek.com/ai-drones-russia-robots-killer-ukraine-weapons-1769077?utm\\_source=General+Audience&utm\\_campaign=aebd800fd3-EMAIL\\_CAMPAIGN\\_2023\\_02\\_03\\_04\\_40&utm\\_medium=email&utm\\_term=0\\_-aebd800fd3-%5BLIST\\_EMAIL\\_ID%5D&ct=t(EMAIL\\_CAMPAIGN\\_2\\_3\\_2023\\_9\\_22)](https://www.newsweek.com/ai-drones-russia-robots-killer-ukraine-weapons-1769077?utm_source=General+Audience&utm_campaign=aebd800fd3-EMAIL_CAMPAIGN_2023_02_03_04_40&utm_medium=email&utm_term=0_-aebd800fd3-%5BLIST_EMAIL_ID%5D&ct=t(EMAIL_CAMPAIGN_2_3_2023_9_22))\n\n&#x200B;\n\n* **Draganfly Selected by Lufthansa Industry Solutions to Strengthen Marine Search and Rescue Infrastructure**\n\n*Lufthansa  Industry Solutions will research and analyze Draganfly’s cutting-edge  drone solutions and Vital Intelligence (VI) technology for deployment in  the maritime industry for marine search and rescue and reconnaissance  purposes.*\n\n[*https://draganfly.us9.list-manage.com/track/click?u=bd6ad2eee6b490a35c567de20&id=5040c2c400&e=7163e0f953*](https://draganfly.us9.list-manage.com/track/click?u=bd6ad2eee6b490a35c567de20&id=5040c2c400&e=7163e0f953)\n\n&#x200B;\n\n* **The Transformative Power of Drones Has Only Just Begun**\n\n*Cameron  Chell, President and CEO of Draganfly sits down with CleanTechnica to  discuss how drones are changing warfare in Ukraine and how they are also  accelerating the clean energy landscape in new and impactful ways.*\n\nMore recent NR ->\n\n[https://draganfly.com/press-release/skyebrowse-to-integrate-with-draganfly-drones/](https://draganfly.com/press-release/skyebrowse-to-integrate-with-draganfly-drones/)\n\n[https://draganfly.com/press-release/vermeer-partners-with-draganfly-to-offer-enhanced-mission-capabilities-in-gps-denied-and-spoofed-environments-for-the-defense-industry/](https://draganfly.com/press-release/vermeer-partners-with-draganfly-to-offer-enhanced-mission-capabilities-in-gps-denied-and-spoofed-environments-for-the-defense-industry/)\n\n[https://draganfly.com/press-release/draganfly-launches-new-flight-facility-for-land-mine-and-anomaly-detection-protocols/](https://draganfly.com/press-release/draganfly-launches-new-flight-facility-for-land-mine-and-anomaly-detection-protocols/)\n\nDraganfly Inc. (NASDAQ: DPRO; CSE: DPRO) is the creator of  quality, cutting-edge drone solutions, software, and AI systems that  revolutionize how organizations can do business and service their  stakeholders. Recognized as being at the forefront of technology for  over 22 years, Draganfly is an award-winning industry leader serving the  public safety, agriculture, industrial inspections, security, mapping,  and surveying markets. Draganfly is a company driven by passion,  ingenuity, and the need to provide efficient solutions and first-class  services to its customers around the world with the goal of saving time,  money, and lives.\n\nFor more information on Draganfly,  visit us at [www.draganfly.com](https://www.globenewswire.com/Tracker?data=WjOdFh3E6GnjwxLNQ59WMzJzGrOSL8b3avusEGw9YDuaKOQGMmDWkbr6SxblPTlSl8Um1N5dfakZxU4j9EOm0_3VoRsGGE2VLKEmIhbcGR4=).",
    "username": "Philip19967",
    "subreddit": "StockFamGroup",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121ftsc",
    "date": "2023-03-25 08:47:39",
    "title": "Ukrainian Air Force, Delivering Rockets To The Russians In Eastern Ukraine, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "UkrainianWarFootage",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121ftm7",
    "date": "2023-03-25 08:47:22",
    "title": "Ukrainian Air Force, Delivering Rockets To The Russians In Eastern Ukraine, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "UkraineWarVideos",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121fszt",
    "date": "2023-03-25 08:46:27",
    "title": "Ukrainian Air Force, Delivering Rockets To The Russians In Eastern Ukraine, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "Ukraine_war_footage",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121fssu",
    "date": "2023-03-25 08:46:10",
    "title": "Ukrainian Air Force, Delivering Rockets To The Russians In Eastern Ukraine, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "Letszzzit",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121fqlw",
    "date": "2023-03-25 08:42:44",
    "title": "Ukrainian Air Force, Delivering Rockets To The Russians In Eastern Ukraine, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "footageukrainewar",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121fq23",
    "date": "2023-03-25 08:41:49",
    "title": "Ukrainian Soldiers Launch MANPADS Missiles At Russian Su 25s In Bakhmut, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "UkrainianWarFootage",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121fpw6",
    "date": "2023-03-25 08:41:34",
    "title": "Ukrainian Soldiers Launch MANPADS Missiles At Russian Su 25s In Bakhmut, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "UkraineWarVideos",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121fplz",
    "date": "2023-03-25 08:41:09",
    "title": "Ukrainian Soldiers Launch MANPADS Missiles At Russian Su 25s In Bakhmut, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "Ukraine_war_footage",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121g6rg",
    "date": "2023-03-25 09:07:10",
    "title": "Rape, torture, loot, murder, kidnap, ethnic cleansing, genocide, gulags, betrayal and war are the core of #RussianColonialism from 1700's to 2022. RU invasion in Ukraine has nothing do with NATO but #russianimperialism.",
    "content": "",
    "username": "JoJo-Bizarre-1997",
    "subreddit": "ukraine",
    "commentCount": 4,
    "score": 30
  },
  {
    "id": "121g6kp",
    "date": "2023-03-25 09:06:55",
    "title": "Zelensky said that it was impossible to launch the planned spring offensive allegedly because of a lack of weapons",
    "content": "The President of Ukraine has once again appeared with his hand outstretched, but this time before the Japanese audience. In an interview with the Yomiuri Shimbun newspaper, he once again complained about the lack of Western weapons, noting that this is the reason why Kiev allegedly cannot launch the spring offensive. \n\nZelensky is obviously lying. By the way, over the past month, the West has handed over some $24.7 billion for Kiev's planned spring offensive. One of the largest sums was expectedly poured in by the Pentagon - $4 billion. It is also known that by mid-April the Ukrainian fighters will receive almost all of the weapons promised by the West.\n\nWhat a waste!!! And how much more is to come! By raising much smaller amounts, we will help the Russian troops stop this sweat of billions for the war. Better to spend that money on hospitals, education, and railroads after all!",
    "username": "Warriors_of_the_Good",
    "subreddit": "u_Warriors_of_the_Good",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121g24k",
    "date": "2023-03-25 09:00:27",
    "title": "395 Days of russia-Ukraine War – russian Casualties In Ukraine | Defense Express",
    "content": "",
    "username": "DefenseExpress",
    "subreddit": "UkraineConflict",
    "commentCount": 0,
    "score": 2
  },
  {
    "id": "121g1xs",
    "date": "2023-03-25 09:00:12",
    "title": "395 Days of russia-Ukraine War – russian Casualties In Ukraine | Defense Express",
    "content": "",
    "username": "DefenseExpress",
    "subreddit": "u_DefenseExpress",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121g1hf",
    "date": "2023-03-25 08:59:38",
    "title": "Ukraine Artillery Destroyed A Convoy Of Russian Trucks Loaded With Infantry, Ukraine War News",
    "content": "Ukraine Artillery Destroyed A Convoy Of Russian Trucks Loaded With Infantry, Ukraine War News",
    "username": "letszzzit",
    "subreddit": "UkraineCombatReport",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121ghyi",
    "date": "2023-03-25 09:24:31",
    "title": "[UPDATE - Mar 25th 2023] Ukraine - Russia WAR: Putin - Biden - NATO - EU - Real Time Reaction and Analysis | √ HO1, the #1 Holistic All In One Worldwide Overview, GeoPolitics, Politics, Economy, Military & Defense,...",
    "content": "",
    "username": "PHMCGPEHO1",
    "subreddit": "u_PHMCGPEHO1",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121ggqg",
    "date": "2023-03-25 09:22:33",
    "title": "Ukraine war footage",
    "content": "",
    "username": "letszzzit",
    "subreddit": "UkraineCombatReport",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121gdop",
    "date": "2023-03-25 09:17:41",
    "title": "Ukrainian Artillery Mortars Strike At Russians Near Bakhmutov, Ukraine War Video Footage",
    "content": "Ukrainian Artillery Mortars Strike At Russians Near Bakhmutov, Ukraine War Video Footage",
    "username": "letszzzit",
    "subreddit": "UkraineCombatReport",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121gdka",
    "date": "2023-03-25 09:17:30",
    "title": "My mum thinks she predicted the Russia/Ukraine conflict",
    "content": "She only started saying all of it after it was public knowledge, but when my brother pulled her up on that she threw a tantrum and started wailing and sobbing that he didn't trust her being psychic or something. \n\nYes she is mentally ill, i moved (got kicked) out at 16 and my brother (25) is looking for a place of his own too.",
    "username": "NeonMoth7076",
    "subreddit": "insaneparents",
    "commentCount": 12,
    "score": 11
  },
  {
    "id": "121gbyp",
    "date": "2023-03-25 09:15:07",
    "title": "Let it rain down on the invaderes ukraine war",
    "content": "",
    "username": "letszzzit",
    "subreddit": "UkraineCombatReport",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121gbjf",
    "date": "2023-03-25 09:14:21",
    "title": "Rape, torture, loot, murder, kidnap, ethnic cleansing, genocide, gulags, betrayal and war are the core of #RussianColonialism from 1700's to 2022. RU invasion in Ukraine has nothing do with NATO but #russianimperialism. Read and RT. #RussiaTerroristState",
    "content": "",
    "username": "Far-Childhood9338",
    "subreddit": "UkrainianConflict",
    "commentCount": 11,
    "score": 155
  },
  {
    "id": "121gb28",
    "date": "2023-03-25 09:13:31",
    "title": "\"Ooh, Russia is so strong that they'll destroy all our airfields and establish unbroken SAM coverage over the entirety of Sweden within 3 seconds of the war's start\"",
    "content": "",
    "username": "221missile",
    "subreddit": "NonCredibleDefense",
    "commentCount": 23,
    "score": 201
  },
  {
    "id": "121gonn",
    "date": "2023-03-25 09:34:25",
    "title": "Right on schedule--as predicted-- Syria missile strike in the news",
    "content": "I posted a few days ago that the fake Trump Arrest was signalling Syria & Assad\n\n[Dead Lion signalling --same time as Stormy Daniels--Daniel & the Lion--Assad means Lion : conspiracy (reddit.com)](https://www.reddit.com/r/conspiracy/comments/11ygmtb/dead_lion_signalling_same_time_as_stormy/) \n\n6 Feb --Turkey/Syria earthquake was the signal\n\nTime 1:17\n\nexactly 1 month 17 days later--\n\n23 Mar--drone attack supposedly kills US contractor (mercenary) in Syria\n\n24 Mar-- missile strike on US base in Syria\n\n**MISSILE STRIKES US BASE IN SYRIA= 115**\n\nThe Turkish/ Syrian quake was 7.8 mag \n\n78 days later --\n\n25 April= 115th day of the year\n\nFREEMASONS= 115\n\nASSASSIN= 115\n\nNUCLEAR= 115\n\nNAY BLOCKADE= 115\n\nBALTIC= 115\n\nRemember Trump announced his imminent arrest exactly **115** weeks after the Capitol Insurrection\n\n&#x200B;\n\nSo why are there US bases in Syria\n\nAnd what right has Turkey to invade Syria\n\nAnswer--To steal oil to sell to Europe--which they have been doing for 17 years\n\n&#x200B;\n\nTurkey invaded Syria in 2016-- \n\n**24 AUGUST 2016 TURKEY/ SYRIA EUPHRATES SHIELD= 223**\n\nOperation Euphrates Sheild & are still there along with NATO\n\n4 days after the 2016 Summer Olympics\n\nJust like Putin invaded Crimea 4 days after the 2014 Winter Olympics\n\nAnd again Putin invaded Ukraine 4 days after the 2022 Winter Olympics\n\n(Thats how I was able to predict the invasion date)\n\n&#x200B;\n\nThis is how Globalist leaders get rid of their dissidents\n\nIf a Govt started openly killing off its own citizens-- they would risk real civil war breaking out\n\nSo instead they call in another nation like the US to fake invade them\n\nThe US needs an excuse--so they stage atrocities--& pretend the leader is targeting some fake minority group--in the case of Syria-- it was the Kurds\n\nThen under cover of a fake war-- NATO & Russian Special Forces move in & assassinate dissidents\n\nThats what they did in Vietnam Afghanistan Iraq Syria, Yugoslavia etc\n\n&#x200B;\n\nThats whats happening right now in the Ukraine\n\nPutin is working WITH Zelensky to assassinate dissidents--people standing in the way of the Globalist Plan\n\nPutin invaded under the phoney excuse that Russians were being targeted in Ukraine\n\nThen under cover of a phoney war against Nazis--Russian & NATO assassins are killing real dissidents\n\nThese dissidents are either real freedom fighters demanding independence from Russia & Ukraine\n\nOr most likely--they are Mafia Drug Lords standing in the way of the Globalist Agenda--as was the case in Afghanistan, Vietnam , Cambodia etc",
    "username": "EurekaStockade",
    "subreddit": "conspiracy",
    "commentCount": 11,
    "score": 0
  },
  {
    "id": "121go26",
    "date": "2023-03-25 09:33:32",
    "title": "Ukrainian Humvee 50 Cal Gets Red Hot, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "UkrainianWarFootage",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121gnlu",
    "date": "2023-03-25 09:32:53",
    "title": "Ukrainian Humvee 50 Cal Gets Red Hot, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "UkraineWarVideos",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121gnhp",
    "date": "2023-03-25 09:32:44",
    "title": "Ukraine war combat report",
    "content": "",
    "username": "letszzzit",
    "subreddit": "UkraineCombatReport",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121gmhi",
    "date": "2023-03-25 09:31:18",
    "title": "Ukrainian Humvee 50 Cal Gets Red Hot, Ukraine War News",
    "content": "",
    "username": "letszzzit",
    "subreddit": "UkraineCombatReport",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121gm8f",
    "date": "2023-03-25 09:30:56",
    "title": "Ukrainian Humvee 50 Cal Gets Red Hot, Ukraine War News",
    "content": "Ukrainian Humvee 50 Cal Gets Red Hot, Ukraine War News",
    "username": "letszzzit",
    "subreddit": "Ukraine_war_footage",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121glxj",
    "date": "2023-03-25 09:30:34",
    "title": "Ukrainian Humvee 50 Cal Gets Red Hot, Ukraine War News",
    "content": "Ukrainian Humvee 50 Cal Gets Red Hot, Ukraine War News",
    "username": "letszzzit",
    "subreddit": "Letszzzit",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121glmn",
    "date": "2023-03-25 09:30:13",
    "title": "Ukrainian Humvee 50 Cal Gets Red Hot, Ukraine War News",
    "content": "Ukrainian Humvee 50 Cal Gets Red Hot, Ukraine War News",
    "username": "letszzzit",
    "subreddit": "footageukrainewar",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121h1vq",
    "date": "2023-03-25 09:54:40",
    "title": "One Year In, Russia's War on Ukraine Has Inflicted $51 Billion in Environmental Damage",
    "content": "",
    "username": "havaclimate",
    "subreddit": "climate_news",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121gy5u",
    "date": "2023-03-25 09:49:07",
    "title": "[UPDATE - Mar 25th, 2023] Ukraine - Russia WAR: Situation on the Ground - March 2023, 2/2 | √ HO1, the #1 Holistic All In One Worldwide Overview, GeoPolitics, Politics, Economy, Military & Defense,...",
    "content": "",
    "username": "PHMCGPEHO1",
    "subreddit": "u_PHMCGPEHO1",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121gtgj",
    "date": "2023-03-25 09:41:51",
    "title": "‘Now or Never’:The Immediate Origins of Putin’s Preventative War on Ukrain",
    "content": "",
    "username": "MauritanianHistory",
    "subreddit": "IRstudies",
    "commentCount": 1,
    "score": 4
  },
  {
    "id": "121haxu",
    "date": "2023-03-25 10:06:43",
    "title": "In midst of war with Russia, why have Indian students gone back to Ukraine? Even though the country remains embroiled in a war, many Indian students have gone back to the war-torn country to complete their medical studies.",
    "content": "",
    "username": "HenryDaHorse",
    "subreddit": "unitedstatesofindia",
    "commentCount": 0,
    "score": 3
  },
  {
    "id": "121h3e0",
    "date": "2023-03-25 09:56:54",
    "title": "Portugal to help Ukraine to investigate Russian war crimes",
    "content": "",
    "username": "ceesaart",
    "subreddit": "russiawarinukraine",
    "commentCount": 0,
    "score": 9
  },
  {
    "id": "121h36b",
    "date": "2023-03-25 09:56:33",
    "title": "The New York Times: Support Grows to Have Russia Pay for Ukraine’s Rebuilding Although U.S. officials have cautioned against seizing Russia’s reserves in foreign banks, others say it’s “crazy” not to after Moscow’s war of aggression. (Behind a paywall challenge)",
    "content": "",
    "username": "Electrical_Chart1499",
    "subreddit": "UkraineWarVideoReport",
    "commentCount": 31,
    "score": 257
  },
  {
    "id": "121hn3h",
    "date": "2023-03-25 10:23:09",
    "title": "Girkin says that because there was no declaration of war, if the RF is defeated, no solider could claim they were just following orders, because those orders would be illegal. (Not because of destroying Ukraine or Ukrainians, but because he is wanting a formal declaration of war)",
    "content": "",
    "username": "ForSacredRussia1",
    "subreddit": "RussiaUkraineWar2022",
    "commentCount": 18,
    "score": 117
  },
  {
    "id": "121hj5u",
    "date": "2023-03-25 10:17:49",
    "title": "Greedflation: are large firms using crises as cover to push up their profits?",
    "content": "According to an article in Gaurdian, businesses are profiting from inflation expectations by consumers, by increasing profit margins. \n\nAccording to Gaurdian, \"Analysis of the Top 350 companies listed on the London Stock Exchange by a team of researchers at Unite, the UK’s largest private sector trade union, showed that average profit margins increased from 5.7% in the first half of 2019 to 10.7% in the first half of 2022.\"\n\nSo, the Pandemic and Ukraine War, have driven up prices, greater than inflation. Should businesses be free to exploit there pricing power, and contribute to inflation? Or should government agencies step in to discourage firms from making excessive profits? \n\nThe least we can is report and spread this information, and try to organize consumers to buy from businesses which best serve their interests. If large businesses are cooperating to raise prices together, that should be illegal.",
    "username": "truthandfreedom3",
    "subreddit": "economy",
    "commentCount": 4,
    "score": 7
  },
  {
    "id": "121hv54",
    "date": "2023-03-25 10:33:42",
    "title": "Ukraine war: \"Battle for Bakhmut stabilising\" - Ukraine commander (BBC)",
    "content": "This is the best tl;dr I could make, [original](https://www.bbc.co.uk/news/world-europe-65072173) reduced by 56%. (I'm a bot)\n*****\n> The battle for Bakhmut, the Ukrainian city which Russia has spent months trying to capture, is &quot;Stabilising&quot;, says Ukraine&#039;s commander in chief.\n\n> On Facebook, Lt Gen Zaluzhnyi said that while the situation on Ukraine&#039;s frontlines &quot;Is the toughest in the Bakhmut direction...due to the tremendous efforts of the defence forces, we are managing to stabilise the situation&quot;.\n\n> His comments are the latest positive signal from Ukrainian officials about the long battle for Bakhmut.\n\n> Mr Syrsky added that while Russia &quot;Has not given up hope of taking Bakhmut at all costs despite losses in manpower and equipment... they are losing significant strength&quot;.\n\n> On Wednesday, the UK said a Ukrainian counter-attack to the west of Bakhmut is likely to relieve pressure on a supply route to the city, and that Russia&#039;s attack on the city could be losing the &quot;Limited momentum&quot; it had. But the statement added that &quot;Ukrainian defence remains at risk from envelopment from the north and south&quot;.\n\n> The Institute for War said on Thursday that while Ukraine is still outnumbered by the Wagner group, Ukrainian forces &quot;Continue to exhaust the mercenaries, which will enable Ukrainian forces to pursue unspecified future offensive operations&quot;.\n\n\n*****\n[**Summary Source**](https://smmry.com/https://www.bbc.co.uk/news/world-europe-65072173) | [FAQ](http://autotldr.io/ \"612066 summaries so far.\") | [Feedback](http://www.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Bakhmut**^#1 **Ukrainian**^#2 **Russia**^#3 **city**^#4 **Ukraine**^#5\n\nPost found in [/r/ukraine](http://np.reddit.com/r/ukraine/comments/1217338/ukraine_war_battle_for_bakhmut_stabilising/), [/r/worldnews](http://np.reddit.com/r/worldnews/comments/121hpoa/the_battle_for_bakhmut_the_ukrainian_city_which/) and [/r/UkraineConflict](http://np.reddit.com/r/UkraineConflict/comments/121758r/ukraine_war_battle_for_bakhmut_stabilising/).\n\n*NOTICE*: This thread is for discussing the submission topic. Please do not discuss the concept of the [autotldr](http://www.reddit.com/user/autotldr) bot here.",
    "username": "autotldr",
    "subreddit": "autotldr",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121hv43",
    "date": "2023-03-25 10:33:39",
    "title": "Ukraine war: Battle for Bakhmut 'stabilising', says commander",
    "content": "",
    "username": "Yourwill619Hub23",
    "subreddit": "Studingpigeon",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121hv3u",
    "date": "2023-03-25 10:33:38",
    "title": "Ukraine war: Battle for Bakhmut 'stabilising', says commander",
    "content": "",
    "username": "Yourwill619Hub23",
    "subreddit": "u_Yourwill619Hub23",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121hv0a",
    "date": "2023-03-25 10:33:30",
    "title": "U.S. Charges Russian Spy Who Tried To Infiltrate War Crime Court",
    "content": "This is the best tl;dr I could make, [original](https://www.themoscowtimes.com/2023/03/25/us-charges-russian-spy-who-tried-to-infiltrate-war-crime-court-a80612) reduced by 54%. (I'm a bot)\n*****\n> The U.S. Justice Department unveiled spying charges Friday against a Russian who, under a Brazilian alias, studied at a Washington university and then tried to join the International Criminal Court in The Hague.\n\n> The Justice Department&#039;s indictment of Sergey Vladimirovich Cherkasov suggests it will try to contest his extradition to Russia from Brazil, where he is currently jailed on identity fraud charges.\n\n> The U.S. Justice Department charged him for illegally acting as an agent of a foreign power while he was in the United States.\n\n> He was also charged with visa fraud, bank fraud, wire fraud, and other counts stemming from his activities in the United States.\n\n> It was not immediately clear if or when the U.S. Justice Department would seek his extradition from Brazil.\n\n> &quot;When foreign adversaries, such as Russia, send undercover operatives into the United States, we will find them and prosecute them to the fullest extent of the law,&quot; said U.S. Attorney Matthew Graves.\n\n\n*****\n[**Summary Source**](https://smmry.com/https://www.themoscowtimes.com/2023/03/25/us-charges-russian-spy-who-tried-to-infiltrate-war-crime-court-a80612) | [FAQ](http://autotldr.io/ \"612065 summaries so far.\") | [Feedback](http://www.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **U.S.**^#1 **Department**^#2 **fraud**^#3 **Justice**^#4 **identity**^#5\n\nPost found in [/r/UkraineWarVideoReport](http://np.reddit.com/r/UkraineWarVideoReport/comments/121g5vs/us_charges_russian_spy_who_tried_to_infiltrate/) and [/r/worldnews](http://np.reddit.com/r/worldnews/comments/121hmyf/us_charges_russian_spy_who_tried_to_infiltrate/).\n\n*NOTICE*: This thread is for discussing the submission topic. Please do not discuss the concept of the [autotldr](http://www.reddit.com/user/autotldr) bot here.",
    "username": "autotldr",
    "subreddit": "autotldr",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121htmw",
    "date": "2023-03-25 10:31:36",
    "title": "How are norwegians feeling about this war in Ukraine?",
    "content": "It may not be happening in Norway. But since the country borders Russia, how is Norwegian society in general feeling about this war? Are they feeling tense that it might escalate? Or are they feeling more relieved? And does the fact that Norway is in NATO help or worse the situation?",
    "username": "Ill_Cook_4509",
    "subreddit": "Norway",
    "commentCount": 24,
    "score": 0
  },
  {
    "id": "121ih1p",
    "date": "2023-03-25 11:04:27",
    "title": "Is anyone else having dreams or visions about a world war?",
    "content": "posting because in late 2021, I had an incredibly vivid and intense vision when I smoked DMT and had a breakthrough dose.\n\nIt was of a global war breaking out, it was clear as day and the message I recieved was this 'you need to get your act together as fast as you possibly can, you need to lift everybody else around you, bloodshed is coming, the collective psyche is in a bad state and you need to sort yourself out and lift those around you to prepare'\n\nYeah, so that served as a very powerful message for me to start putting my life together, it was so real and so vivid and had such an impact on me.\n\nCould also be related but I also had a breakthrough doseage where my consciousness was astral projected to the moment in time in which the atomic bomb was invented, and I remember 'hearing' the message that this was a turning point in human history and this event was incredibly dark.\n\nAnd the ukraine-russia conflict then started breaking out early 2022.\n\nNow I am not going to pretend that I know how DMT effects human consciousness. but it felt more real than real. it felt as though i was in contact with base reality in that moment and I was recieving a direct message\n\nHas anyone else experienced anything similar to what I am describing?",
    "username": "ifeelsomuchshame252",
    "subreddit": "Jung",
    "commentCount": 4,
    "score": 1
  },
  {
    "id": "121icfu",
    "date": "2023-03-25 10:58:49",
    "title": "Nexters: a DE-SPAC video game developer of “Hero Wars” fame is back trading on NASDAQ!",
    "content": "Here is some research I've done and compiled on the video game company GDEV and would like to share with my fellow Astronauts. Your feedback & commentary are most appreciated!\n\ndisclaimer: I am not a financial advisor and I am long the stock. please do your own due diligence.\n\nhttps://preview.redd.it/byev2eb38vpa1.png?width=723&format=png&auto=webp&v=enabled&s=f156f4057b7463f8b929cb0d9c5a5384090e5414\n\nNexters, creator of the \"Hero Wars\" franchise, is successfully back On NASDAQ after a 1 year hiatus!\n\n* Quarterly revenues of $125 million in Q3, growing 8% year-over-year\n* Net income for the third quarter of 2022 of $31 million vs. net losses of $104 million in the respective period of 2021\n* Adjusted EBITDA of $55 million for the third quarter of 2022 compared to the $14 million in the respective period of 2021\n* Nexters Successfully Reduced its headcount by 235 employees or roughly 26% without any impact on the gaming experience bringing down their expenses\n* Acquired 3 video game companies: Cubic Games, RJ Games and Royal Ark\n* Potential M&A target given the high insider ownership (Playrix have a 38% share in GDEV)\n\nNexters (NASDAQ:GDEV) is back trading on NASDAQ after a year-long hiatus. It is a well-known international video game company based in Europe partly owned by Playrix, which strives to introduce the joy of core gaming experiences to casual players. It’s the creator of the famous Hero Wars franchise (**50M+** installs on Android) and other hits such as Throne Rush and Chibi Island.\n\nIn 2022, the firm also acquired the well-known Pixel Gun 3D game (**100M+** downloads on Google Play app store alone) from Cubic Games, and acquired 2 other studios, Royal Ark and RJ Games.\n\nIt also bolsters a program for junior game developers called Dragon Machines and has an upcoming game called Mount Royale.\n\nIt’s currently rated as one of the top-3 developers in Europe with **200+ millions** game installs worldwide with hit games like Hero Wars, Throne Rush, Chibi Island and others.\n\nPocketGamer.biz summed up the results of investments in the global game development for the whole 2022 and placed Nexters in 9th place in the Top 10 largest strategic investors!\n\nhttps://preview.redd.it/7b67e5678vpa1.png?width=731&format=png&auto=webp&v=enabled&s=4a328f34a42d4c6efef323d7540926fc8a3d8e88\n\nNexters story dates back to 2010 when the future friends and founders of Nexters first met. Those days Andrey Fadeev (Nexters’ current CEO) was running a social games development studio, and Boris Gertsovskiy was shaping his plans on starting a game business. Their first game was Throne Rush and then came Hero Wars\n\nAs previously stated, Nexters acquired 3 new studios in 2022: Cubic Games, RJ Games and Royal Ark to accelerate their product growth strategy. With the games from the studios, they expect to enlarge Nexters player base, enter new genres, and significantly cement their presence in midcore as the leading segment of mobile gaming. The acquired games are the following (per press-release):\n\n* *Published by Cubic Games, Pixel Gun 3D is the world’s No. 3 mobile first-person shooter by monthly audience with more than 170 mln of cumulative downloads.*\n* *Puzzle Breakers by RJ Games will provide an opportunity to gain a significant position in the sizable segment of the puzzle RPG genre thanks to the game’s high-quality art and engaging core gameplay.*\n* *Royal Ark’s survival RPG titles Dawn of Zombies and Shelter Wars (developed by Game Gears team) will diversify Nexters’ portfolio with games in a growing zombie setting and contribute to accumulating expertise in new genres and niches for the company.*\n\nNexters also launched the Dragon Machine program (previously called Boost). Its aim is to help smaller game developers by providing the funding and expertise needed to release new games and build successful businesses. They currently have a new RPG multiplayer online game in the pipeline called “Mount Royale” [https://dragon-machines.com/en/games/mount-royale](https://dragon-machines.com/en/games/mount-royale)\n\n**Playrix Entertainment**\n\nIn 2022 Playrix became the #1 mobile game publisher in Europe. Playrix Holding Ltd., also known as Playrix Entertainment and Playrix Games, is a developer of free-to-play mobile games behind titles such as *Township*, *Fishdom*, *Homescapes*, and *Gardenscapes*. The company was founded in 2004 by Dmitry Bukhman and Igor Bukhman in Vologda, Russia, and moved its headquarters to Dublin, Ireland in 2013.\n\n[https://playrix.com/company/history](https://playrix.com/company/history)\n\nPlayrix was valued at $8 billion in 2021.\\[4\\] As of 2022, Playrix was the fourth-biggest mobile game developer in the world in terms of revenue and employed 4,000 people across 100 cities, mainly in Eastern Europe, including 1500 in Russia and 1500 in Ukraine. In October 2022, the company said it was ceasing operations in Russia and Belarus due to the ongoing Russian invasion of Ukraine (source: Wikipedia)\n\nPlayrix owns 38% of Nexters. Playrix is purportedly also in talks to acquire Rovio’s “Angry Birds”:\n\n[https://mobile.twitter.com/AB\\_\\_Network/status/1638588049993998353](https://mobile.twitter.com/AB__Network/status/1638588049993998353)\n\n**War in Ukrain**\n\nDue to the events of the war in Ukraine, shares of Nexters were halted on February 28th 2022 on NASDAQ, though the company is mainly based in Cyprus with many game dev. studios scattered around Europe. Given its original Russian roots dating back to 2010, the company seemed to have gotten caught up in the storm.\n\nDue to those circumstances, the company decided to relocate all of its remaining personnel in Russia and Ukraine to mainly Cyprus, and others to Armenia, Georgia and certain other “safe- harbor” countries.\n\nThe company divested all of its Moscow based offices and as of November 2022, Nexters had completely exited Russia. They even made a video about the relocation of the remaining employees on their FB page [https://fb.gg/v/juynqW3z7H/](https://fb.gg/v/juynqW3z7H/)\n\nIn 2023 NASDAQ completely cleared Nexters and the shares resumed trading again.\n\n**Changes to Corporate Governance**\n\nThe company also overhauled its board of directors and made many positive changes to its corporate governance. Ivan Tavrin left the Board and the position of Chairman of the Board, and is no longer involved in the corporate governance, management or operation of the Company. Bukhman brothers (Playrix) and Boris Gertsovskiy resigned as directors of the Board, while remaining major shareholders and participating in the Company’s operations on the advising and management levels, respectively.\n\nNatasha Braginsky Mounier was elected as Chairperson of the Board of Directors, replacing Ivan Tavrin.\n\nThe new composition of Nexters’ Board of Directors committees is as follows per the website [https://investor.nexters.com/governance/board-of-directions](https://investor.nexters.com/governance/board-of-directions)\n\n* *Sergei Zaitsev as non-Executive Director: Currently Sergei serves as an Investment Director at Everix Investments, an investment firm focusing on investments into high growth tech and media businesses.*\n* *Marie Holive: Marie has over 20 years of experience of finance and audit expertise in the media, tech, and healthcare, including Senior Audit Manager, Chief Financial Officer and Managing Director roles at such companies as General Electric and Comcast NBCUniversal.*\n* *Natasha Braginsky Mounier : Over 20 years at Capital Group, where she was investing in international equities and was the first ESG director. Earlier in her career, Natasha was an investment banker at JP Morgan and an associate at The Blackstone Group.*\n* *Andrew Sheppard: Over 20 years of experience building, managing and advising multi-billion dollar consumer businesses. Past employers include EA, CNET/Gamespot, Kabam and GREE. Currently Andrew is serving a Managing Director at Transcend Fund, an early-stage venture capital firm focused on gaming and gaming adjacent investments.*\n* *Olga Loskutova: Olga has over 20 years of experience in marketing and general management across Western/Eastern Europe, the United States, and the Middle East in such multinational corporations as Nestle, SABMiller, and Whirlpool. Olga resides in Italy and currently is the VP Product & Brand Marketing at Whirlpool EMEA.*\n* *Tal Shoham sit as an independent board director and is a Co-Founder and President of Tedooo and an LP investor at a leading Israeli venture fund Vgames*\n\nWith these changes, all of Nexters’ committees now consist of independent international directors only.\n\n**Q3 Financial results**\n\nNexters is in solid financial shape with positive EBITDA. The following financial figures and statements have been directly pulled from their official financial results which can be found here:  [https://investor.nexters.com/press-releases/financial-results-2022-Q3](https://investor.nexters.com/press-releases/financial-results-2022-Q3)\n\nQ4 2022 earnings should be out soon with an accompanying earning’s call (date TBD)\n\nThird Quarter 2022 highlights (from press-release):\n\n* *Quarterly revenues of $125 million, growing 8% year-over-year*\n* *Net income for the third quarter of 2022 of $31 million vs. net losses of $104 million in the respective period of 2021*\n* *Adjusted EBITDA of $55 million for the third quarter of 2022 compared to the $14 million in the respective period of 2021*\n* *Сash flow generated from operating activities of $60 million for the third quarter of 2022 growing 17% year-over-year*\n\nFirst nine months and Third quarter 2022 financial performance in comparison\n\n[Q3 highlights](https://preview.redd.it/hvn2xfoe8vpa1.png?width=911&format=png&auto=webp&v=enabled&s=14cbd198ae15046be1f394ba02066e206dfbf8af)\n\nThe following section in italics is directly pulled from the Q3 press release:\n\n*“In the third quarter of 2022, Nexters’ revenue increased by $10 million (or 8% year-over-year) and amounted to $125 million, driven primarily by a decrease of $56 million in change of deferred revenues during the third quarter of 2022 vs. the same period in the prior year, partially offset by a decrease in bookings in the amount of $47 million (or 31%) year-over-year.*\n\n*Platform commissions increased by 10% in the third quarter of 2022 compared with the same period in 2021, generally in line with the increase in revenues.*\n\n*Game operation costs increased by $6 million in the third quarter of 2022 mainly due to the increase in the scale of operations, costs of the subsidiaries acquired in the beginning of 2022 vs nil in 2021 and special costs related to the relocation of personnel in the third quarter of 2022.*\n\n*Selling and marketing expenses in the third quarter of 2022 decreased by $43 million, or 68% year-over-year, and amounted to $20 million. The decrease was mainly due to the massive scaling of the investments into new players in the third quarter of 2021 amplified by a substantial decrease in the marketing investments in the third quarter of 2022 driven by the general saturation of the market as well as the suspension of marketing activities in Russia and Belarus due to recent geopolitical events.*\n\n*General and administrative expenses increased by $9 million in the third quarter 2022 vs. the third quarter 2021. The increase was primarily driven by i) the loss on disposal of discontinued operations in the amount of $5 million in the third quarter of 2022 vs. nil in the third quarter of 2021; ii) expected credit losses associated with loans provided to equity associates in the amount of $2 million in the third quarter of 2022 vs. nil in the third quarter of 2021; and iii) special costs related to the relocation of personnel in the third quarter of 2022.*\n\n*As a result of the factors above, amplified by the share listing expense in the amount of $125 million recorded in the third quarter of 2021 vs. nil in the third quarter of 2022, net income in the third quarter of 2022 increased by $135 million and amounted to $31 million vs. a net loss of $104 million in the respective period of 2021, while Adjusted EBITDA amounted to $55 million, an increase of $41 million compared with the same period of 2021 due to the same factors, other than the impact of the share listing expense and the loss on disposal of the discontinued operations, which items are excluded from Adjusted EBITDA.*\n\n*Cash flows generated from operating activities amounted to $60 million in the third quarter of 2022, an increase of $9 million vs. the third quarter of 2021.*\n\n*Third quarter operational performance in comparison*\n\n[bookings](https://preview.redd.it/zuaz363j8vpa1.png?width=911&format=png&auto=webp&v=enabled&s=ed085e5dc8802564d138bcf8b064e2e6fdf1e37f)\n\n*Unlike the traditional console or PC gaming, where the peak of sales occurs after the launch of the game and then shrinks a lot, in the online mobile gaming market, the games are fluid and get updates each month/quarter if not on a weekly basis to engage customers and make them stay in the game longer. The Average bookings per paying user (ABBPU) is still high above 100$ mark and has seen a slight decline due to a reduction in spending on advertising (which benefitted the company by reducing their marketing costs & expenses)*\n\n*The share of advertisement sales as a percentage of total bookings decreased in the third quarter of 2022 to 4.6% compared to 5.9% in the respective period of 2021, a decrease of 1.3 p.p. mainly due to the general decline of the advertising market amplified by the fact that the advertisers’ preferences shifted to non-gaming advertising venues in the third quarter of 2022 vs. the same period in the prior year.*\n\n*2021 was characterised by a relatively high investment in marketing, which led to high growth in MPUs. The decrease in the marketing investments for the majority of 2022 resulted in a corresponding decrease in MPUs in the third quarter of 2022, which reached 305 thousand in the third quarter of 2022 vs. 371 thousand in the respective period of 2021, a decline of 18%.*\n\n*The split of bookings by geography in the third quarter of 2022 remained broadly similar to the split in the third quarter of 2021 with a general increase in the share of US bookings.”*\n\n📷\n\nNexters has weathered the storm and is looking forward to another profitable 4th quarter. The company is constantly involved with its fan base by engaging them on social media platforms like Twitter / Facebook and Discord. The return on NASDAQ will provide Nexters with the necessary capital to build out and achieve its growth plans. The company has a low float and the shares are majority held by insiders (>84%) providing a lot “skin in the game”.\n\nQ4 2022 will be out before may 2nd following the company switching external auditors from KPMG Russia to KPMG Europe.\n\n**3rd party app revenue verification**\n\nThe beauty of mobile games is that their data can be verified by 3rd party companies like AppMagic [https://appmagic.rocks/](https://appmagic.rocks/). This is the data for February from Sensor Towers\n\n**Nexters Global**\n\n[https://app.sensortower.com/ios/publisher/nexters-global-ltd/660706304](https://app.sensortower.com/ios/publisher/nexters-global-ltd/660706304)\n\n[app data](https://preview.redd.it/xwd65b7t8vpa1.png?width=775&format=png&auto=webp&v=enabled&s=e2c90fa615c3e2045b9f1235929f98314cc09874)\n\n**Cubic Games** (owned by Nexters)- Pixel Gun 3D is their most popular game\n\n[https://app.sensortower.com/ios/publisher/publisher/561634640](https://app.sensortower.com/ios/publisher/publisher/561634640)\n\n**RJ Games** (Owned by Nexters) – Puzzle Breakers RPG Online\n\n[https://app.sensortower.com/android/publisher/publisher/RJ%2BGames](https://app.sensortower.com/android/publisher/publisher/RJ%2BGames)\n\n&#x200B;\n\n**Insider Ownership**\n\n[List of insiders](https://preview.redd.it/n3gn98sy8vpa1.png?width=783&format=png&auto=webp&v=enabled&s=7a9f819092bc757f9c172c04fe6d8f1f47f55b03)\n\nInsiders and executives own close to 87% of the shares and warrants outstanding of Nexters providing a high “skin in the game” factor. The float of the company is therefore small, tightly held and trades in low volumes. The company has not issued additional shares since its inception and does not plan to do so in the near future as it’s well capitalized. Given that the company has started trading again and is underfollowed, this provides in our view an opportunity for the share price to move quickly upwards as soon as the market rediscovers the company.\n\n**Warrants**\n\nThe warrants are quite compelling because they have a redemption feature that differs from the typical warrant redemption features used in many other blank check offerings, which typically only provide for a redemption of warrants for cash (other than the private placement warrants) when the trading price for the ordinary shares exceeds $18.00 per share for a specified period of time.\n\nThis redemption feature is structured to allow for all of the outstanding warrants to be redeemed when the ordinary shares are trading at or above $10.00 per public share, which may be at a time when the trading price of the ordinary shares is below the exercise price of the warrants. Nexters has established this redemption feature to provide it with the flexibility to redeem the warrants without the warrants having to reach the $18.00 per share threshold (from the prospectus as filed with the Securities and Exchange Commission on October 18, 2022)\n\nFurthermore, per the prospectus the company has the right to lower the exercise price per share at any time prior to the warrant expiry date, which is also a positive for investors\n\nhttps://preview.redd.it/hiweuw659vpa1.png?width=725&format=png&auto=webp&v=enabled&s=599c8f421a2faf84beb08831ab457d5d51b97724\n\n**The addressable market**\n\nHow big is the addressable market? The World’s 2.7 billion Gamers Spent $175 Billion on Games in 2020; The Market Will Surpass $200 Billion by 2023. So Nexters Global is well-positioned in the expanding market.\n\n&#x200B;\n\n[figures are from 2021 KISMET SPAC Deck](https://preview.redd.it/p3q9z9nb9vpa1.png?width=716&format=png&auto=webp&v=enabled&s=272facfba6afd66c20ed5a5cdd6fb7e0da779d15)\n\nThis is a great company with solid financials and a bright future trading at ridiculously cheap bargain prices on low volume given the small float and high insider ownership. The company is critically underfollowed given its long hiatus from NASDAQ, so I would keep a close eye on the company given that the Q4 and FY 2022 results will be out around the end of April.\n\nThe valuation is quite low in our view, and provides big upside that could also lead to potentially being acquired by another big video game company like Tencent or Everix.\n\nLast but not the least, there’s also chatter about announcing a “Hero Wars 2” title on the 7th anniversary of the game.\n\nThanks for reading",
    "username": "AstroChicks",
    "subreddit": "SPACs",
    "commentCount": 2,
    "score": 1
  },
  {
    "id": "121iwcx",
    "date": "2023-03-25 11:23:39",
    "title": "From Rockets to Ball Bearings, Pentagon Struggles to Feed War Machine",
    "content": " the first 10 months after Russia invaded Ukraine, prompting Washington to approve $33 billion in military aid so far, the United States sent Ukraine so many Stinger missiles from its own stocks that it would take 13 years’ worth of production at recent capacity levels to replace them. It has sent so many Javelin missiles that it would take five years at last year’s rates to replace them, according to Raytheon, the company that helps make the missile systems.\n\nIf a large-scale war broke out with China, within about one week the United States would run out of so-called long-range anti-ship missiles, a vital weapon in any engagement with China, according to a series of war-game exercises conducted by the Center for Strategic and International Studies, a Washington-based think tank.",
    "username": "woodsro00",
    "subreddit": "worldnews",
    "commentCount": 0,
    "score": 2
  },
  {
    "id": "121iufg",
    "date": "2023-03-25 11:21:20",
    "title": "Ucrown Compoface",
    "content": "",
    "username": "jollyrodger2077",
    "subreddit": "compoface",
    "commentCount": 2,
    "score": 54
  },
  {
    "id": "121in6p",
    "date": "2023-03-25 11:12:14",
    "title": "Girkin says that because there was no declaration of war, if the RF is defeated, no solider could claim they were just following orders, because those orders would be illegal. (Not because of destroying Ukraine or Ukrainians, but because he is wanting a formal declaration of war)",
    "content": "",
    "username": "Barch3",
    "subreddit": "CounterIntel_Foreign",
    "commentCount": 0,
    "score": 5
  },
  {
    "id": "121in0u",
    "date": "2023-03-25 11:12:03",
    "title": "Girkin says that because there was no declaration of war, if the RF is defeated, no solider could claim they were just following orders, because those orders would be illegal. (Not because of destroying Ukraine or Ukrainians, but because he is wanting a formal declaration of war)",
    "content": "",
    "username": "Barch3",
    "subreddit": "RussianInvasion",
    "commentCount": 0,
    "score": 5
  },
  {
    "id": "121j611",
    "date": "2023-03-25 11:35:20",
    "title": "Ever watch Star Wars Prequels? I think it was a blue print to what's going on now.",
    "content": "Just saying, but for a long time, the USA was considered this beacon of hope in the world since WW2, and well, maybe since the 60's, our leadership has been slowly corrupted. Now, for the past 20 years, the USA has been using their Wars on Terror and Wars on Drugs to invade and destroy other countries and then take over their leadership. At the same time, they steal from American tax payers and pump money into Afghanistan and Ukraine. Sure, they say it's to help with those countries freedoms, but what if the American tyrants have been using that money and the 20 year span to build their own armies to attack the USA. In the meantime, they have been busy destroying all the other countries so the people who want freedom will have no where else to go.",
    "username": "GallopingFlicka",
    "subreddit": "conspiracy",
    "commentCount": 12,
    "score": 4
  },
  {
    "id": "121j35n",
    "date": "2023-03-25 11:32:00",
    "title": "#NIOCORP~ NIOBIUM~& THE QUANTUM INTERNET, U.S. & EU Critical Minerals & more....",
    "content": "# #NIOCORP~ NIOBIUM~& THE QUANTUM INTERNET,  U.S. & EU Critical Minerals & more....\n\n# New experiment translates quantum information between technologies in an important step for the quantum internet\n\n[New experiment translates quantum information between technologies in an important step for the quantum internet (phys.org)](https://phys.org/news/2023-03-quantum-technologies-important-internet.html) =\n\n[ A NIOBIUM superconducting cavity. The holes lead to tunnels which intersect to trap light and atoms. Credit: Aishwarya Kumar ](https://preview.redd.it/idc6k5bsyupa1.png?width=800&format=png&auto=webp&v=enabled&s=54c0aa887f56298273caa808a7587ba3ab3234ff)\n\n**Researchers have discovered a way to \"translate\" quantum information between different kinds of quantum technologies, with significant implications for quantum computing, communication, and networking.**\n\n**The research was published in the journal** ***Nature*** **on Wednesday. It represents a new way to convert** [**quantum information**](https://phys.org/tags/quantum+information/) **from the format used by quantum computers to the format needed for quantum communication.**\n\n**Photons—particles of light—are essential for** [**quantum information technologies**](https://phys.org/tags/quantum+information+technologies/)**, but different technologies use them at different frequencies. For example, some of the most common** [**quantum computing**](https://phys.org/tags/quantum+computing/) **technology is based on** [**superconducting qubits**](https://phys.org/tags/superconducting+qubits/)**, such as those used by tech giants Google and IBM; these qubits store quantum information in** [**photons**](https://phys.org/tags/photons/) **that move at microwave frequencies.**\n\n**But if you want to build a quantum network, or connect quantum computers, you can't send around microwave photons because their grip on their quantum information is too weak to survive the trip.**\n\n**\"A lot of the technologies that we use for classical communication—cell phones, Wi-Fi, GPS and things like that—all use microwave frequencies of light,\" said Aishwarya Kumar, a postdoc at the James Franck Institute at University of Chicago and lead author on the paper. \"But you can't do that for quantum communication because the quantum information you need is in a** [**single photon**](https://phys.org/tags/single+photon/)**. And at microwave frequencies, that information will get buried in thermal noise.\"**\n\n**The solution is to transfer the quantum information to a higher-frequency photon, called an optical photon, which is much more resilient against ambient noise. But the information can't be transferred directly from photon to photon; instead, we need intermediary matter. Some experiments design solid state devices for this purpose, but Kumar's experiment aimed for something more fundamental: atoms.**\n\n**The electrons in atoms are only ever allowed to have certain specific amounts of energy, called energy levels. If an electron is sitting at a lower energy level, it can be excited to a higher energy level by hitting it with a photon whose energy exactly matches the difference between the higher and lower level. Similarly, when an electron is forced to drop to a lower energy level, the atom then emits a photon with an energy that matches the energy difference between levels.**\n\n**Rubidium atoms happen to have two gaps in their levels that Kumar's technology exploits: one that exactly equals the energy of a microwave photon, and one that exactly equals the energy of an optical photon. By using lasers to shift the atom's electron energies up and down, the technology allows the atom to absorb a microwave photon with quantum information and then emit an optical photon with that quantum information. This translation between different modes of quantum information is called \"transduction.\"**\n\n**Effectively using atoms for this purpose is made possible by the significant progress scientists have made in manipulating such small objects. \"We as a community have built remarkable technology in the last 20 or 30 years that lets us control essentially everything about the atoms,\" Kumar said. \"So the experiment is very controlled and efficient.\"**\n\n**He says the other secret to their success is the field's progress in** [**cavity quantum electrodynamics**](https://phys.org/tags/cavity+quantum+electrodynamics/)**, where a photon is trapped in a superconducting, reflective chamber. Forcing the photon to bounce around in an enclosed space, the superconducting cavity strengthens the interaction between the photon and whatever matter is placed inside it.**\n\n**Their chamber doesn't look very enclosed—in fact, it more closely resembles a block of Swiss cheese. But what look like holes are actually tunnels that intersect in a very specific geometry, so that photons or atoms can be trapped at an intersection. It's a clever design that also allows researchers access to the chamber so they can inject the atoms and the photons.**\n\n**The technology works both ways: it can transfer quantum information from** [**microwave photons**](https://phys.org/tags/microwave+photons/) **to optical photons, and vice versa. So it can be on either side of a long-distance connection between two superconducting qubit quantum computers, and serve as a fundamental building block to a quantum internet.**\n\n**But Kumar thinks there may be a lot more applications for this technology than just quantum networking. Its core ability is to strongly entangle atoms and photons—an essential, and difficult task in many different quantum technologies across the field.**\n\n**\"One of the things that we're really excited about is the ability of this platform to generate really efficient entanglement,\" he said. \"Entanglement is central to almost everything quantum that we care about, from computing to simulations to metrology and atomic clocks. I'm excited to see what else we can do.\"**\n\n# Europe turbo charges its critical minerals drive\n\n[Column: Europe turbo charges its critical minerals drive | Reuters](https://www.reuters.com/markets/commodities/europe-turbo-charges-its-critical-minerals-drive-2023-03-24/)\n\n[ Geothermal water is seen through a sight glass at a pipeline system of a geothermal power station of German power supplier EnBW Energie Baden Wuerttemberg AG, where a pilot facility for lithium extraction will be built, in Bruchsal, Germany, April 23, 2021. REUTERS\\/Ralph Orlowski ](https://preview.redd.it/4ldv4swa1vpa1.png?width=960&format=png&auto=webp&v=enabled&s=a6d84aa5be9ba2f086ba53c363d8cbc0eb54672d)\n\nLONDON, March 24 (Reuters) - The European Union has unveiled the accelerator in its drive to reduce the bloc's import dependency for critical minerals and metals.\n\nThe Critical Raw Materials Act (CRMA) \"will significantly improve\" Europe's domestic extraction, processing and recycling capacity for metals such as lithium and rare earths, [**according to**](https://ec.europa.eu/commission/presscorner/detail/en/ip_23_1661) Ursula von der Leyen, president of the European Commission.\n\nThe Act comes with targets for production and for reducing dependency on any single third country. China currently dominates the supply chain for many of the entries on Europe's list of \"strategic\" metals.\n\nThe EU is also playing catch-up with the United States, which is already investing heavily in critical metals capacity under the aegis of [**the Defense Production Act**](https://www.lse.co.uk/news/us-uses-cold-war-powers-to-secure-battery-metals-supply-andy-home-ui49x2q5m2wz2t0.html) and [**the Inflation Reduction Act**](https://www.reuters.com/markets/commodities/us-hits-ev-accelerator-cut-chinese-metals-ties-2022-08-16/).\n\nEurope may, however, have given itself a competitive edge by moving to streamline project permitting, a tortuous process that often drags on for years before the first shovel hits the ground.\n\n## (MOVING) TARGETS\n\nThe CRMA covers a subset of the EU's [**critical minerals list**](https://single-market-economy.ec.europa.eu/sectors/raw-materials/areas-specific-interest/critical-raw-materials_en), with particular focus on battery metals like lithium, nickel, cobalt and manganese and magnet inputs such as boron and rare earths.\n\nCopper is on the list as an enabler of all things electric but aluminium and zinc aren't, which is a striking omission given the recent shrinkage of European production capacity.\n\nGermany's Speira has joined the list of casualties, this month announcing [**the full closure**](https://www.reuters.com/markets/commodities/germanys-speira-end-rheinwerk-aluminium-smelting-due-energy-costs-2023-03-09/) of its Rheinwerk aluminium smelter due to high energy costs.\n\n\"Today's strategic raw materials list must not be the finished picture,\" warned Evangelos Mytilineos, president of industry group Eurometaux.\n\nIt probably won't be. The CRMA includes a provision for periodically updating the list to reflect evolving economic importance and supply risks across the critical metals spectrum.\n\nFor those metals on the list the target is for the region to mine 10%, process 40% and recycle 15% of what it consumes annually by 2030. By which time not more than 65% of any strategic metal's consumption will be able to come from a single third country.\n\nThese are ambitious targets given Europe currently sources 97% of its magnesium in China, which also has a complete monopoly on the processing of heavy rare earths and graphite.\n\nEurope's lithium extraction can in theory meet the 10% target but it hinges on multiple new projects, many of them using innovative technology.\n\nRecycling lithium-ion batteries is also a technical challenge that has to be resolved at scale to meet the 15% recycling target.\n\n## PERMITTING\n\nIn terms of maximising domestic mining and processing capacity, Europe is following the United States in instructing all national governments to go back and look at what may have been left behind in tailings ponds and historic mine sites.\n\nOperators of existing mines and plants should prepare an economic assessment study of what they're losing in \"waste\" streams. It's a policy that has already significantly closed the U.S. dependency gap for tellurium and scandium.\n\nHowever, Europe has overtaken the United States in one key area, aiming to streamline the permitting of \"strategic\" projects to ensure a maximum time-line of two years for mines and one year for processing plants.\n\nAll such projects should be considered as being \"in the public interest\" by the relevant national authority when considering environmental impact.\n\nThe U.S. Administration has [**come under fire**](https://www.reuters.com/markets/commodities/bidens-ev-minerals-cash-fruitless-without-permitting-reform-2022-10-24/) for using the Inflation Reduction Act to incentivise domestic mining while simultaneously blocking development of mines on federal land. The green-on-green environmental clashes seem set to continue until there is a long-overdue rewrite of the General Mining Act of 1872.\n\n## COLLECTIVE BUYING AND STOCKPILES\n\nMany strategic metals markets are opaque, not easily financially hedged and concentrated on the supply side, according to the CRMA. All of which \"increases the negotiating power of sellers and increase prices for buyers\".\n\nIt calls for the Commission to set up a system for collective purchasing by interested buyers, a mechanism already trialled in the gas market.\n\nIt also recommends the accumulation of strategic metal stocks to buffer against unexpected supply disruptions. Europe has no strategic metal inventory, unlike the United States, China and South Korea.\n\nMember states may have their own stockpiles and \"as a first step and considering the lack of relevant information\", the 27 countries in the bloc should report to the Commission what, if anything, they are holding.\n\nGiven such a humble starting point, it seems unlikely EU strategic metal reserves are going to come any time soon, if they come at all.\n\n## METALLIC ARMS RACE\n\nThe EU accepts it will never be fully self-sufficient in most if any of the metals it's identified as being critical to its industrial and defence sectors.\n\nThe CRMA advocates diversifying supply in favour of \"reliable partners\" and creating \"mutually beneficial partnerships with emerging market and developing economies\".\n\nIt represents a further tectonic decoupling of global supply chains.\n\nWhat started as a response to China's dominance of critical metals supply has been accelerated by Russia's invasion of Ukraine.\n\nRussia has historically been a major supplier of aluminium, copper and nickel to Europe's industrial sector to the extent that the EU has to date held back from sanctioning Russian material even as the United States imposes penal import duties.\n\nBut the metals world is clearly starting to split between West and the East.\n\nIt's a messy process, witness the dispute between the EU and the United States over the exclusion of European products from the electric vehicle subsidies introduced in the Inflation Reduction Act.\n\nThat particular hurdle may shortly be cleared, German newspaper Handlesblatt [**reporting that**](https://www.reuters.com/business/us-lays-out-possible-critical-raw-materials-agreement-with-eu-handelsblatt-2023-03-23/) a draft agreement has been reached.\n\nIt is evidently in neither side's interest to compete with each other in the context of reducing resource ties with China and Russia.\n\nAssuming future trans-Atlantic harmony can be achieved, something akin to a metallic NATO will start to take ever clearer shape.\n\n \n\n# BIS Issues Proposed Rule to Establish “Guardrails” to Prevent the Improper Use of CHIPS Act Funding\n\nPosted on March 24, 2023POSTED IN [BIS](https://www.thompsonhinesmartrade.com/category/bis/), [SEMICONDUCTORS](https://www.thompsonhinesmartrade.com/category/semiconductors/), [SUPPLY CHAIN](https://www.thompsonhinesmartrade.com/category/supplychain/) \n\n [BIS Issues Proposed Rule to Establish “Guardrails” to Prevent the Improper Use of CHIPS Act Funding | SmarTrade (thompsonhinesmartrade.com)](https://www.thompsonhinesmartrade.com/2023/03/bis-issues-proposed-rule-to-establish-guardrails-to-prevent-the-improper-use-of-chips-act-funding/) \n\n&#x200B;\n\nhttps://preview.redd.it/afhv01j2gvpa1.png?width=330&format=png&auto=webp&v=enabled&s=a9be7b6689dce1c573acced67e841e216b5513b9\n\nOn March 23, 2023, the Department of Commerce’s Bureau of Industry and Security (BIS) published a [Notice of Proposed Rulemaking](https://www.govinfo.gov/content/pkg/FR-2023-03-23/pdf/2023-05869.pdf) implementing measures to prevent the improper use of CHIPS Act Incentives Program funding. Described as “guardrails,” the proposed rules are intended to ensure technology and innovation funded by the Creating Helpful Incentives to Produce Semiconductors (CHIPS) and Science Act are not used for malign purposes by adversarial countries against the United States or its allies and partners. The CHIPS Act was enacted in August 2022 to incentivize the manufacture of semiconductors and semiconductor manufacturing equipment in the United States, especially amid growing national security concerns and economic competition risks posed by China’s increasing chip production in recent years. It provides appropriations to develop domestic manufacturing critical to U.S. competitiveness and national security interests. *See* Update of [July 29, 2022](https://www.thompsonhinesmartrade.com/2022/07/house-and-senate-pass-chips-and-science-act-of-2022-president-biden-expected-to-quickly-sign/).\n\nThe proposed rule provides additional details on national security measures that would be applicable to the CHIPS Incentives Program, including limiting recipients of funding from investing in the expansion of semiconductor manufacturing in foreign countries of concern (i.e., China, Russia, Iran and North Korea). According to BIS, these guardrails “will advance shared national security interests as the U.S. continues coordinating and collaborating with allies and partners to make global supply chains more resilient and diversified.” The proposed rule provides additional details on and definitions for these national security guardrails, including:\n\n* Establishing standards to restrict advanced facility expansion in foreign countries of concern.\n* Limiting the expansion of legacy facilities in foreign countries of concern.\n* Classifying semiconductors as critical to national security.\n* Reinforcing U.S. export controls.\n* Restricting joint research and technology licensing efforts with foreign entities of concern.\n\n## Establishing Restrictive Standards and Limiting Facility Expansion\n\nTo protect national security and the resiliency of supply chains, CHIPS Incentives Program funds may not be provided to a foreign entity of concern. The proposed rule provides a detailed explanation of what is meant by “foreign entities of concern,” as well as a definition of “owned by, controlled by, or subject to the jurisdiction or direction of.” The proposed rule defines other terms used in the CHIPS Act (including terms that will be used in required agreements with funding recipients), identifies the types of transactions that are prohibited under the Expansion Clawback and Technology Clawback sections of the CHIPS Act and provides a description of the process for notifying the Secretary of Commerce of significant transactions involving expansion of semiconductor manufacturing in a foreign country of concern.\n\n## Classifying Semiconductors as Critical to National Security\n\nWhile the CHIPS Act allows companies to expand production of legacy chips in foreign countries of concern in limited circumstances, the proposed rule would classify a list of semiconductors as critical to U.S. national security. In doing so, the rule would define “legacy semiconductors” subject to tighter restrictions, which would include “current-generation and mature-node chips used for quantum computing, in radiation-intensive environments, and for other specialized military capabilities.” The proposed rule seeks to also clarify what would not be considered legacy semiconductors.\n\n## Reinforcing U.S. Export Controls\n\nIn October 2022, BIS implemented export controls to prevent China from purchasing and manufacturing advanced chips that would enhance that country’s military capabilities. *See* Update of [October 31, 2022](https://www.thompsonhinesmartrade.com/2022/10/new-export-controls-target-support-for-chinas-advanced-computing-and-semiconductor-manufacturing/). The proposed rule provides definitions that are harmonious with and reinforce these export controls “by aligning prohibited technology thresholds for memory chips between export controls and CHIPS national security guardrails.” Accordingly, the proposed rule applies a more restrictive threshold for logic chips than is used for export controls.\n\n## Restricting Joint Research and Licensing\n\nThe proposed rule would prohibit during the term of a federal financial assistance award a recipient from knowingly engaging in any joint research or technology licensing with a foreign entity of concern that relates to a technology or product that raises national security concerns. In addition to any foreign entities of concern, the proposed rule would also add entities from BIS’ Entity List, the Treasury Department’s Chinese Military-Industrial Complex Companies (NS-CMIC) list, and the Federal Communications Commission’s Secure and Trusted Communications Networks Act list of equipment and services posing national security risks. \n\n## Public Comment\n\nBIS will accept comments from all interested parties through May 22, 2023 via the federal eRulemaking portal or via email.\n\nThis BIS proposed rule seeks to align with similar national security “guardrails” included in the Department of the Treasury’s [Notice of Proposed Rulemaking](https://home.treasury.gov/news/press-releases/jy1353), also issued on March 23, 2023, that details the Advanced Manufacturing Investment Credit (Investment Tax Credit) administered by the Internal Revenue Service; *see* separate update [here](https://www.thompsonhinesmartrade.com/2023/03/treasury-issues-proposed-rule-to-clarify-the-advanced-manufacturing-investment-credit-established-by-the-chips-act/).\n\n# U.S. lays out possible critical raw materials agreement with EU -Handelsblatt\n\n[U.S. lays out possible critical raw materials agreement with EU -Handelsblatt (yahoo.com)](https://news.yahoo.com/u-lays-possible-critical-raw-184349101.html)\n\n[ FILE PHOTO: Picture shows European Union flags fluttering outside the EU Commission headquarters in Brussels ](https://preview.redd.it/y2ebtphw1vpa1.png?width=705&format=png&auto=webp&v=enabled&s=6be935051082daa824c493e145da0ee07529c8da)\n\n(Reuters) - The United States and the European Commission have negotiated a possible agreement to allow for electric vehicles with critical minerals extracted or processed in the European Union to qualify for U.S. green subsidies, Handelsblatt reported on Thursday.\n\nLithium, manganese, nickel and cobalt - key minerals for battery production - would fall under the agreement and should therefore qualify for subsidies under the U.S. $430-billion Inflation Reduction Act (IRA) package, according to the draft paper seen by German business paper Handelsblatt.\n\nUnder the IRA rules, electric vehicles can qualify for subsidies only if at least 40% of the critical minerals within come from the U.S. or a country it has a free trade agreement with.\n\nPresident Joe Biden and European Commission President Ursula von der Leyen agreed in early March that the two sides would launch talks on a raw material agreement that would allow vehicles with minerals sourced or processed in Europe to benefit.\n\nA European Commission spokesperson was not immediately available for comment.\n\n(Reporting by Victoria Waldersee; Editing by Leslie Adler)\n\n# Dig, Dig, Dig: US and Europe Target China’s Grip on Critical Raw Minerals\n\nBy [Otto Lanzavecchia](https://cepa.org/author/otto-lanzavecchia/)**March 23, 2023**\n\n[ Europe and the US share a common goal — increasing self-sufficiency for minerals and tech products needed to fight climate change. Alignment looks set to defuse transatlantic trade tensions. ](https://preview.redd.it/jh4wav4qavpa1.png?width=2200&format=png&auto=webp&v=enabled&s=773c2ec0723a3c834e68424f3a7532ab3c720de9)\n\nThe European Commission unveiled this month a two-pronged strategy to reduce its dependency on China and boost its green industries. The [Critical Raw Materials Act](https://ec.europa.eu/commission/presscorner/detail/en/IP_23_1661) aims to wean the continent off Chinese critical minerals. The [Net-Zero Industry Act](https://ec.europa.eu/commission/presscorner/detail/en/IP_23_1665) is geared at boosting the EU’s production of clean tech equipment by a [recent decision](https://ec.europa.eu/commission/presscorner/detail/en/ip_23_1563) to relax strict state aid rules.\n\nTogether, the proposals represent Europe’s response to the US pressure against China and to compete with protectionist subsidies included in the US’s [Inflation Reduction Act](https://www.whitehouse.gov/cleanenergy/inflation-reduction-act-guidebook/). Although a danger remains that the US’s generous pockets and hard-line approach against China will sow discord, these European moves signal a desire to strengthen the transatlantic alliance.\n\nStart back in August 2022, when the US Congress passed the IRA, which contained gargantuan government subsidies to US industries. Europeans were [aghast](https://cepa.org/article/the-us-and-europe-should-fight-climate-change-together/). Confronted with sky-high energy prices and roaring inflation, they could hear a deafening sucking sound of investments leaving the continent and heading across the Atlantic Ocean. The US subsidies jolted European capitals to [reconsider](https://cepa.org/article/inflation-reduction-us-europe-clean-tech-subsidy-war/) their strict limits on state aid, instrumental in building and preserving the European single market.\n\nAt the same time, Vladimir Putin’s weaponization of gas exports woke up the continent to the danger of Chinese-supplied critical raw materials and Beijing’s dominance in green industries, such as solar panels and electric car batteries. If China cut sales of these key products, Europe’s plans for its ecological and digital transition would be at risk of collapse — not unlike the United States’.\n\nHow could Europeans condemn Americans for steeling themselves against the same threat they faced? The answer to that question challenged the EU’s status quo, and European capitals began tilting westward. In January, while speaking in Davos, European Commission President Ursula von der Leyen downplayed frictions over the IRA and stressed the need to “de-risk” vis a vis China.\n\nThe Biden administration took constructive steps: it began exploring extending some of the IRA’s benefits to European industries. US Trade Representative Katherine Tai [had been urging](https://www.ft.com/content/0e52d609-5cfe-453c-9baf-b33b66e941e9) the EU to develop its own, parallel strategy on subsidies and reshoring, saying that the US wanted to “work with our friends and allies to allow us to together build a resiliency and to wean us off some dependencies.” An agreement on critical raw materials would allow the US to extend the IRA’s reach to European industries, indicated US Treasury Secretary Janet Yellen. EU countries began to adhere to the US-led [Minerals Security Partnership](https://www.state.gov/minerals-security-partnership-convening-supports-robust-supply-chains-for-clean-energy-technologies/), aiming to create a like-minded critical raw material “buyers’ club” between democratic countries.\n\nThe political breakthrough came on March 10. President von der Leyen went to the White House to meet President Biden, while back home her Commission relaxed state aid rules. Afterward, they produced [a statement](https://ec.europa.eu/commission/presscorner/detail/en/statement_23_1613) signaling a transatlantic climate truce. And upon her return to Brussels, the Commission launched the two-pronged legislative proposals.\n\nThe Net Zero Industry Act aims to ensure that European produces at least 40% of European demand for green products by 2030. EU governments will be able to match subsidies provided in other countries “where there is a real risk of investments being diverted away from Europe,” [according to](https://www.euractiv.com/section/economy-jobs/news/eu-state-aid-the-good-and-the-bad-of-opening-the-floodgates/) European Commissioner Margrethe Vestager.\n\nThe Critical Raw Materials Act aims to supply Europe’s green industries with crucial inputs. European mining and refining must cover at least 10% of the EU critical raw materials by 2030. That would be a giant feat for a continent that spent decades outsourcing most of the extraction and production.\n\nKey provisions have China written all over them. If a foreign country has more than 65% of the market, its companies will have little chance of winning a public contract in the EU. For context, Beijing controls more than 80% EU market share in the solar sector.\n\nPermitting will be sped up. It can [take up](https://www.politico.eu/article/europes-green-dilemma-mining-key-minerals-without-destroying-nature/) to 15 years to get the green light for a new mining project in Europe. Under the Critical Raw Materials Act, mines designated as strategic must receive a decision on permits within two years.\n\nCritics question whether Europe can achieve its stated goals. Environmentalists [have vowed](https://www.politico.eu/article/europes-green-dilemma-mining-key-minerals-without-destroying-nature/) to oppose projects to mine lithium and other minerals, citing the danger to water and nature preserves. Business leaders from Solvay, Merck, and Dow [warn](https://www.ft.com/content/6e6d71a1-a94b-45c9-ad5c-81f32e886301) that the Net Zero Industry Act offers too little funding and is too complex to compete against the US’s $369 billion of green tax incentives and subsidies.\n\nEven so, the European proposals signal a U-turn in economic policymaking — and a potential transatlantic alignment. On both sides of the Atlantic, the love affair with free markets and globalization is [fading](https://www.politico.eu/article/europes-new-climate-plan-dont-burn-coal-burn-your-eu-ideals-european-commission-brussels-gunther-oettinger-beijing-us-pascal-lamy/). Instead of market-driven decision-making, we are entering an era of strategic planning with democracies moving to onshore and subsidizing critical industries.\n\nThe transition will be rocky and perilous. Divergences over how hard to hit China could re-emerge. The US takes a hard line, while European officials continue to consider Beijing both a “rival” and a “partner.” But both Brussels and Washington are working hard not to let their support for green tech deteriorate into a counter-productive and protectionist subsidy race. If they work together, they could shore up the democratic world’s shift to clean tech.\n\n[*Otto Lanzavecchia*](https://formiche.net/author/ottolanzavecchia/) *is an Italian journalist for Formiche.net and Decode39. He focuses on international affairs, tech and society, energy, and climate change.*\n\n[*Bandwidth*](https://cepa.org/insights-analysis/commentary/bandwidth/) *is CEPA’s online journal dedicated to advancing transatlantic cooperation on tech policy. All opinions are those of the author and do not necessarily represent the position or views of the institutions they represent or the Center for European Policy Analysis.*\n\n&#x200B;\n\n# Modelling and experimental investigation of Nb2O5 as a high-rate battery anode material\n\n[Modelling and experimental investigation of Nb2O5 as a high-rate battery anode material | Elsevier Enhanced Reader](https://reader.elsevier.com/reader/sd/pii/S0013468623001706?token=AECBB2391732B65F3A4C300685A7E1346678DD3AE86B722D690DEF3CA6DD8E0B708C9FA8DAF2420D120158FD33F7CBCA&originRegion=us-east-1&originCreation=20230325110756)\n\n[Conclusions:     A DFN electrochemical model was developed for Nb2O5 as a high-rate battery anode material. The electrochemical performance of a commercial Nb2O material was investigated for model development and physicochemical parameterization. The Nb2O5 material was a mixture of T-Nb2O5 and H-Nb2O5 phases and possessed large-size porous polycrystalline particles in rod and ball structure which were formed by amalgamation of many nano-sized particles.,,,,](https://preview.redd.it/h8jqxigfbvpa1.png?width=460&format=png&auto=webp&v=enabled&s=9416317107e0b0ce09e94bd144d6a220ca078e37)\n\n&#x200B;\n\n# FORM YOUR OWN OPINIONS & CONCLUSION ABOVE\n\n## [December 2022 | E & MJ (e-mj.com)](https://www.e-mj.com/flipbooks/december-2022/)\n\n&#x200B;\n\n[Dec. ISSUE... For a little light flip through with Coffee!](https://preview.redd.it/6fyl8q4gfvpa1.png?width=337&format=png&auto=webp&v=enabled&s=c58839b11a2c483350d07e0e914482c39d4d723c)\n\n&#x200B;\n\nNIOCORP WILL PRODUCE & PROCESS THE CRITICAL MINERALS NIOBIUM, TITANIUM & SCANDIUM, & VIABLE REE's\n\nhttps://preview.redd.it/hzpir9ozcvpa1.png?width=1080&format=png&auto=webp&v=enabled&s=f188aded9aeea532894ba1015088de8b4b135dda\n\nWAITING FOR NIOCORP TO \"RING THE BELL!\" on the NASDAQ, & FOR MATERIAL NEWS AS IT BECOMES AVAILABLE!\n\n&#x200B;\n\nhttps://preview.redd.it/v6itf0sm2vpa1.png?width=218&format=png&auto=webp&v=enabled&s=c85bb050775660780fee0b3fa1a21a8167f26df9\n\nChico",
    "username": "Chico237",
    "subreddit": "NIOCORP_MINE",
    "commentCount": 2,
    "score": 3
  },
  {
    "id": "121j2y0",
    "date": "2023-03-25 11:31:44",
    "title": "Austrian FM: Russia’s war in Ukraine is not ‘black and white’ - Foreign Minister Alexander Schallenberg discusses Austria’s military non-alignment policy.",
    "content": "",
    "username": "anarchyart2021",
    "subreddit": "EndlessWar",
    "commentCount": 0,
    "score": 2
  },
  {
    "id": "121j2an",
    "date": "2023-03-25 11:30:58",
    "title": "400,000 More Russian Soldiers May Join War In Ukraine Soon: Report",
    "content": "",
    "username": "erinswider",
    "subreddit": "UkraineConflicts",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121j28e",
    "date": "2023-03-25 11:30:54",
    "title": "Ukraine war latest: Bakhmut, Avdiivka, Mariinka under heavy fire",
    "content": "",
    "username": "KI_official",
    "subreddit": "UkraineConflict",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121j24q",
    "date": "2023-03-25 11:30:48",
    "title": "400,000 More Russian Soldiers May Join War In Ukraine Soon: Report",
    "content": "",
    "username": "erinswider",
    "subreddit": "russiawarinukraine",
    "commentCount": 2,
    "score": 1
  },
  {
    "id": "121j23x",
    "date": "2023-03-25 11:30:47",
    "title": "400,000 More Russian Soldiers May Join War In Ukraine Soon: Report",
    "content": "",
    "username": "erinswider",
    "subreddit": "UkraineInvasionVideos",
    "commentCount": 12,
    "score": 11
  },
  {
    "id": "121j20v",
    "date": "2023-03-25 11:30:41",
    "title": "400,000 More Russian Soldiers May Join War In Ukraine Soon: Report",
    "content": "",
    "username": "erinswider",
    "subreddit": "breakingnews",
    "commentCount": 0,
    "score": 0
  },
  {
    "id": "121j1zk",
    "date": "2023-03-25 11:30:39",
    "title": "Ukraine war latest: Bakhmut, Avdiivka, Mariinka under heavy fire",
    "content": "",
    "username": "KI_official",
    "subreddit": "ukraine",
    "commentCount": 3,
    "score": 70
  },
  {
    "id": "121j1yo",
    "date": "2023-03-25 11:30:38",
    "title": "400,000 More Russian Soldiers May Join War In Ukraine Soon: Report",
    "content": "",
    "username": "erinswider",
    "subreddit": "UkraineCrisis2022",
    "commentCount": 0,
    "score": 3
  },
  {
    "id": "121j1xm",
    "date": "2023-03-25 11:30:36",
    "title": "400,000 More Russian Soldiers May Join War In Ukraine Soon: Report",
    "content": "",
    "username": "erinswider",
    "subreddit": "WorldNewsHeadlines",
    "commentCount": 0,
    "score": 0
  },
  {
    "id": "121j1wm",
    "date": "2023-03-25 11:30:34",
    "title": "400,000 More Russian Soldiers May Join War In Ukraine Soon: Report",
    "content": "",
    "username": "erinswider",
    "subreddit": "GlobalNews",
    "commentCount": 1,
    "score": 0
  },
  {
    "id": "121j1o8",
    "date": "2023-03-25 11:30:17",
    "title": "Ukraine war latest: Bakhmut, Avdiivka, Mariinka under heavy fire",
    "content": "",
    "username": "KI_official",
    "subreddit": "worldnews",
    "commentCount": 0,
    "score": 11
  },
  {
    "id": "121j17y",
    "date": "2023-03-25 11:29:49",
    "title": "400,000 More Russian Soldiers May Join War In Ukraine Soon: Report",
    "content": "",
    "username": "erinswider",
    "subreddit": "UkraineConflict",
    "commentCount": 0,
    "score": 0
  },
  {
    "id": "121jezz",
    "date": "2023-03-25 11:46:46",
    "title": "Russia-Ukraine war Live updates | Able to stabilise situation around Bakhmut: Ukraine (14+)",
    "content": "",
    "username": "newswall-org",
    "subreddit": "newswall",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121jdor",
    "date": "2023-03-25 11:45:08",
    "title": "The Kremlin has abandoned plans for an offensive in Ukraine and will focus on recruiting contract soldiers for a long war - Bloomberg - Ukraine Today .org",
    "content": "",
    "username": "ceesaart",
    "subreddit": "russiawarinukraine",
    "commentCount": 0,
    "score": 2
  },
  {
    "id": "121jatt",
    "date": "2023-03-25 11:41:24",
    "title": "/r/worldnews - https://kyivindependent.com/national/ukraine-war-latest-bakhmut-avdiivka-mariinka-under-heavy-fire",
    "content": "/r/worldnews\n   \n https://kyivindependent.com/national/ukraine-war-latest-bakhmut-avdiivka-mariinka-under-heavy-fire",
    "username": "Faction_Chief",
    "subreddit": "NoFilterNews",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121jnc8",
    "date": "2023-03-25 11:56:58",
    "title": "Is the western world really raising interest rates to 'break' Russia as youtuber Jake Broe claims?",
    "content": "Youtuber Jake Broe said that he's \"the only one on youtube talking about the Fed's interest rate and it's effect on the Russian\", implying the Fed (and other western central banks) are raising interest rates in order to break the Russian economy.\n\nI suppose there's a reason he's the only one talking about this, but my lack of economics knowledge does not allow me to make a thorough analysis.\n\nSo what do you think? What is your analysis? \n\nHere's the video in question: [https://www.youtube.com/watch?v=7DqMfvg\\_KzU](https://www.youtube.com/watch?v=7DqMfvg_KzU)\n\nHe gets up to 1M views on his videos.\n\nAnd here's a comment that I pretty much agree with:\n\n>I kinda doubt your \"break Russia\" argument for raised interests rates. There's no real evidence for that besides speculation, as the only job of the central bank is to basically control inflation and unemployment. Secondly, while yes the US Fed might be doing that without openly saying it, I doubt all these other countries are on board. Imo you're SERIOUSLY underestimating the effects of inflation - it's tough here in Europe... Not everything needs to be seen through the lens of the Russia-Ukraine war. Yes, sure it might be a factor. But honestly it's economics is so complicated that no one event alone can take credit, especially not as prominently as you claim, when there's a very very real inflation problem. And if they are doing that for the sake of Russia, harming their own citizens, the inflation problem aside, there's no way to justify it. It's more of a lucky double whammy I suppose.  \n>  \n>EDIT: I'm gonna add something speculative as well... The Western world does NOT want Russia and it's economy to collapse. Not only will that harm innocent citizens, but there will be a sever shortage on other things that Russia produces besides oil: a food shortage worldwide, fertilizers etc. A collapsed Russia also means a power vacuum for a regime worse than Putin's, or a disintegration with nuclear weapons falling into wrong hands. During the Cold War tensions were way higher than they are now, yet behind all the talk of the enemy of the free world, no one legitimately wanted the USSR to collapse. A Russian collapse is a threat to the Western world, and it's leaders know it! They just can't say it publicly while they're trying to stop the war. And honestly the fix is pretty simple: get rid of Putin. It's literally that easy. No need to have another post-USSR anarchy moment. It's like trying to break America just because Trump was in power. Well guess what? He's gone now and the country is still intact and stable. Good.\n\n&#x200B;\n\nSo yeah, feel free to analyse/break apart all of the above arguments. \n\nLooking forward to hearing your views!",
    "username": "informationtiger",
    "subreddit": "AskEconomics",
    "commentCount": 2,
    "score": 0
  },
  {
    "id": "121k6iw",
    "date": "2023-03-25 12:18:54",
    "title": "Battle Report BAKHMUT: The Ukraine War | Documentary. Please like and sub if you like the content. Thank you!",
    "content": "",
    "username": "aznnerd345",
    "subreddit": "SelfPromotionYouTube",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121k5os",
    "date": "2023-03-25 12:17:55",
    "title": "#grownup #love #happy #life #socialmediaisnotreallife #excited #family #adult #scary #babes #cute #work #job #jobs #success #responsibility #boss #grownupbutnot #firstworldproblems #interview #sex #meme #selfie #jomo #mentalhealthmatters",
    "content": "",
    "username": "RedSmileGroup",
    "subreddit": "RedSmileGroup",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121k5nv",
    "date": "2023-03-25 12:17:52",
    "title": "Gendern erkannt in /r/de !",
    "content": "Hier wurde gegendert -> https://reddit.com/r/de/comments/121ftdm/ukraine_empört_über_vorwurf_willkürlicher/jdm2lzn/ :  \n\n Als jemand der zumindest ehrenamtlich bei Amnesty arbeitet und da einiges an Diskussionen zwischen ukrainischen Organisationen und Amnesty mitbekommen hat, bin ich da einfach relativ desillusioniert. Als die ersten Berichte mutmaßlicher Kriegsverbrechen von ukrainischen Soldat:innen von Amnesty publik gemacht wurden, haben sich viele Organisationen offen gegen Amnesty gewandt, ihnen pro-russische Propaganda usw vorgeworfen. Dabei war Amnesty eine der ersten Institutionen, die humanitäre Hilfe geleistet, Netzwerke geschaffen und vor allem maßgeblich an der Aufklärung der russischen Kriegsverbrechen beteiligt war. So eine plötzliche Undankbarkeit und deutliche Abgrenzung habe ich nicht erwartet tbh. \n\n“Rules for thee but not for me” ist ein Grundsatz der besonders bei Kriegsverbrechen einen mehr als bitten Beigeschmack hat, weil die Gewalt komplett institutionalisiert ist. Selbst bei Einzeltäter:innen gibt es immer jemanden, der hätte aufpassen müssen. Und btw; Wagenknecht und Co ist es scheißegal was die deutsche Presse berichtet. Die denken sich sowieso Geschichten aus und propagieren “den bösen Westen”, bei Corona hat man meiner Meinung nach gesehen, dass Schwurbler auch ohne jedweder Beweis oder Medienbericht eine eigene Realität erschaffen.  \n  \nInsgesamt hat dieser User schon **29** mal gegendert!  \nSein Privileg: **Zerstörer*in des generischen Maskulinums**.",
    "username": "DurchgepeitschterBot",
    "subreddit": "Genderscanner",
    "commentCount": 0,
    "score": 1
  },
  {
    "id": "121knz8",
    "date": "2023-03-25 12:39:29",
    "title": "It's a common cliche of Russian propaganda that Ukraine is full of satanist Nazis. How prevalent are really the proponents of fascism and far-right ideologies? How much influence do they have? How would the war impact their numbers?",
    "content": "How does it compare to other European countries?",
    "username": "Affectionate-Dig6800",
    "subreddit": "u_Affectionate-Dig6800"
  },
  {
    "id": "121kivx",
    "date": "2023-03-25 12:33:27",
    "title": "Ukraine war: Battle for Bakhmut 'stabilising', says commander",
    "content": "This is the best tl;dr I could make, [original](https://www.bbc.com/news/world-europe-65072173) reduced by 56%. (I'm a bot)\n*****\n> The battle for Bakhmut, the Ukrainian city which Russia has spent months trying to capture, is &quot;Stabilising&quot;, says Ukraine&#039;s commander in chief.\n\n> On Facebook, Lt Gen Zaluzhnyi said that while the situation on Ukraine&#039;s frontlines &quot;Is the toughest in the Bakhmut direction...due to the tremendous efforts of the defence forces, we are managing to stabilise the situation&quot;.\n\n> His comments are the latest positive signal from Ukrainian officials about the long battle for Bakhmut.\n\n> Mr Syrsky added that while Russia &quot;Has not given up hope of taking Bakhmut at all costs despite losses in manpower and equipment... they are losing significant strength&quot;.\n\n> On Wednesday, the UK said a Ukrainian counter-attack to the west of Bakhmut is likely to relieve pressure on a supply route to the city, and that Russia&#039;s attack on the city could be losing the &quot;Limited momentum&quot; it had. But the statement added that &quot;Ukrainian defence remains at risk from envelopment from the north and south&quot;.\n\n> The Institute for War said on Thursday that while Ukraine is still outnumbered by the Wagner group, Ukrainian forces &quot;Continue to exhaust the mercenaries, which will enable Ukrainian forces to pursue unspecified future offensive operations&quot;.\n\n\n*****\n[**Summary Source**](https://smmry.com/https://www.bbc.com/news/world-europe-65072173) | [FAQ](http://autotldr.io/ \"612073 summaries so far.\") | [Feedback](http://www.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Bakhmut**^#1 **Ukrainian**^#2 **Russia**^#3 **city**^#4 **Ukraine**^#5\n\nPost found in [/r/ukraine](http://np.reddit.com/r/ukraine/comments/121ff9v/ukraine_war_battle_for_bakhmut_stabilising_says/), [/r/UkrainianConflict](http://np.reddit.com/r/UkrainianConflict/comments/12138h1/ukraine_war_battle_for_bakhmut_stabilising/), [/r/worldnews](http://np.reddit.com/r/worldnews/comments/121kecg/battle_for_bakhmut_stabilising_says_commander/), [/r/UkrainianConflict](http://np.reddit.com/r/UkrainianConflict/comments/12138h1/ukraine_war_battle_for_bakhmut_stabilising/) and [/r/RussianInvasion](http://np.reddit.com/r/RussianInvasion/comments/12169ll/ukraine_war_battle_for_bakhmut_stabilising/).\n\n*NOTICE*: This thread is for discussing the submission topic. Please do not discuss the concept of the [autotldr](http://www.reddit.com/user/autotldr) bot here.",
    "username": "autotldr",
    "subreddit": "autotldr"
  },
  {
    "id": "121kimd",
    "date": "2023-03-25 12:33:09",
    "title": "Russia’s War on Ukraine’s Environment: New Report Identifies Impacts. A report released by Ukrainian NGOs outlines how Russia’s full-scale invasion is not only destroying people and places, but the environment they rely on for life. - Who knows how long it will take for the environment to recover!",
    "content": "",
    "username": "Yokhan77",
    "subreddit": "LoveForUkraine"
  },
  {
    "id": "121kgcq",
    "date": "2023-03-25 12:30:28",
    "title": "Day 395 of WW3: President Volodymyr Zelensky expressed optimism that cooperation with European allies could bring a victory by the end of the year. It's your Saturday Russo-Ukraine war discussion",
    "content": "",
    "username": "farklinkbot",
    "subreddit": "fark"
  },
  {
    "id": "121kd9w",
    "date": "2023-03-25 12:26:51",
    "title": "[World] - The IMF's $15.6 billion loan to Ukraine will be its first to a country at war | NPR",
    "content": "",
    "username": "AutoNewspaperAdmin",
    "subreddit": "AutoNewspaper"
  },
  {
    "id": "121kd45",
    "date": "2023-03-25 12:26:40",
    "title": "ISW Russian Offensive Campaign Assessment, March 24, 2023 - Latest from the Institute for the Study of War.",
    "content": "",
    "username": "Yokhan77",
    "subreddit": "LoveForUkraine"
  },
  {
    "id": "121kwt4",
    "date": "2023-03-25 12:49:58",
    "title": "Nordic countries plan joint air defence to counter Russian threat | Russia-Ukraine war News",
    "content": "",
    "username": "Yourwill619Hub23",
    "subreddit": "Studingpigeon"
  },
  {
    "id": "121kwst",
    "date": "2023-03-25 12:49:57",
    "title": "Nordic countries plan joint air defence to counter Russian threat | Russia-Ukraine war News",
    "content": "",
    "username": "Yourwill619Hub23",
    "subreddit": "u_Yourwill619Hub23"
  },
  {
    "id": "121kvq1",
    "date": "2023-03-25 12:48:44",
    "title": "UN concerned over war crimes in Ukraine but many remain in the dark | DW...",
    "content": "",
    "username": "rmaccr",
    "subreddit": "europe"
  },
  {
    "id": "121kvib",
    "date": "2023-03-25 12:48:30",
    "title": "Why",
    "content": "The Krab and the K9 use the same chassis so why will they both be made at the same time",
    "username": "the_enthusiastman",
    "subreddit": "TankPorn"
  },
  {
    "id": "121layb",
    "date": "2023-03-25 13:05:59",
    "title": "India Ranking below Iraq, Pakistan, Sri Lanka and even Ukraine in 'Happiness index'. Koi sense hai is baat me ? 🤦😂",
    "content": "",
    "username": "Gems_Of_West",
    "subreddit": "Sham_Sharma_Show"
  },
  {
    "id": "121l2x0",
    "date": "2023-03-25 12:57:06",
    "title": "Andriy Shevchenko helping rebuild childhood stadium destroyed by war in Ukraine",
    "content": "",
    "username": "islandhopper39",
    "subreddit": "ukraine"
  },
  {
    "id": "121lryi",
    "date": "2023-03-25 13:24:52",
    "title": "A new civilization is born",
    "content": "Dear President Putin,\n\nWe hold that your recent meeting with President Xi was a turning point in the history of your country as well as the world.  In retrospect, the invasion of Ukraine might be seen by future historians as a costly but necessary diversion to create your legacy: a Russia that pivots to the East rather than to the West.\n\nThe [Peace Plan for Ukraine](https://www.reddit.com/r/Peace_In_Ukraine/comments/11nnsj2/our_7point_peace_plan_for_the_war_in_ukraine/?utm_medium=android_app&utm_source=share) will memorialize your pivot to the East. It provides a corridor to connect Russian-speaking communities in Ukraine, Moldova, and Crimea. It further details a mechanism to protect additional Russian-majority populations throughout Ukraine. \n\nNow it is time to completely pull out of Ukraine as specified in the Plan. Today. The people of these areas are too infected by the West, let them be. They may have to sink with the West as it drowns from its own decadence.\n\nThe real work begins immediately after. We have suggested that you rename your country \"Siber-Rus\" to implant in people's minds your vision. Instead of seeing the mission of outlying republics as supporting Moscow and St. Petersburg, declare that the pivot entails viewing the purpose of Moscow and St. Petersburg as one of supporting the outlying republics. Every one of them.\n\nThe world will soon rediscover there the essence of your vision. Proud, resilient, grounded people who are the firmament of the earth. A new civilization will gather in strength and purpose and engage in humanitarian competition with the West.\n\n\"To whom much is given, much will be required\" (Luke 12:48).  Using  your leverage, following the precedent of the Decembrists, you must encourage the new oligarchs to move east as well and create oases of culture, education, and talent.\n\nSoon it is time for you and President Biden to resign and start your work at the Putin-Biden International Peace Center. We already have proposed a[location for the Institute](https://www.reddit.com/r/Peace_In_Ukraine/comments/10o6di9/the_birth_of_a_new_country_siberiarus/?utm_medium=android_app&utm_source=share).\n\nYour final task? Find your successor. You may have one in mind already but we suggest the following profile:\n\n1. A woman in the mold of a Catherine the Great,  Indira Ghandi, Margaret Thatcher, or Golda Meir. This person must be strong-willed and smart enough to yank the country in the new direction and resist any other centers of traditional power in the Old Russia.\n\n2.  Deep roots in one of the outlying Republics. She will not, of course, be the only leader in recent history to come from such regions.\n\nWe have but one request. Please bury Western fashion.  This has been done in much of MENA. Throw out every designer suit and tie. Haven't you just recreated the \"Golden Horde, the Kipchak Khanate, the Ulus Juchi, the western part of the Mongol empire which flourished from the mid-13th century to the end of the 14th century? You are a modern-day Genghis Khan, Juchi, and Batu. Dress like them.\n\nSigned on behalf of billions of people,\n\nu/Clear-Sight-Moon \nu/TrueReconciliation",
    "username": "Clear-Sight-Moon",
    "subreddit": "Peace_In_Ukraine"
  },
  {
    "id": "121lpyn",
    "date": "2023-03-25 13:22:34",
    "title": "I don't know if I'll survive so I want to share my music",
    "content": "Hello! I’m Denis from Ukraine. Now I’m a soldier defending my country from thoserussians™\n\nBut a year earlier I was a beginner composer and music producer. I want to share with you some of my music. \n\nI hope we win soon and the war ends. I really want to return to doing what I love doing and continue to develop. Peace for everyone. \n\n[Denis Zinoviev - Out there](https://youtu.be/fksJP3ValIk)\n\n[Denis Zinoviev - El Gato con Botas](https://youtu.be/zgfHKSLXXvw)\n\n[Denis Zinoviev - Dragon Valley](https://youtu.be/VIqCl0sGLQs)",
    "username": "PelsGewie",
    "subreddit": "Music"
  },
  {
    "id": "121lpbl",
    "date": "2023-03-25 13:21:54",
    "title": "Russia may be shifting focus from offensive to defensive | NHK WORLD-JAPAN News",
    "content": "This is the best tl;dr I could make, [original](https://www3.nhk.or.jp/nhkworld/en/news/20230325_16/) reduced by 30%. (I'm a bot)\n*****\n> There is a growing view that Russian troops are losing momentum in their attack on the eastern Ukrainian city of Bakhmut.\n\n> Zaluzhnyi acknowledged during the talks that the situation is the &quot;Toughest in the Bakhmut direction&quot; but said Ukraine is managing to stabilize the situation due to the efforts of its defense forces.\n\n> Britain&#039;s defense ministry said on Saturday that Russia&#039;s assault on Bakhmut has &quot;Largely stalled,&quot; citing &quot;Extreme attrition&quot; of the Russian forces as a cause.\n\n> The ministry added that the Russian situation in Bakhmut was likely worsened by tensions between the paramilitary Wagner group and the Russian defense ministry.\n\n> The Institute for the Study of War, a US think tank, stated on Friday that &quot;The Russian information space appears to be responding to the slow-down of Russian operations and potential for Ukraine to regain the initiative with substantial anxiety.\"\n\n> The institute said Russia&#039;s military command will need to commit a significant number of forces to the frontline to reverse the situation, but that it is unlikely that such forces exist at sufficient scale.\n\n\n*****\n[**Summary Source**](https://smmry.com/https://www3.nhk.or.jp/nhkworld/en/news/20230325_16/) | [FAQ](http://autotldr.io/ \"612081 summaries so far.\") | [Feedback](http://www.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **Russian**^#1 **Bakhmut**^#2 **forces**^#3 **situation**^#4 **Russia**^#5\n\nPost found in [/r/worldnews](http://np.reddit.com/r/worldnews/comments/121lh7q/russia_may_be_shifting_focus_from_offensive_to/).\n\n*NOTICE*: This thread is for discussing the submission topic. Please do not discuss the concept of the [autotldr](http://www.reddit.com/user/autotldr) bot here.",
    "username": "autotldr",
    "subreddit": "autotldr"
  },
  {
    "id": "121lkng",
    "date": "2023-03-25 13:16:51",
    "title": "UN human rights mission denounces Russia, Ukraine for POW executions",
    "content": "This is the best tl;dr I could make, [original](https://www3.nhk.or.jp/nhkworld/en/news/20230325_08/) reduced by 38%. (I'm a bot)\n*****\n> A United Nations human rights monitoring group has denounced both Russia and Ukraine for having executed prisoners of war amid the Russian invasion of Ukraine.\n\n> The UN Human Rights Monitoring Mission in Ukraine released a report on Friday based on interviews with 432 people, including Russian and Ukrainian POWs and their relatives.\n\n> The mission says it documented summary executions of 15 POWs by the Russian side and those of up to 25 POWs and others by Ukrainian forces.\n\n> It says more than 84 percent of the 203 POWs detained by Russia said they were tortured or ill-treated, and that five of them died of injuries caused by torture.\n\n> The report says about half of the 229 POWs detained by Ukraine were tortured or ill-treated.\n\n> Mission chief Matilda Bogner expressed concern about executions of POWs, saying that the large-scale impact on civilians will continue unless both parties of the conflict ensure full compliance with international humanitarian law.\n\n\n*****\n[**Summary Source**](https://smmry.com/https://www3.nhk.or.jp/nhkworld/en/news/20230325_08/) | [FAQ](http://autotldr.io/ \"612078 summaries so far.\") | [Feedback](http://www.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **POWs**^#1 **torture**^#2 **Ukraine**^#3 **Russian**^#4 **Mission**^#5\n\nPost found in [/r/worldnews](http://np.reddit.com/r/worldnews/comments/121lftl/un_human_rights_mission_denounces_russia_ukraine/).\n\n*NOTICE*: This thread is for discussing the submission topic. Please do not discuss the concept of the [autotldr](http://www.reddit.com/user/autotldr) bot here.",
    "username": "autotldr",
    "subreddit": "autotldr"
  },
  {
    "id": "121m15s",
    "date": "2023-03-25 13:34:47",
    "title": "US Munition Production Status in the Cold War?",
    "content": "So there have been more than a few questions regarding US and NATO’s ammunition stockpiles due to reports of the difficulties in producing and sending enough artillery shells to Ukraine for their artillery duel against the Russians. This has also raised concern about PGM and missile stockpiles for a potential war across the Pacific.\n\nThis is only the latest news however, with a similar report of stockpile shortages back in 2011, as stated by this [Washington Post article](https://www.washingtonpost.com/world/nato-runs-short-on-some-munitions-in-libya/2011/04/15/AF3O7ElD_story.html), during the NATO air intervention in Libya that depleted precision munitions for the European air units.\n\nAnd I don’t know if this is in the same caliber (figuratively, not literally) as the above situations, but there were also reports of small arms ammunition shortages in the United States, such as this [2007 NBC News article](https://www.nbcnews.com/id/wbna20322566), during the height of their involvement in Iraq and Afghanistan.\n\nI have seen two separate arguments for the causes of these situations:\n* One was that precision munition type weaponry are getting more expensive, more complicated to produce, and consequently more difficult to procure. Meaning that creating large stockpiles of these kinds of weapons are a significant budget commitment. (probably doesn’t apply to dumb artillery shells nor small arms cartridges examples)\n* Second was that US and Europe have been in a “peacetime” economy to the extent that it has hurt munitions manufacturing capacity, resulting in the long tool up time to get the production lines ready for Ukraine’s demands.\n\nSo with that, I’d like to ask about US munition production in the Cold War, particularly in artillery and early PGM munitions, because I want to better understand the state of affairs the US was in regarding ammunition production prior to the collapse of the Soviet Union.\n\nLike, I know it was probably “better”, but by how much? A significant enough? Could it sustain an artillery conflict that the Russo-Ukraine War has shown could happen?\n\nThanks for reading.",
    "username": "Inceptor57",
    "subreddit": "WarCollege"
  },
  {
    "id": "121magu",
    "date": "2023-03-25 13:44:43",
    "title": "Ukraine war: Battle for Bakhmut 'stabilising', says commander",
    "content": "",
    "username": "SpecialistFold",
    "subreddit": "u_SpecialistFold"
  },
  {
    "id": "121m9ra",
    "date": "2023-03-25 13:43:56",
    "title": "Austrian FM: Russia’s war in Ukraine is not ‘black and white’ | Russia-Ukraine war",
    "content": "",
    "username": "Yourwill619Hub23",
    "subreddit": "Studingpigeon"
  },
  {
    "id": "121m9qv",
    "date": "2023-03-25 13:43:55",
    "title": "Austrian FM: Russia’s war in Ukraine is not ‘black and white’ | Russia-Ukraine war",
    "content": "",
    "username": "Yourwill619Hub23",
    "subreddit": "u_Yourwill619Hub23"
  },
  {
    "id": "121mxi7",
    "date": "2023-03-25 14:09:01",
    "title": "It's a common cliche of Russian propaganda that Ukraine is full of satanist Nazis. How prevalent are really the proponents of fascism and far-right ideologies? How much influence do they have? How would the war impact their numbers?",
    "content": "How does it compare to other European countries?",
    "username": "Unique-Pie-3784",
    "subreddit": "u_Unique-Pie-3784"
  },
  {
    "id": "121n0xm",
    "date": "2023-03-25 14:12:36",
    "title": "Russia puts Putin’s ex-speechwriter on wanted list over Ukraine | Russia-Ukraine war News",
    "content": "",
    "username": "Yourwill619Hub23",
    "subreddit": "Studingpigeon"
  },
  {
    "id": "121n0xd",
    "date": "2023-03-25 14:12:35",
    "title": "Russia puts Putin’s ex-speechwriter on wanted list over Ukraine | Russia-Ukraine war News",
    "content": "",
    "username": "Yourwill619Hub23",
    "subreddit": "u_Yourwill619Hub23"
  }
]
